{"0":{"Name":"Alternating Kettlebell Row","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"kettlebells","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Place two kettlebells in front of your feet. Bend your knees slightly and push your butt out as much as possible. As you bend over to get into the starting position grab both kettlebells by the handles.","Pull one kettlebell off of the floor while holding on to the other kettlebell. Retract the shoulder blade of the working side, as you flex the elbow, drawing the kettlebell towards your stomach or rib cage.","Lower the kettlebell in the working arm and repeat with your other arm."],"Category":"strength"},"1":{"Name":"Alternating Renegade Row","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["middle back"],"SecondaryMuscles":["abdominals","biceps","chest","lats","triceps"],"Instructions":["Place two kettlebells on the floor about shoulder width apart. Position yourself on your toes and your hands as though you were doing a pushup, with the body straight and extended. Use the handles of the kettlebells to support your upper body. You may need to position your feet wide for support.","Push one kettlebell into the floor and row the other kettlebell, retracting the shoulder blade of the working side as you flex the elbow, pulling it to your side.","Then lower the kettlebell to the floor and begin the kettlebell in the opposite hand. Repeat for several reps."],"Category":"strength"},"2":{"Name":"Bent Over Barbell Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats","shoulders"],"Instructions":["Holding a barbell with a pronated grip (palms facing down), bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The barbell should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.","Now, while keeping the torso stationary, breathe out and lift the barbell to you. Keep the elbows close to the body and only use the forearms to hold the weight. At the top contracted position, squeeze the back muscles and hold for a brief pause.","Then inhale and slowly lower the barbell back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"3":{"Name":"Bent Over One-Arm Long Bar Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats","lower back","traps"],"Instructions":["Put weight on one of the ends of an Olympic barbell. Make sure that you either place the other end of the barbell in the corner of two walls; or put a heavy object on the ground so the barbell cannot slide backward.","Bend forward until your torso is as close to parallel with the floor as you can and keep your knees slightly bent.","Now grab the bar with one arm just behind the plates on the side where the weight was placed and put your other hand on your knee. This will be your starting position.","Pull the bar straight up with your elbow in (to maximize back stimulation) until the plates touch your lower chest. Squeeze the back muscles as you lift the weight up and hold for a second at the top of the movement. Breathe out as you lift the weight. Tip: Do not allow for any swinging of the torso. Only the arm should move.","Slowly lower the bar to the starting position getting a nice stretch on the lats. Tip: Do not let the plates touch the floor. To ensure the best range of motion, I recommend using small plates (25-lb ones) as opposed to larger plates (like 35-45lb ones).","Repeat for the recommended amount of repetitions and switch arms."],"Category":"strength"},"4":{"Name":"Bent Over Two-Arm Long Bar Row","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Put weight on one of the ends of an Olympic barbell. Make sure that you either place the other end of the barbell in the corner of two walls; or put a heavy object on the ground so the barbell cannot slide backward.","Bend forward until your torso is as close to parallel with the floor as you can and keep your knees slightly bent.","Now grab the bar with both arms just behind the plates on the side where the weight was placed and put your other hand on your knee. This will be your starting position.","Pull the bar straight up with your elbows in (to maximize back stimulation) until the plates touch your lower chest. Squeeze the back muscles as you lift the weight up and hold for a second at the top of the movement. Breathe out as you lift the weight. Tip: Use a stirrup or double handle cable attachment by hooking it under the end of the bar.","Slowly lower the bar to the starting position getting a nice stretch on the lats. Tip: Do not let the plates touch the floor. To ensure the best range of motion, I recommend using small plates (25-lb ones) as opposed to larger plates (like 35-45lb ones).","Repeat for the recommended amount of repetitions."],"Category":"strength"},"5":{"Name":"Bent Over Two-Dumbbell Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats","shoulders"],"Instructions":["With a dumbbell in each hand (palms facing your torso), bend your knees slightly and bring your torso forward by bending at the waist; as you bend make sure to keep your back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The weights should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.","While keeping the torso stationary, lift the dumbbells to your side (as you breathe out), keeping the elbows close to the body (do not exert any force with the forearm other than holding the weights). On the top contracted position, squeeze the back muscles and hold for a second.","Slowly lower the weight again to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"6":{"Name":"Bent Over Two-Dumbbell Row With Palms In","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["With a dumbbell in each hand (palms facing each other), bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The weights should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.","While keeping the torso stationary, lift the dumbbells to your side as you breathe out, squeezing your shoulder blades together. On the top contracted position, squeeze the back muscles and hold for a second.","Slowly lower the weight again to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"7":{"Name":"Bodyweight Mid Row","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Begin by taking a medium to wide grip on a pull-up apparatus with your palms facing away from you. From a hanging position, tuck your knees to your chest, leaning back and getting your legs over your side of the pull-up apparatus. This will be your starting position.","Beginning with your arms straight, flex the elbows and retract the shoulder blades to raise your body up until your legs contact the pull-up apparatus.","After a brief pause, return to the starting position."],"Category":"strength"},"8":{"Name":"Dumbbell Incline Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","forearms","lats","shoulders"],"Instructions":["Using a neutral grip, lean into an incline bench.","Take a dumbbell in each hand with a neutral grip, beginning with the arms straight. This will be your starting position.","Retract the shoulder blades and flex the elbows to row the dumbbells to your side.","Pause at the top of the motion, and then return to the starting position."],"Category":"strength"},"9":{"Name":"Incline Bench Pull","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["lats","shoulders"],"Instructions":["Grab a dumbbell in each hand and lie face down on an incline bench that is set to an incline that is approximately 30 degrees.","Let the arms hang to your sides fully extended as they point to the floor.","Turn the wrists until your hands have a pronated (palms down) grip.","Now flare the elbows out. This will be your starting position.","As you breathe out, start to pull the dumbbells up as if you are doing a reverse bench press. You will do this by bending at the elbows and bringing the upper arms up as you let the forearms hang. Continue this motion until the upper arms are at the same level as your back. Tip: The elbows will come out to the side and your upper arms and torso should make the letter \"T\" at the top of the movement. Hold the contraction at the top for a second.","Slowly go back down to the starting position as you breathe in.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"10":{"Name":"Inverted Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":null,"PrimaryMuscles":["middle back"],"SecondaryMuscles":["lats"],"Instructions":["Position a bar in a rack to about waist height. You can also use a smith machine.","Take a wider than shoulder width grip on the bar and position yourself hanging underneath the bar. Your body should be straight with your heels on the ground with your arms fully extended. This will be your starting position.","Begin by flexing the elbow, pulling your chest towards the bar. Retract your shoulder blades as you perform the movement.","Pause at the top of the motion, and return yourself to the start position.","Repeat for the desired number of repetitions."],"Category":"strength"},"11":{"Name":"Inverted Row with Straps","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Hang a rope or suspension straps from a rack or other stable object. Grasp the ends and position yourself in a supine position hanging from the ropes. Your body should be straight with your heels on the ground with your arms fully extended. This will be your starting position.","Begin by flexing the elbow, pulling your chest to your hands. Retract your shoulder blades as you perform the movement.","Pause at the top of the motion, and return yourself to the start position.","Repeat for the desired number of repetitions."],"Category":"strength"},"12":{"Name":"Leverage High Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["middle back"],"SecondaryMuscles":["lats"],"Instructions":["Load an appropriate weight onto the pins and adjust the seat height so that you can just reach the handles above you. Adjust the knee pad to help keep you down. Grasp the handles with a pronated grip. This will be your starting position.","Pull the handles towards your torso, retracting your shoulder blades as you flex the elbow.","Pause at the bottom of the motion, and then slowly return the handles to the starting position.","For multiple repetitions, avoid completely returning the weight to the stops to keep tension on the muscles being worked."],"Category":"strength"},"13":{"Name":"Lying Cambered Barbell Row","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats","traps"],"Instructions":["Place a cambered bar underneath an exercise bench.","Lie face down on the exercise bench and grab the bar using a palms down (pronated grip) that is wider than shoulder width. This will be your starting position.","As you exhale row the bar up as you keep the elbows close to your body to either your chest, in order to target the upper mid back, or to your stomach if targeting the lats is your goal.","After a second hold at the top, lower back down to the starting position slowly as you inhale."],"Category":"strength"},"14":{"Name":"Lying T-Bar Row","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Load up the T-bar Row Machine with the desired weight and adjust the leg height so that your upper chest is at the top of the pad. Tip: In some machines all you can do is stand on the appropriate step that allows you to be at a height that has the upper chest at the top of the pad.","Lay face down on the pad and grab the handles. You can either use a palms down, palms up, or palms in position depending on what part of your back you want to emphasize.","Lift the bar off the rack and extend your arms in front of you. This will be your starting position.","As you exhale slowly pull the weight up and squeeze your back at the top of the movement. Tip: Keep the upper arms as close to the torso as possible throughout the movement in order to better engage the back muscles. Also, do not lift your body off of the pad at any time and refrain from using the biceps to lift the weight.","After a second contraction at the top of the movement, as you inhale, slowly go back down to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"15":{"Name":"Middle Back Shrug","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":[],"Instructions":["Lie facedown on an incline bench while holding a dumbbell in each hand. Your arms should be fully extended hanging down and pointing towards the floor. The palms of your hands should be facing each other. This will be your starting position.","As you exhale, squeeze your shoulder blades together and hold the contraction for a full second. Tip: This movement is just like the reverse action of a hug, or trying to perform rear laterals as if you had no arms.","As you inhale go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"16":{"Name":"Middle Back Stretch","Force":"static","Level":"beginner","Mechanic":"isolation","Equipment":null,"PrimaryMuscles":["middle back"],"SecondaryMuscles":["abdominals","lats","lower back"],"Instructions":["Stand so your feet are shoulder width apart and your hands are on your hips.","Twist at your waist until you feel a stretch. Hold for 10 to 15 seconds, then twist to the other side."],"Category":"stretching"},"17":{"Name":"Mixed Grip Chin","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Using a spacing that is just about 1 inch wider than shoulder width, grab a pull-up bar with the palms of one hand facing forward and the palms of the other hand facing towards you. This will be your starting position.","Now start to pull yourself up as you exhale. Tip: With the arm that has the palms facing up concentrate on using the back muscles in order to perform the movement. The elbow of that arm should remain close to the torso. With the other arm that has the palms facing forward, the elbows will be away but in line with the torso. You will concentrate on using the lats to pull your body up.","After a second contraction at the top, start to slowly come down as you inhale.","Repeat for the recommended amount of repetitions.","On the following set, switch grips; so if you had the right hand with the palms facing you and the left one with the palms facing forward, on the next set you will have the palms facing forward for the right hand and facing you for the left."],"Category":"strength"},"18":{"Name":"One-Arm Dumbbell Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats","shoulders"],"Instructions":["Choose a flat bench and place a dumbbell on each side of it.","Place the right leg on top of the end of the bench, bend your torso forward from the waist until your upper body is parallel to the floor, and place your right hand on the other end of the bench for support.","Use the left hand to pick up the dumbbell on the floor and hold the weight while keeping your lower back straight. The palm of the hand should be facing your torso. This will be your starting position.","Pull the resistance straight up to the side of your chest, keeping your upper arm close to your side and keeping the torso stationary. Breathe out as you perform this step. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. Also, make sure that the force is performed with the back muscles and not the arms. Finally, the upper torso should remain stationary and only the arms should move. The forearms should do no other work except for holding the dumbbell; therefore do not try to pull the dumbbell up using the forearms.","Lower the resistance straight down to the starting position. Breathe in as you perform this step.","Repeat the movement for the specified amount of repetitions.","Switch sides and repeat again with the other arm."],"Category":"strength"},"19":{"Name":"One-Arm Kettlebell Row","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Place a kettlebell in front of your feet. Bend your knees slightly and then push your butt out as much as possible as you bend over to get in the starting position. Grab the kettlebell and pull it to your stomach, retracting your shoulder blade and flexing the elbow. Keep your back straight. Lower and repeat."],"Category":"strength"},"20":{"Name":"One-Arm Long Bar Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Position a bar into a landmine or in a corner to keep it from moving. Load an appropriate weight onto your end.","Stand next to the bar, and take a grip with one hand close to the collar. Using your hips and legs, rise to a standing position.","Assume a bent-knee stance with your hips back and your chest up. Your arm should be extended. This will be your starting position.","Pull the weight to your side by retracting the shoulder and flexing the elbow. Do not jerk the weight or cheat during the movement.","After a brief pause, return to the starting position."],"Category":"strength"},"21":{"Name":"One Arm Chin-Up","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","forearms","lats"],"Instructions":["For this exercise, start out by placing a towel around a chin up bar.","Grab the chin-up bar with your palm facing you. One hand will be grabbing the chin-up bar and the other will be grabbing the towel.","Bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.v","Pull your torso up until the bar touches your upper chest by drawing the shoulders and the upper arms down and back. Exhale as you perform this portion of the movement. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary as it moves through space and only the arms should move. The forearms should do no other work other than hold the bar.","After a second on the contracted position, start to inhale and slowly lower your torso back to the starting position when your arms are fully extended and the lats are fully stretched.","Repeat this motion for the prescribed amount of repetitions.","Switch arms and repeat the movement."],"Category":"strength"},"22":{"Name":"Reverse Grip Bent-Over Rows","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats","shoulders"],"Instructions":["Stand erect while holding a barbell with a supinated grip (palms facing up).","Bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The barbell should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.","While keeping the torso stationary, lift the barbell as you breathe out, keeping the elbows close to the body and not doing any force with the forearm other than holding the weights. On the top contracted position, squeeze the back muscles and hold for a second.","Slowly lower the weight again to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"23":{"Name":"Rhomboids-SMR","Force":"static","Level":"intermediate","Mechanic":null,"Equipment":"foam roll","PrimaryMuscles":["middle back"],"SecondaryMuscles":["traps"],"Instructions":["Lay down with your back on the floor. Place a foam roll underneath your upper back, and cross your arms in front of you, protracting your shoulders. This will be your starting position.","Raise your hips off of the ground, placing your weight onto the foam roll. Shift your weight to one side at a time, rolling over your middle and upper back. Pause at points of tension for 10-30 seconds."],"Category":"stretching"},"24":{"Name":"Seated Cable Rows","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"cable","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats","shoulders"],"Instructions":["For this exercise you will need access to a low pulley row machine with a V-bar. Note: The V-bar will enable you to have a neutral grip where the palms of your hands face each other. To get into the starting position, first sit down on the machine and place your feet on the front platform or crossbar provided making sure that your knees are slightly bent and not locked.","Lean over as you keep the natural alignment of your back and grab the V-bar handles.","With your arms extended pull back until your torso is at a 90-degree angle from your legs. Your back should be slightly arched and your chest should be sticking out. You should be feeling a nice stretch on your lats as you hold the bar in front of you. This is the starting position of the exercise.","Keeping the torso stationary, pull the handles back towards your torso while keeping the arms close to it until you touch the abdominals. Breathe out as you perform that movement. At that point you should be squeezing your back muscles hard. Hold that contraction for a second and slowly go back to the original position while breathing in.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"25":{"Name":"Seated One-arm Cable Pulley Rows","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"cable","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats","traps"],"Instructions":["To get into the starting position, first sit down on the machine and place your feet on the front platform or crossbar provided making sure that your knees are slightly bent and not locked.","Lean over as you keep the natural alignment of your back and grab the single handle attachment with your left arm using a palms-down grip.","With your arm extended pull back until your torso is at a 90-degree angle from your legs. Your back should be slightly arched and your chest should be sticking out. You should be feeling a nice stretch on your lat as you hold the bar in front of you. The right arm can be kept by the waist. This is the starting position of the exercise.","Keeping the torso stationary, pull the handles back towards your torso while keeping the arms close to it as you rotate the wrist, so that by the time your hand is by your abdominals it is in a neutral position (palms facing the torso). Breathe out as you perform that movement. At that point you should be squeezing your back muscles hard.","Hold that contraction for a second and slowly go back to the original position while breathing in. Tip: Remember to rotate the wrist as you go back to the starting position so that the palms are facing down again.","Repeat for the recommended amount of repetitions and then perform the same movement with the right hand."],"Category":"strength"},"26":{"Name":"Sled Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Attach dual handles to a sled connected by a rope or chain. Load the sled to an appropriate weight. Face the sled, backing up until there is some tension in the line.","With a handle in each hand, bend the knees slightly, keep your head and chest up, and begin with your arms extended.","To initiate the movement, flex the elbow as you retract your shoulder blades, pulling the sled towards you.","Take a step or two back to get tension in the line and repeat."],"Category":"strength"},"27":{"Name":"Smith Machine Bent Over Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats","shoulders"],"Instructions":["Set the barbell attached to the smith machine to a height that is about 2 inches below your knees.","Bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up.","Now grasp the barbell using an overhand (pronated) grip and unlock it from the smith machine rack. Then let it hang directly in front of you as your arms hang extended perpendicular to the floor and your torso. This is your starting position.","While keeping the torso stationary, lift the barbell as you breathe out, keeping the elbows close to the body and not doing any force with the forearm other than holding the weights. On the top contracted position, squeeze the back muscles and hold for a second.","Slowly lower the weight again to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"28":{"Name":"Spinal Stretch","Force":"static","Level":"beginner","Mechanic":"isolation","Equipment":null,"PrimaryMuscles":["middle back"],"SecondaryMuscles":["lats","lower back","neck","traps"],"Instructions":["Sit in a chair so your back is straight and your feet planted on the floor.","Interlace your fingers behind your head, elbows out and your chin down.","Twist your upper body to one side about 3 times as far as you can. Then lean forward and twist your torso to reach your elbow to the floor on the inside of your knee.","Return to upright position and then repeat for your other side."],"Category":"stretching"},"29":{"Name":"Straight Bar Bench Mid Rows","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Place a loaded barbell on the end of a bench. Standing on the bench behind the bar, take a medium, pronated grip. Stand with your hips back and chest up, maintaining a neutral spine. This will be your starting position.","Row the bar to your torso by retracting the shoulder blades and flexing the elbows. Use a controlled movement with no jerking.","After a brief pause, slowly return the bar to the starting position, ensuring to go all the way down."],"Category":"strength"},"30":{"Name":"Suspended Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Suspend your straps at around chest height. Take a handle in each hand and lean back. Keep your body erect and your head and chest up. Your arms should be fully extended. This will be your starting position.","Begin by flexing the elbow to initiate the movement. Protract your shoulder blades as you do so.","At the completion of the motion pause, and then return to the starting position."],"Category":"strength"},"31":{"Name":"T-Bar Row with Handle","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Position a bar into a landmine or in a corner to keep it from moving. Load an appropriate weight onto your end.","Stand over the bar, and position a Double D row handle around the bar next to the collar. Using your hips and legs, rise to a standing position.","Assume a wide stance with your hips back and your chest up. Your arms should be extended. This will be your starting position.","Pull the weight to your upper abdomen by retracting the shoulder blades and flexing the elbows. Do not jerk the weight or cheat during the movement.","After a brief pause, return to the starting position."],"Category":"strength"},"32":{"Name":"Two-Arm Kettlebell Row","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Place two kettlebells in front of your feet. Bend your knees slightly and then push your butt out as much as possible as you bend over to get in the starting position.","Grab both kettlebells and pull them to your stomach, retracting your shoulder blades and flexing the elbows. Keep your back straight. Lower and repeat."],"Category":"strength"},"33":{"Name":"Upper Back Stretch","Force":"static","Level":"beginner","Mechanic":null,"Equipment":null,"PrimaryMuscles":["middle back"],"SecondaryMuscles":["middle back"],"Instructions":["Clasp fingers together with your thumbs pointing down, round your shoulders as you reach your hands forward."],"Category":"stretching"}}