{"0":{"Name":"Alternating Renegade Row","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["middle back"],"SecondaryMuscles":["abdominals","biceps","chest","lats","triceps"],"Instructions":["Place two kettlebells on the floor about shoulder width apart. Position yourself on your toes and your hands as though you were doing a pushup, with the body straight and extended. Use the handles of the kettlebells to support your upper body. You may need to position your feet wide for support.","Push one kettlebell into the floor and row the other kettlebell, retracting the shoulder blade of the working side as you flex the elbow, pulling it to your side.","Then lower the kettlebell to the floor and begin the kettlebell in the opposite hand. Repeat for several reps."],"Category":"strength"},"1":{"Name":"Atlas Stones","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["lower back"],"SecondaryMuscles":["abdominals","adductors","biceps","calves","forearms","glutes","hamstrings","middle back","quadriceps","traps"],"Instructions":["Begin with the atlas stone between your feet. Bend at the hips to wrap your arms vertically around the Atlas Stone, attempting to get your fingers underneath the stone. Many stones will have a small flat portion on the bottom, which will make the stone easier to hold.","Pulling the stone into your torso, drive through the back half of your feet to pull the stone from the ground.","As the stone passes the knees, lap it by sitting backward, pulling the stone on top of your thighs.","Sit low, getting the stone high onto your chest as you change your grip to reach over the stone. Stand, driving through with your hips. Close distance to the loading platform, and lean back, extending the hips to get the stone as high as possible."],"Category":"strongman"},"2":{"Name":"Barbell Ab Rollout - On Knees","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["lower back","shoulders"],"Instructions":["Hold an Olympic barbell loaded with 5-10lbs on each side and kneel on the floor.","Now place the barbell on the floor in front of you so that you are on all your hands and knees (as in a kneeling push up position). This will be your starting position.","Slowly roll the barbell straight forward, stretching your body into a straight position. Tip: Go down as far as you can without touching the floor with your body. Breathe in during this portion of the movement.","After a second pause at the stretched position, start pulling yourself back to the starting position as you breathe out. Tip: Go slowly and keep your abs tight at all times."],"Category":"strength"},"3":{"Name":"Barbell Squat To A Bench","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","lower back"],"Instructions":["This exercise is best performed inside a squat rack for safety purposes. To begin, first place a flat bench or a box behind you. The flat bench is used to teach you to set your hips back and to hit depth.","","Then, set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.","Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.","Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section).","Begin to slowly lower the bar by bending the knees and sitting your hips back as you maintain a straight posture with the head up. Continue down until you slightly touch the bench behind you. Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to raise the bar as you exhale by pushing the floor with the heel of your foot as you straighten the legs and extend the hips to go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"4":{"Name":"Behind Head Chest Stretch","Force":"static","Level":"expert","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders"],"Instructions":["Sit upright on the floor with your partner behind you.","Place your hands behind your hand, and push your elbows back as far as you can. Your partner should hold your elbows. This will be your starting position.","Gently attempt to pull your elbows forward with your hands still behind your head for 10 or more seconds. Your partner should prevent your elbows from moving.","Now, relax your muscles and have your partner gently pull the elbows back as far as it comfortable for you. Be sure to let your partner know when the stretch is adequate to prevent overstretching or injury."],"Category":"stretching"},"5":{"Name":"Bench Press with Chains","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","lats","shoulders"],"Instructions":["Adjust the leader chain, shortening it to the desired length.Place the chains on the sleeves of the bar.","Lying on the bench, get your head beyond the bar if possible. Tuck your feet underneath you and arch your back. Using the bar to help support your weight, lift your shoulder off the bench and retract them, squeezing the shoulder blades together. Use your feet to drive your traps into the bench. Maintain this tight body position throughout the movement. However wide your grip, it should cover the ring on the bar.","Pull the bar out of the rack without protracting your shoulders. Focus on squeezing the bar and trying to pull it apart. Lower the bar to your lower chest or upper stomach. The bar, wrist, and elbow should stay in line at all times.","Pause when the barbell touches your torso, and then drive the bar up with as much force as possible. The elbows should be tucked in until lockout."],"Category":"powerlifting"},"6":{"Name":"Bent Press","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["glutes","hamstrings","lower back","quadriceps","shoulders","triceps"],"Instructions":["Clean a kettlebell to your shoulder. Clean the kettlebell to your shoulders by extending through the legs and hips as you raise the kettlebell towards your shoulder. The wrist should rotate as you do so. This will be your starting position.","Begin my leaning to the side opposite the kettlebell, continuing until you are able to touch the ground with your free hand, keeping your eyes on the kettlebell. As you do so, press the weight vertically be extending through the elbow, keeping your arm perpendicular to the ground.","Return to an upright position, with the kettlebell above your head. Return the kettlebell to the shoulder and repeat for the desired number of repetitions."],"Category":"strength"},"7":{"Name":"Box Squat with Bands","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","glutes","hamstrings","lower back"],"Instructions":["Begin in a power rack with a box at the appropriate height behind you. Set up the bands on the sleeves, secured to either band pegs, the rack, or dumbbells so that there is appropriate tension. If dumbbells are used, secure them so that they don't move. Also, ensure that the dumbbells you are using are heavy enough for the bands that you are using. Additional plates can be used to hold the dumbbells down. If more tension is needed, you can either widen the base on the floor or choke the bands. Typically, you would aim for a box height that brings you to a parallel squat, but you can train higher or lower if desired.","Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward.","With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box.","Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe. Use care to return the barbell to the rack."],"Category":"powerlifting"},"8":{"Name":"Box Squat with Chains","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","glutes","hamstrings","lower back"],"Instructions":["Begin in a power rack with a box at the appropriate height behind you. Typically, you would aim for a box height that brings you to a parallel squat, but you can train higher or lower if desired.","To set up the chains, begin by looping the leader chain over the sleeves of the bar. The heavy chain should be attached using a snap hook. Adjust the length of the lead chain so that a few links are still on the floor at the top of the movement.","Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward.","With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box.","Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe."],"Category":"strength"},"9":{"Name":"Circus Bell","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["forearms","glutes","hamstrings","lower back","traps","triceps"],"Instructions":["The circus bell is an oversized dumbbell with a thick handle. Begin with the dumbbell between your feet, and grip the handle with both hands.","Clean the dumbbell by extending through your hips and knees to deliver the implement to the desired shoulder, letting go with the extra hand.","Ensure that you get one of the dumbbell heads behind the shoulder to keep from being thrown off balance. To raise it overhead, dip by flexing the knees, and the drive upwards as you extend the dumbbell overhead, leaning slightly away from it as you do so.","Carefully guide the bell back to the floor, keeping it under control as much as possible. It is best to perform this event on a thick rubber mat to prevent damage to the floor."],"Category":"strongman"},"10":{"Name":"Clean and Jerk","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["abdominals","glutes","hamstrings","lower back","quadriceps","traps","triceps"],"Instructions":["With a barbell on the floor close to the shins, take an overhand or hook grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position.","Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight. Move the weight with control as you continue to above the knees.","Next comes the second pull, the main source of acceleration for the clean. As the bar approaches the mid-thigh position, begin extending through the hips. In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward. There should be no need to actively pull through the arms to accelerate the weight; at the end of the second pull, the body should be fully extended, leaning slightly back, with the arms still extended.","As full extension is achieved, transition into the third pull by aggressively shrugging and flexing the arms with the elbows up and out. At peak extension, aggressively pull yourself down, rotating your elbows under the bar as you do so. Receive the bar in a front squat position, the depth of which is dependent upon the height of the bar at the end of the third pull. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Continue to descend to the bottom squat position, which will help in the recovery.","Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position.","The second phase is the jerk, which raises the weight overhead. Standing with the weight racked on the front of the shoulders, begin with the dip. With your feet directly under your hips, flex the knees without moving the hips backward. Go down only slightly, and reverse direction as powerfully as possible.","Drive through the heels create as much speed and force as possible, and be sure to move your head out of the way as the bar leaves the shoulders.","At this moment as the feet leave the floor, the feet must be placed into the receiving position as quickly as possible. In the brief moment the feet are not actively driving against the platform, the athletes effort to push the bar up will drive them down. The feet should be split, with one foot forward, and one foot back. Receive the bar with the arms locked out overhead. Return to a standing position."],"Category":"olympic weightlifting"},"11":{"Name":"Deadlift with Bands","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["lower back"],"SecondaryMuscles":["forearms","glutes","hamstrings","middle back","quadriceps","traps"],"Instructions":["To deadlift with short bands, simply loop them over the bar before you start, and step into them to set up. For long bands, they will need to be anchored to a secure base, such as heavy dumbbells or a rack.","With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.","Lower the bar by bending at the hips and guiding it to the floor."],"Category":"powerlifting"},"12":{"Name":"Deadlift with Chains","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["lower back"],"SecondaryMuscles":["forearms","glutes","hamstrings","middle back","quadriceps","traps"],"Instructions":["You can attach the chains to the sleeves of the bar, or just drape the middle over the bar so there is a greater weight increase as you lift.","Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an overhand grip or an over/under grip on heavier sets. With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar.","Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.","Lower the bar by bending at the hips and guiding it to the floor."],"Category":"powerlifting"},"13":{"Name":"Double Kettlebell Snatch","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["glutes","hamstrings","quadriceps"],"Instructions":["Place two kettlebells behind your feet. Bend your knees and sit back to pick up the kettlebells.","Swing the kettlebells between your legs forcefully and reverse the direction.","Drive through with your hips and lock the ketttlebells overhead in one uninterrupted motion."],"Category":"strength"},"14":{"Name":"Front Barbell Squat","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, bring your arms up under the bar while keeping the elbows high and the upper arm slightly above parallel to the floor. Rest the bar on top of the deltoids and cross your arms while grasping the bar for total control.","Lift the bar off the rack by first pushing with your legs and at the same time straightening your torso.","Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).","Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to raise the bar as you exhale by pushing the floor mainly with the middle of your foot as you straighten the legs again and go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"15":{"Name":"Front Barbell Squat To A Bench","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["This exercise is best performed inside a squat rack for safety purposes. To begin, first set a flat bench behind you and set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, bring your arms up under the bar while keeping the elbows high and the upper arm slightly above parallel to the floor. Rest the bar on top of the deltoids and cross your arms while grasping the bar for total control.","Lift the bar off the rack by first pushing with your legs and at the same time straightening your torso.","Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).","Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until you touch the bench with your glutes. Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to raise the bar as you exhale by pushing the floor mainly with the heel of your foot as you straighten the legs again and go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"16":{"Name":"Handstand Push-Ups","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"body only","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["With your back to the wall bend at the waist and place both hands on the floor at shoulder width.","Kick yourself up against the wall with your arms straight. Your body should be upside down with the arms and legs fully extended. Keep your whole body as straight as possible. Tip: If doing this for the first time, have a spotter help you. Also, make sure that you keep facing the wall with your head, rather than looking down.","Slowly lower yourself to the ground as you inhale until your head almost touches the floor. Tip: It is of utmost importance that you come down slow in order to avoid head injury.","Push yourself back up slowly as you exhale until your elbows are nearly locked.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"17":{"Name":"Hang Snatch","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abdominals","calves","forearms","glutes","lower back","quadriceps","shoulders","traps"],"Instructions":["Begin with a wide grip on the bar, with an overhand or hook grip. The feet should be directly below the hips with the feet turned out. Your knees should be slightly bent, and the torso inclined forward. The spine should be fully extended and the head facing forward. The bar should be at the hips. This will be your starting position.","Aggressively extend through the legs and hips. At peak extension, shrug the shoulders and allow the elbows to flex to the side.","As you move your feet into the receiving position, forcefully pull yourself below the bar as you elevate the bar overhead. Receive the bar with your body as low as possible and the arms fully extended overhead.","Return to a standing position with the weight overhead. Follow by returning the weight to the ground under control."],"Category":"olympic weightlifting"},"18":{"Name":"Hang Snatch - Below Knees","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abdominals","calves","forearms","glutes","lower back","quadriceps","shoulders","traps"],"Instructions":["Begin with a wide grip on the bar, with an overhand or hook grip. The feet should be directly below the hips with the feet turned out. Your knees should be slightly bent, and the torso inclined forward. The spine should be fully extended and the head facing forward. The bar should be just below the knees. This will be your starting position.","Aggressively extend through the legs and hips. At peak extension, shrug the shoulders and allow the elbows to flex to the side.","As you move your feet into the receiving position, forcefully pull yourself below the bar as you elevate the bar overhead. Receive the bar with your body as low as possible and the arms fully extended overhead.","Return to a standing position with the weight overhead, and then return the weight to the floor under control."],"Category":"olympic weightlifting"},"19":{"Name":"Hanging Leg Raise","Force":"pull","Level":"expert","Mechanic":"isolation","Equipment":"body only","PrimaryMuscles":["abdominals"],"SecondaryMuscles":[],"Instructions":["Hang from a chin-up bar with both arms extended at arms length in top of you using either a wide grip or a medium grip. The legs should be straight down with the pelvis rolled slightly backwards. This will be your starting position.","Raise your legs until the torso makes a 90-degree angle with the legs. Exhale as you perform this movement and hold the contraction for a second or so.","Go back slowly to the starting position as you breathe in.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"20":{"Name":"Hanging Pike","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"body only","PrimaryMuscles":["abdominals"],"SecondaryMuscles":[],"Instructions":["Hang from a chin-up bar with your legs and feet together using an overhand grip (palms facing away from you) that is slightly wider than shoulder width. Tip: You may use wrist wraps in order to facilitate holding on to the bar.","Now bend your knees at a 90 degree angle and bring the upper legs forward so that the calves are perpendicular to the floor while the thighs remain parallel to it. This will be your starting position.","Pull your legs up as you exhale until you almost touch your shins with the bar above you. Tip: Try to straighten your legs as much as possible while at the top.","Lower your legs as slowly as possible until you reach the starting position. Tip: Avoid swinging and using momentum at all times.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"21":{"Name":"Kettlebell Pistol Squat","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","shoulders"],"Instructions":["Pick up a kettlebell with two hands and hold it by the horns. Hold one leg off of the floor and squat down on the other.","Squat down by flexing the knee and sitting back with the hips, holding the kettlebell up in front of you.","Hold the bottom position for a second and then reverse the motion, driving through the heel and keeping your head and chest up.","Lower yourself again and repeat."],"Category":"strength"},"22":{"Name":"Kneeling Jump Squat","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["glutes"],"SecondaryMuscles":["calves","hamstrings","quadriceps"],"Instructions":["Begin kneeling on the floor with a barbell racked across the back of your shoulders, or you can use your body weight for this exercise. This can be done inside of a power rack to make unracking easier.","Sit back with your hips until your glutes touch your feet, keeping your head and chest up.","Explode up with your hips, generating enough power to land with your feet flat on the floor.","Continue with the squat by driving through your heels and extending the knees to come to a standing position."],"Category":"olympic weightlifting"},"23":{"Name":"Lying Bent Leg Groin","Force":"static","Level":"expert","Mechanic":null,"Equipment":"other","PrimaryMuscles":["adductors"],"SecondaryMuscles":[],"Instructions":["Lie on your back with your knees bent and the soles of the feet pressed together. Have your partner hold your knees. This will be your starting position.","Attempt to squeeze your knees together, while your partner prevents any movement from occurring.","After 10-20 seconds, relax your muscles as your partner gently pushes your knees towards the floor. Be sure to inform your helper when the stretch is adequate to prevent injury or overstretching."],"Category":"stretching"},"24":{"Name":"Lying Crossover","Force":"static","Level":"expert","Mechanic":null,"Equipment":"body only","PrimaryMuscles":["abductors"],"SecondaryMuscles":[],"Instructions":["Lie on your back with your legs extended.","Cross one leg over your body with the knee bent, attempting to touch the knee to the ground. Your partner should kneel beside you, holding your shoulder down with one hand and controlling the crossed leg with the other. this will be your starting position.","Attempt to raise the bent knee off of the ground as your partner prevents any actual movement.","After 10-20 seconds, relax the leg as your partner gently presses the knee towards the floor. Repeat with the other side."],"Category":"stretching"},"25":{"Name":"Lying Glute","Force":"static","Level":"expert","Mechanic":null,"Equipment":"body only","PrimaryMuscles":["glutes"],"SecondaryMuscles":["abductors"],"Instructions":["Lie on your back with your partner kneeling beside you.","Flex the hip of one leg, raising it off of the floor. Rotate the leg so the foot is over the opposite hip, the lower leg perpendicular to your body. Your partner should hold the knee and ankle in place. This will be your starting position.","Attempt to push your leg towards your partner, who should be preventing any actual movement of the leg.","After 10-20 seconds, completely relax as your partner gently pushes the ankle and knee towards your chest. Be sure to inform your helper when the stretch is adequate to prevent injury or overstretching."],"Category":"stretching"},"26":{"Name":"Lying Hamstring","Force":"static","Level":"expert","Mechanic":null,"Equipment":"other","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves"],"Instructions":["Lie on your back with your legs extended. Your partner should be kneeling beside you. Raise one leg up towards the ceiling and have your partner hold the ankle. Your partner can use their shoulder to brace your leg if necessary. This will be your starting position.","With your partner holding your leg in place, attempt to flex the knee, contracting the hamstrings for 10-20 seconds.","Then relax your leg, allowing your partner to gently push the leg towards your head. Be sure to inform your helper when the stretch is adequate to prevent injury or overstretching. Switch sides once complete."],"Category":"stretching"},"27":{"Name":"Lying Prone Quadriceps","Force":null,"Level":"expert","Mechanic":null,"Equipment":"body only","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":[],"Instructions":["Lay face down on the floor with your partner kneeling beside you. Flex one knee and raise that leg off the ground, attempting to touch your glutes with your foot. Your partner should hold the knee and ankle. This will be your starting position.","Attempt to extend your knee while your partner prevents any actual movement.","After 10-20 seconds, relax your muscles as your partner gently pushes the foot towards your glutes, further stretching the quadriceps and hip flexors.","After 10-20 seconds, switch sides."],"Category":"stretching"},"28":{"Name":"Mixed Grip Chin","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Using a spacing that is just about 1 inch wider than shoulder width, grab a pull-up bar with the palms of one hand facing forward and the palms of the other hand facing towards you. This will be your starting position.","Now start to pull yourself up as you exhale. Tip: With the arm that has the palms facing up concentrate on using the back muscles in order to perform the movement. The elbow of that arm should remain close to the torso. With the other arm that has the palms facing forward, the elbows will be away but in line with the torso. You will concentrate on using the lats to pull your body up.","After a second contraction at the top, start to slowly come down as you inhale.","Repeat for the recommended amount of repetitions.","On the following set, switch grips; so if you had the right hand with the palms facing you and the left one with the palms facing forward, on the next set you will have the palms facing forward for the right hand and facing you for the left."],"Category":"strength"},"29":{"Name":"One-Arm Kettlebell Snatch","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["calves","glutes","hamstrings","lower back","traps","triceps"],"Instructions":["Place a kettlebell between your feet. Bend your knees and push your butt back to get in the proper starting position.","Look straight ahead and swing the kettlebell back between your legs.","Immediately reverse the direction and drive through with your hips and knees, accelerating the kettlebell upward. As the kettlebell rises to your shoulder rotate your hand and punch straight up, using momentum to receive the weight locked out overhead."],"Category":"strength"},"30":{"Name":"One-Arm Kettlebell Split Snatch","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["hamstrings","quadriceps"],"Instructions":["Hold a kettlebell in one hand by the handle.","Squat towards the floor, and then reverse the motion, extending the hips, knees, and finally the ankles, to raise the kettlebell overhead.","After fully extending the body, descend into a lunge position to receive the weights overhead, one leg forward and one leg back. Ensure you drive through with your hips and lock the ketttlebells overhead in one uninterrupted motion.","Return to a standing position, holding the weight overhead, and bring the feet together. Lower the weight to return to the starting position."],"Category":"strength"},"31":{"Name":"One-Arm Overhead Kettlebell Squats","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","shoulders"],"Instructions":["Clean and press a kettlebell with one arm. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulder. Rotate your wrist as you do so. Press the weight overhead by extending through the elbow.This will be your starting position.","Looking straight ahead and keeping a kettlebell locked out above you, flex the knees and hips and lower your torso between your legs, keeping your head and chest up.","Pause at the bottom position for a second before rising back to the top, driving through the heels of your feet."],"Category":"strength"},"32":{"Name":"One-Arm Side Deadlift","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abdominals","calves","glutes","hamstrings","lower back","traps"],"Instructions":["Stand to the side of a barbell next to its center. Bend your knees and lower your body until you are able to reach the barbell.","Grasp the bar as if you were grabbing a briefcase (palms facing you since the bar is sideways). You may need a wrist wrap if you are using a significant amount of weight. This is your starting position.","Use your legs to help lift the barbell up while exhaling. Your arms should extend fully as bring the barbell up until you are in a standing position.","Slowly bring the barbell back down while inhaling. Tip: Make sure to bend your knees while lowering the weight to avoid any injury from occurring.","Repeat for the recommended amount of repetitions.","Switch arms and repeat the movement."],"Category":"strength"},"33":{"Name":"One Arm Chin-Up","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","forearms","lats"],"Instructions":["For this exercise, start out by placing a towel around a chin up bar.","Grab the chin-up bar with your palm facing you. One hand will be grabbing the chin-up bar and the other will be grabbing the towel.","Bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.v","Pull your torso up until the bar touches your upper chest by drawing the shoulders and the upper arms down and back. Exhale as you perform this portion of the movement. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary as it moves through space and only the arms should move. The forearms should do no other work other than hold the bar.","After a second on the contracted position, start to inhale and slowly lower your torso back to the starting position when your arms are fully extended and the lats are fully stretched.","Repeat this motion for the prescribed amount of repetitions.","Switch arms and repeat the movement."],"Category":"strength"},"34":{"Name":"One Leg Barbell Squat","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Start by standing about 2 to 3 feet in front of a flat bench with your back facing the bench. Have a barbell in front of you on the floor. Tip: Your feet should be shoulder width apart from each other.","Bend the knees and use a pronated grip with your hands being wider than shoulder width apart from each other to lift the barbell up until you can rest it on your chest.","Then lift the barbell over your head and rest it on the base of your neck. Move one foot back so that your toe is resting on the flat bench. Your other foot should be stationary in front of you. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. Tip: Make sure your back is straight and chest is out while performing this exercise.","As you inhale, slowly lower your leg until your thigh is parallel to the floor. At this point, your knee should be over your toes. Your chest should be directly above the middle of your thigh.","Leading with the chest and hips and contracting the quadriceps, elevate your leg back to the starting position as you exhale.","Repeat for the recommended amount of repetitions.","Switch legs and repeat the movement."],"Category":"strength"},"35":{"Name":"Open Palm Kettlebell Clean","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["glutes","lower back","quadriceps","shoulders"],"Instructions":["Place one kettlebell between your feet. Clean the kettlebell by extending through the legs and hips as you raise the kettlebell towards your shoulders.","Release the kettlebell as it comes up, and let it flip so that the ball of the kettlebell lands in the palms of your hands.","Release the kettlebell out in front of you and catch the handle with both hands. Lower the kettlebell to the starting position and repeat."],"Category":"strength"},"36":{"Name":"Overhead Lat","Force":"static","Level":"expert","Mechanic":null,"Equipment":"other","PrimaryMuscles":["lats"],"SecondaryMuscles":["triceps"],"Instructions":["Sit upright on the floor with your partner behind you. Raise one arm straight up, and flex the elbow, attempting to touch your hand to your back. Your parner should hold your tricep and wrist. This will be your starting position.","Attempt to pull your upper arm to your side as your partner prevents you from doing actually doing so.","After 10-20 seconds, relax the arm and allow your partner to further stretch the lat by applying gentle pressure to the tricep. Hold for 10-20 seconds, and then switch sides."],"Category":"stretching"},"37":{"Name":"Overhead Squat","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abdominals","calves","glutes","hamstrings","lower back","shoulders","triceps"],"Instructions":["Start out by having a barbell in front of you on the floor. Your feet should be wider than shoulder width apart from each other.","Bend the knees and use a pronated grip (palms facing you) to grab the barbell. Your hands should be at a wider than shoulder width apart from each other before lifting. Once you are positioned, lift the barbell up until you can rest it on your chest.","Move the barbell over and slightly behind your head and make sure your arms are fully extended. Keep your head up at all times and also maintain a straight back. Retract your shoulder blades. This is your starting position.","Slowly lower the weight by bending your knees until your thighs are parallel to the ground while inhaling. Tip: Keep your back straight while performing this exercise to avoid any injuries and your arms should remain extended and over your head at all times.","Now use your feet and legs to help bring the weight back up to the starting position while exhaling.","Repeat for the recommended amount of repetitions."],"Category":"olympic weightlifting"},"38":{"Name":"Overhead Triceps","Force":"static","Level":"expert","Mechanic":null,"Equipment":"body only","PrimaryMuscles":["triceps"],"SecondaryMuscles":["lats"],"Instructions":["Sit upright on the floor with your partner behind you. Raise one arm straight up, and flex the elbow, attempting to touch your hand to your back. Your parner should hold your elbow and wrist. This will be your starting position.","Attempt to extend the arm straight into the air as your partner prevents you from doing actually doing so.","After 10-20 seconds, relax the arm and allow your partner to further stretch the tricep by applying gentle pressure to the wrist. Hold for 10-20 seconds, and then switch sides."],"Category":"stretching"},"39":{"Name":"Plyo Kettlebell Pushups","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Place a kettlebell on the floor. Place yourself in a pushup position, on your toes with one hand on the ground and one hand holding the kettlebell, with your elbows extended. This will be your starting position.","Begin by lowering yourself as low as you can, keeping your back straight.","Quickly and forcefully reverse direction, pushing yourself up to the other side of the kettlebell, switching hands as you do so. Continue the movement by descending and repeating the movement back and forth."],"Category":"strength"},"40":{"Name":"Power Jerk","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abdominals","calves","glutes","hamstrings","shoulders","triceps"],"Instructions":["Standing with the weight racked on the front of the shoulders, begin with the dip. With your feet directly under your hips, flex the knees without moving the hips backward. Go down only slightly, and reverse direction as powerfully as possible.","Drive through the heels create as much speed and force as possible, and be sure to move your head out of the way as the bar leaves the shoulders.","At this moment as the feet leave the floor, the feet must be placed into the receiving position as quickly as possible. In the brief moment the feet are not actively driving against the platform, the athletes effort to push the bar up will drive them down. The feet should be moved to a slightly wider stance, with the knees partially bent.","Receive the bar with the arms locked out overhead.","Return to a standing position."],"Category":"olympic weightlifting"},"41":{"Name":"Power Snatch","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","glutes","lower back","quadriceps","shoulders","traps","triceps"],"Instructions":["Begin with a loaded barbell on the floor. The bar should be close to or touching the shins, and a wide grip should be taken on the bar. The feet should be directly below the hips, with the feet turned out as needed. Lower the hips, with the chest up and the head looking forward. The shoulders should be just in front of the bar. This will be the starting position.","Begin the first pull by driving through the front of the heels, raising the bar from the ground. The back angle should stay the same until the bar passes the knees.","Transition into the second pull by extending through the hips knees and ankles, driving the bar up as quickly as possible. The bar should be close to the body. At peak extension, shrug the shoulders and allow the elbows to flex to the side.","As you move your feet into the receiving position, a slightly wider position, pull yourself below the bar as you elevate the bar overhead. The bar should be received in a partial squat. Continue raising the bar to the overhead position, receiving the bar locked out overhead.","Return to a standing position with the weight over head."],"Category":"olympic weightlifting"},"42":{"Name":"Press Sit-Up","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["chest","shoulders","triceps"],"Instructions":["To begin, lie down on a bench with a barbell resting on your chest. Position your legs so they are secure on the extension of the abdominal bench. This is the starting position.","While inhaling, tighten your abdominals and glutes. Simultaneously curl your torso as you do when performing a sit-up and press the barbell to an overhead position while exhaling. Tip: Use your arms to push the barbell out as you perform this exercise while still focusing on the abdominal muscles.","Lower your upper body back down to the starting position while bringing the barbell back down to your torso. Remember to breathe in while lowering the body.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"43":{"Name":"Push Press","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["quadriceps","triceps"],"Instructions":[],"Category":"olympic weightlifting"},"44":{"Name":"Reverse Band Deadlift","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["lower back"],"SecondaryMuscles":["abductors","adductors","calves","glutes","hamstrings","quadriceps"],"Instructions":["Set the bar up in a power rack. Attach bands to the top of the rack, using either bands pegs or the frame itself. Attach the other end of the bands to the bar.","Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an overhand grip or an over/under grip on heavier sets.","With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward.","After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.","Lower the bar by bending at the hips and guiding it to the floor."],"Category":"powerlifting"},"45":{"Name":"Reverse Band Power Squat","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["adductors","calves","glutes","hamstrings","lower back"],"Instructions":["Begin in a power rack with the pins and bar set at the appropriate height. After loading the bar, attach bands to the top of the rack, using either pegs or the frame itself. Attach the other end of the bands to the bar.","Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wide for more emphasis on the back, glutes, adductors, and hamstrings.","Keep your head facing forward. With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips as much as possible. Ideally, your shins should be perpendicular to the ground. Lower bar position necessitates a greater torso lean to keep the bar over the heels. Continue until you break parallel, which is defined as the crease of the hip being in line with the top of the knee.","Keeping the weight on your heels and pushing your feet and knees out, drive upward as you lead the movement with your head. Continue upward, maintaining tightness head to toe, until you have returned to the starting position."],"Category":"powerlifting"},"46":{"Name":"Reverse Band Sumo Deadlift","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abductors","adductors","calves","forearms","glutes","lower back","quadriceps","traps"],"Instructions":["Begin with a bar loaded on the floor inside of a power rack. Attach bands to the top of the rack, using either pegs or the frame itself. Attach the other end to the barbell.","Approach the bar so that the bar intersects the middle of the feet. The feet should be set very wide, near the collars. Bend at the hips to grip the bar. The arms should be directly below the shoulders, inside the legs, and you can use a pronated grip, a mixed grip, or hook grip. Relax the shoulders, which in effect lengthens your arms.","Take a breath, and then lower your hips, looking forward with your head with your chest up. Drive through the floor, spreading your feet apart, with your weight on the back half of your feet. Extend through the hips and knees.","As the bar passes through the knees, lean back and drive the hips into the bar, pulling your shoulder blades together.","Return the weight to the ground by bending at the hips and controlling the weight on the way down."],"Category":"powerlifting"},"47":{"Name":"Seated Biceps","Force":"static","Level":"expert","Mechanic":"isolation","Equipment":"body only","PrimaryMuscles":["biceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["Sit on the floor with your knees bent and your partner standing behind you. Extend your arms straight behind you with your palms facing each other. Your partner will hold your wrists for you. This will be the starting position.","Attempt to flex your elbows, while your partner prevents any actual movement.","After 10-20 seconds, relax your arms while your partner gently pulls your wrists up to stretch your biceps. Be sure to let your partner know when the stretch is appropriate to prevent injury or overstretching."],"Category":"stretching"},"48":{"Name":"Seated Front Deltoid","Force":"static","Level":"expert","Mechanic":null,"Equipment":"body only","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["chest"],"Instructions":["Sit upright on the floor with your legs bent, your partner standing behind you. Stick your arms straight out to your sides, with your palms facing the ground. Attempt to move them as far behind you as possible, as your assistant holds your wrists. This will be your starting position.","Keeping your elbows straight, attempt to move your arms to the front, with your partner gently restraining you to prevent any actual movement for 10-20 seconds.","Now, relax your muscles and allow your partner to gently increase the stretch on the shoulders and chest. Hold for 10 to 20 seconds."],"Category":"stretching"},"49":{"Name":"Seated Glute","Force":"static","Level":"expert","Mechanic":null,"Equipment":"body only","PrimaryMuscles":["glutes"],"SecondaryMuscles":["adductors"],"Instructions":["In a seated position with your knees bent, cross one ankle over the opposite knee. Your partner will stand behind you. Now, lean forward as your partner braces your shoulders with their hands. This will be your starting position.","Attempt to push your torso back for 10-20 seconds, as your partner prevents any actual movement of your torso.","Now relax your muscles as your partner increases the stretch by gently pushing your torso forward for 10-20 seconds."],"Category":"stretching"},"50":{"Name":"Seated Hamstring","Force":"static","Level":"expert","Mechanic":null,"Equipment":null,"PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves"],"Instructions":["In a seated position with your legs extended, have your partner stand behind you. Now, lean forward as your partner braces your shoulders with their hands. This will be your starting position.","Attempt to push your torso back for 10-20 seconds, as your partner prevents any actual movement of your torso.","Now relax your muscles as your partner increases the stretch by gently pushing your torso forward for 10-20 seconds."],"Category":"stretching"},"51":{"Name":"Snatch from Blocks","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","forearms","glutes","hamstrings","lower back","shoulders","traps","triceps"],"Instructions":["Begin with a loaded barbell on boxes or stands of the desired height. A wide grip should be taken on the bar. The feet should be directly below the hips, with the feet turned out as needed. Lower the hips, with the chest up and the head looking forward. The shoulders should be just in front of the bar, with the elbows pointed out. This will be the starting position.","Begin the first pull by driving through the front of the heels, raising the bar from the boxes.","Transition into the second pull by extending through the hips knees and ankles, driving the bar up as quickly as possible. The bar should be close to the body. At peak extension, shrug the shoulders and allow the elbows to flex to the side.","As you move your feet into the receiving position, forcefully pull yourself below the bar as you elevate the bar overhead. The feet should move to just outside the hips, turned out as necessary. Receive the bar with your body as low as possible and the arms fully extended overhead.","Keeping the bar aligned over the front of the heels, your head and chest up, drive through heels of the feet to move to a standing position. Carefully return the weight to the boxes."],"Category":"olympic weightlifting"},"52":{"Name":"Speed Squats","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","lower back"],"Instructions":["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.","Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.","Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance which targets overall development; however you can choose any of the three stances discussed in the foot stances section).","Begin to lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to raise the bar as fast as possible without involving momentum as you exhale by pushing the floor with the heel of your foot mainly as you straighten the legs again and go back to the starting position. Note: You should perform these exercises as fast as possible but without breaking perfect form and without involving momentum.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"53":{"Name":"Split Snatch","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","forearms","glutes","hamstrings","lower back","quadriceps","shoulders","traps","triceps"],"Instructions":["Begin with a loaded barbell on the floor. The bar should be close to or touching the shins, and a wide grip should be taken on the bar. The feet should be directly below the hips, with the feet turned out as needed. Lower the hips, with the chest up and the head looking forward. The shoulders should be just in front of the bar. This will be the starting position.","Begin the first pull by driving through the front of the heels, raising the bar from the ground. The back angle should stay the same until the bar passes the knees.","Transition into the second pull by extending through the hips knees and ankles, driving the bar up as quickly as possible. The bar should be close to the body. At peak extension, shrug the shoulders and allow the elbows to flex to the side.","As you move your feet into the receiving position, forcefully pull yourself below the bar as you elevate the bar overhead. The feet should move forcefully to a split position, one foot forward one foot back. Receive the bar with your body as low as possible and the arms fully extended overhead.","Keeping the bar aligned over the front of the heels, your head and chest up, drive through heels of the feet to move to a standing position, bringing your feet together.","Carefully return the weight to floor."],"Category":"olympic weightlifting"},"54":{"Name":"Squat Jerk","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","shoulders","triceps"],"Instructions":["Standing with the weight racked on the front of the shoulders, begin with the dip. With your feet directly under your hips, flex the knees without moving the hips backward. Go down only slightly, and reverse direction as powerfully as possible. Drive through the heels create as much speed and force as possible, and be sure to move your head out of the way as the bar leaves the shoulders.","At this moment as the feet leave the floor, the feet must be placed into the receiving position as quickly as possible. In the brief moment the feet are not actively driving against the platform, the athletes effort to push the bar up will drive them down. The feet should move forcefully to just outside the hips, turned out as necessary. Receive the bar with your body in a full squat and the arms fully extended overhead.","Keeping the bar aligned over the front of the heels, your head and chest up, drive throught heels of the feet to move to a standing position. Carefully return the weight to floor."],"Category":"strength"},"55":{"Name":"Weighted Sissy Squat","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Standing upright, with feet at shoulder width and toes raised, use one hand to hold onto the beams of a squat rack and the opposite arm to hold a plate on top of your chest. This is your starting position.","As you use one arm to hold yourself, bend at the knees and slowly lower your torso toward the ground by bringing your pelvis and knees forward. Inhale as you go down and stop when your upper and lower legs almost create a 90-degree angle. Hold the stretch position for a second.","After your one second hold, use your thigh muscles to bring your torso back up to the starting position. Exhale as you move up.","Repeat for the recommended amount of times."],"Category":"strength"},"56":{"Name":"Zercher Squats","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. The correct height should be anywhere above the waist but below the chest. Once the correct height is chosen and the bar is loaded, lock your hands together and place the bar on top of your arms in between the forearm and upper arm.","Lift the bar up so that it is resting on top of your forearms. If you are holding the bar properly, it should look as if you have your arms crossed but with a bar running across them.","Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section).","Begin to lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to raise the bar as you exhale by pushing the floor with the ball of your foot mainly as you straighten the legs again and go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"}}