{"0":{"Name":"Back Flyes - With Bands","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"bands","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["middle back","triceps"],"Instructions":["Run a band around a stationary post like that of a squat rack.","Grab the band by the handles and stand back so that the tension in the band rises.","Extend and lift the arms straight in front of you. Tip: Your arms should be straight and parallel to the floor while perpendicular to your torso. Your feet should be firmly planted on the floor spread at shoulder width. This will be your starting position.","As you exhale, move your arms to the sides and back. Keep your arms extended and parallel to the floor. Continue the movement until the arms are extended to your sides.","After a pause, go back to the original position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"1":{"Name":"Band Good Morning","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"bands","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["glutes","lower back"],"Instructions":["Using a 41 inch band, stand on one end, spreading your feet a small amount. Bend at the hips to loop the end of the band behind your neck. This will be your starting position.","Keeping your legs straight, extend through the hips to come to a near vertical position.","Ensure that you do not round your back as you go down back to the starting position."],"Category":"powerlifting"},"2":{"Name":"Band Good Morning (Pull Through)","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"bands","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["glutes","lower back"],"Instructions":["Loop the band around a post. Standing a little ways away, loop the opposite end around the neck. Your hands can help hold the band in position.","Begin by bending at the hips, getting your butt back as far as possible. Keep your back flat and bend forward to about 90 degrees. Your knees should be only slightly bent.","Return to the starting position be driving through with the hips to come back to a standing position."],"Category":"powerlifting"},"3":{"Name":"Band Hip Adductions","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"bands","PrimaryMuscles":["adductors"],"SecondaryMuscles":[],"Instructions":["Anchor a band around a solid post or other object.","Stand with your left side to the post, and put your right foot through the band, getting it around the ankle.","Stand up straight and hold onto the post if needed. This will be your starting position.","Keeping the knee straight, raise your right legs out to the side as far as you can.","Return to the starting position and repeat for the desired rep count.","Switch sides."],"Category":"strength"},"4":{"Name":"Band Pull Apart","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"bands","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["middle back","traps"],"Instructions":["Begin with your arms extended straight out in front of you, holding the band with both hands.","Initiate the movement by performing a reverse fly motion, moving your hands out laterally to your sides.","Keep your elbows extended as you perform the movement, bringing the band to your chest. Ensure that you keep your shoulders back during the exercise.","Pause as you complete the movement, returning to the starting position under control."],"Category":"strength"},"5":{"Name":"Band Skull Crusher","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"bands","PrimaryMuscles":["triceps"],"SecondaryMuscles":[],"Instructions":["Secure a band to the base of a rack or the bench. Lay on the bench so that the band is lined up with your head.","Take hold of the band, raising your elbows so that the upper arm is perpendicular to the floor. With the elbow flexed, the band should be above your head. This will be your starting position.","Extend through the elbow to straighten your arm, keeping your upper arm in place. Pause at the top of the motion, and return to the starting position."],"Category":"strength"},"6":{"Name":"Bench Press - With Bands","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"bands","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Using a flat bench secure a band under the leg of the bench that is nearest to your head.","Once the band is secure, grab it by both handles and lie down on the bench.","Extend your arms so that you are holding the band handles in front of you at shoulder width.","Once at shoulder width, rotate your wrists forward so that the palms of your hands are facing away from you. This will be your starting position.","Bring down the handles slowly until your elbow forms a 90 degree angle. Keep full control at all times.","As you breathe out, bring the handles up using your pectoral muscles. Lock your arms in the contracted position, squeeze your chest, hold for a second and then start coming down slowly. Tip: It should take at least twice as long to go down than to come up.","Repeat the movement for the prescribed amount of repetitions of your training program."],"Category":"strength"},"7":{"Name":"Calf Raises - With Bands","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"bands","PrimaryMuscles":["calves"],"SecondaryMuscles":[],"Instructions":["Grab an exercise band and stand on it with your toes making sure that the length of the band between the foot and the arms is the same for both sides.","While holding the handles of the band, raise the arms to the side of your head as if you were getting ready to perform a shoulder press. The palms should be facing forward with the elbows bent and to the sides. This movement will create tension on the band. This will be your starting position.","Keeping the hands by your shoulder, stand up on your toes as you exhale and contract the calves hard at the top of the movement.","After a one second contraction, slowly go back down to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"8":{"Name":"Cross Over - With Bands","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"bands","PrimaryMuscles":["chest"],"SecondaryMuscles":["biceps","shoulders"],"Instructions":["Secure an exercise band around a stationary post.","While facing away from the post, grab the handles on both ends of the band and step forward enough to create tension on the band.","Raise your arms to the sides, parallel to the floor, perpendicular to your torso (your torso and the arms should resemble the letter \"T\") and with the palms facing forward. Have them extended with a slight bend at the elbows. This will be your starting position.","While keeping your arms straight, bring them across your chest in a semicircular motion to the front as you exhale and flex your pecs. Hold the contraction for a second.","Slowly return to the starting position as you inhale.","Perform for the recommended amount of repetitions."],"Category":"strength"},"9":{"Name":"External Rotation with Band","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"bands","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["Choke the band around a post. The band should be at the same height as your elbow. Stand with your left side to the band a couple of feet away.","Grasp the end of the band with your right hand, and keep your elbow pressed firmly to your side. We recommend you hold a pad or foam roll in place with your elbow to keep it firmly in position.","With your upper arm in position, your elbow should be flexed to 90 degrees with your hand reaching across the front of your torso. This will be your starting position.","Execute the movement by rotating your arm in a backhand motion, keeping your elbow in place.","Continue as far as you are able, pause, and then return to the starting position."],"Category":"strength"},"10":{"Name":"Hip Extension with Bands","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"bands","PrimaryMuscles":["glutes"],"SecondaryMuscles":["hamstrings"],"Instructions":["Secure one end of the band to the lower portion of a post and attach the other to one ankle.","Facing the attachment point of the band, hold on to the column to stabilize yourself.","Keeping your head and your chest up, move the resisted leg back as far as you can while keeping the knee straight.","Return the leg to the starting position."],"Category":"strength"},"11":{"Name":"Hip Flexion with Band","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"bands","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":[],"Instructions":["Secure one end of the band to the lower portion of a post and attach the other to one ankle.","Face away from the attachment point of the band.","Keeping your head and your chest up, raise your knee up to 90 degrees and pause.","Return the leg to the starting position."],"Category":"strength"},"12":{"Name":"Hip Lift with Band","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"bands","PrimaryMuscles":["glutes"],"SecondaryMuscles":["calves","hamstrings"],"Instructions":["After choosing a suitable band, lay down in the middle of the rack, after securing the band on either side of you. If your rack doesn't have pegs, the band can be secured using heavy dumbbells or similar objects, just ensure they won't move.","Adjust your position so that the band is directly over your hips. Bend your knees and place your feet flat on the floor. Your hands can be on the floor or holding the band in position.","Keeping your shoulders on the ground, drive through your heels to raise your hips, pushing into the band as high as you can.","Pause at the top of the motion, and return to the starting position."],"Category":"powerlifting"},"13":{"Name":"Internal Rotation with Band","Force":null,"Level":"beginner","Mechanic":"isolation","Equipment":"bands","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["Choke the band around a post. The band should be at the same height as your elbow. Stand with your right side to the band a couple of feet away.","Grasp the end of the band with your right hand, and keep your elbow pressed firmly to your side. We recommend you hold a pad or foam roll in place with your elbow to keep it firmly in position.","With your upper arm in position, your elbow should be flexed to 90 degrees with your hand reaching away from your torso. This will be your starting position.","Execute the movement by rotating your arm in a forehand motion, keeping your elbow in place.","Continue as far as you are able, pause, and then return to the starting position."],"Category":"strength"},"14":{"Name":"Lateral Raise - With Bands","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"bands","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["To begin, stand on an exercise band so that tension begins at arm's length. Grasp the handles using a pronated (palms facing your thighs) grip that is slightly less than shoulder width. The handles should be resting on the sides of your thighs. Your arms should be extended with a slight bend at the elbows and your back should be straight. This will be your starting position.","Use your side shoulders to lift the handles to the sides as you exhale. Continue to lift the handles until they are slightly above parallel. Tip: As you lift the handles, slightly tilt the hand as if you were pouring water and keep your arms extended. Also, keep your torso stationary and pause for a second at the top of the movement.","Lower the handles back down slowly to the starting position. Inhale as you perform this portion of the movement.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"15":{"Name":"Monster Walk","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"bands","PrimaryMuscles":["abductors"],"SecondaryMuscles":[],"Instructions":["Place a band around both ankles and another around both knees. There should be enough tension that they are tight when your feet are shoulder width apart.","To begin, take short steps forward alternating your left and right foot.","After several steps, do just the opposite and walk backward to where you started."],"Category":"strength"},"16":{"Name":"Shoulder Press - With Bands","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"bands","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["To begin, stand on an exercise band so that tension begins at arm's length. Grasp the handles and lift them so that the hands are at shoulder height at each side.","Rotate the wrists so that the palms of your hands are facing forward. Your elbows should be bent, with the upper arms and forearms in line to the torso. This is your starting position.","As you exhale, lift the handles up until your arms are fully extended overhead."],"Category":"strength"},"17":{"Name":"Speed Band Overhead Triceps","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"bands","PrimaryMuscles":["triceps"],"SecondaryMuscles":[],"Instructions":["For this exercise anchor a band to the ground. We used an incline bench and anchored the band to the base, standing over the bench. Alternatively, this could be performed standing on the band.","To begin, pull the band behind your head, holding it with a pronated grip and your elbows up. This will be your starting position.","To perform the movement, extend through the elbow to to straighten your arms, ensuring that you keep your upper arm in place.","Pause, and then return to the starting position."],"Category":"strength"},"18":{"Name":"Squats - With Bands","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"bands","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","lower back"],"Instructions":["To start out, make sure that the exercise band is at an even split between both the left and right side of the body. To do this, use your hands to grab both sides of the band and place both feet in the middle of the band. Your feet should be shoulder width apart from each other.","When holding the bands, they should be the same height on each side. You should be using a pronated grip (palms facing forward) and have the handles of the bands next to your face for this exercise. This is the starting position.","Slowly start to bend the knees and lower the legs so that your thighs are parallel to the floor while exhaling.","Use the heel of your feet to push your body up to the starting position as you exhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"19":{"Name":"Upright Row - With Bands","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"bands","PrimaryMuscles":["traps"],"SecondaryMuscles":["shoulders"],"Instructions":["To begin, stand on an exercise band so that tension begins at arm's length. Grasp the handles using a pronated (palms facing your thighs) grip that is slightly less than shoulder width. The handles should be resting on top of your thighs. Your arms should be extended with a slight bend at the elbows and your back should be straight. This will be your starting position.","Use your side shoulders to lift the handles as you exhale. The handles should be close to the body as you move them up. Continue to lift the handles until they nearly touches your chin. Tip: Your elbows should drive the motion. As you lift the handles, your elbows should always be higher than your forearms. Also, keep your torso stationary and pause for a second at the top of the movement.","Lower the handles back down slowly to the starting position. Inhale as you perform this portion of the movement.","Repeat for the recommended amount of repetitions."],"Category":"strength"}}