{"0":{"Name":"Anti-Gravity Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["middle back","traps","triceps"],"Instructions":["Place a bar on the ground behind the head of an incline bench.","Lay on the bench face down. With a pronated grip, pick the barbell up from the floor. Flex the elbows, performing a reverse curl to bring the bar near your chest. This will be your starting position.","To begin, press the barbell out in front of your head by extending your elbows. Keep your arms parallel to the ground throughout the movement.","Return to the starting position and repeat to complete the set."],"Category":"strength"},"1":{"Name":"Barbell Ab Rollout","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["lower back","shoulders"],"Instructions":["For this exercise you will need to get into a pushup position, but instead of having your hands of the floor, you will be grabbing on to an Olympic barbell (loaded with 5-10 lbs on each side) instead. This will be your starting position.","While keeping a slight arch on your back, lift your hips and roll the barbell towards your feet as you exhale. Tip: As you perform the movement, your glutes should be coming up, you should be keeping the abs tight and should maintain your back posture at all times. Also your arms should be staying perpendicular to the floor throughout the movement. If you don't, you will work out your shoulders and back more than the abs.","After a second contraction at the top, start to roll the barbell back forward to the starting position slowly as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"2":{"Name":"Barbell Ab Rollout - On Knees","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["lower back","shoulders"],"Instructions":["Hold an Olympic barbell loaded with 5-10lbs on each side and kneel on the floor.","Now place the barbell on the floor in front of you so that you are on all your hands and knees (as in a kneeling push up position). This will be your starting position.","Slowly roll the barbell straight forward, stretching your body into a straight position. Tip: Go down as far as you can without touching the floor with your body. Breathe in during this portion of the movement.","After a second pause at the stretched position, start pulling yourself back to the starting position as you breathe out. Tip: Go slowly and keep your abs tight at all times."],"Category":"strength"},"3":{"Name":"Barbell Bench Press - Medium Grip","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Lie back on a flat bench. Using a medium width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over you with your arms locked. This will be your starting position.","From the starting position, breathe in and begin coming down slowly until the bar touches your middle chest.","After a brief pause, push the bar back to the starting position as you breathe out. Focus on pushing the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position at the top of the motion, hold for a second and then start coming down slowly again. Tip: Ideally, lowering the weight should take about twice as long as raising it.","Repeat the movement for the prescribed amount of repetitions.","When you are done, place the bar back in the rack."],"Category":"strength"},"4":{"Name":"Barbell Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":["forearms"],"Instructions":["Stand up with your torso upright while holding a barbell at a shoulder-width grip. The palm of your hands should be facing forward and the elbows should be close to the torso. This will be your starting position.","While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Tip: Only the forearms should move.","Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second and squeeze the biceps hard.","Slowly begin to bring the bar back to starting position as your breathe in.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"5":{"Name":"Barbell Curls Lying Against An Incline","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Lie against an incline bench, with your arms holding a barbell and hanging down in a horizontal line. This will be your starting position.","While keeping the upper arms stationary, curl the weight up as high as you can while squeezing the biceps. Breathe out as you perform this portion of the movement. Tip: Only the forearms should move. Do not swing the arms.","After a second contraction, slowly go back to the starting position as you inhale. Tip: Make sure that you go all of the way down.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"6":{"Name":"Barbell Deadlift","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["lower back"],"SecondaryMuscles":["calves","forearms","glutes","hamstrings","lats","middle back","quadriceps","traps"],"Instructions":["Stand in front of a loaded barbell.","While keeping the back as straight as possible, bend your knees, bend forward and grasp the bar using a medium (shoulder width) overhand grip. This will be the starting position of the exercise. Tip: If it is difficult to hold on to the bar with this grip, alternate your grip or use wrist straps.","While holding the bar, start the lift by pushing with your legs while simultaneously getting your torso to the upright position as you breathe out. In the upright position, stick your chest out and contract the back by bringing the shoulder blades back. Think of how the soldiers in the military look when they are in standing in attention.","Go back to the starting position by bending at the knees while simultaneously leaning the torso forward at the waist while keeping the back straight. When the weights on the bar touch the floor you are back at the starting position and ready to perform another repetition.","Perform the amount of repetitions prescribed in the program."],"Category":"strength"},"7":{"Name":"Barbell Full Squat","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","lower back"],"Instructions":["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack just above shoulder level. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.","Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.","Step away from the rack and position your legs using a shoulder-width medium stance with the toes slightly pointed out. Keep your head up at all times and maintain a straight back. This will be your starting position.","Begin to slowly lower the bar by bending the knees and sitting back with your hips as you maintain a straight posture with the head up. Continue down until your hamstrings are on your calves. Inhale as you perform this portion of the movement.","Begin to raise the bar as you exhale by pushing the floor with the heel or middle of your foot as you straighten the legs and extend the hips to go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"8":{"Name":"Barbell Glute Bridge","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["glutes"],"SecondaryMuscles":["calves","hamstrings"],"Instructions":["Begin seated on the ground with a loaded barbell over your legs. Using a fat bar or having a pad on the bar can greatly reduce the discomfort caused by this exercise. Roll the bar so that it is directly above your hips, and lay down flat on the floor.","Begin the movement by driving through with your heels, extending your hips vertically through the bar. Your weight should be supported by your upper back and the heels of your feet.","Extend as far as possible, then reverse the motion to return to the starting position."],"Category":"powerlifting"},"9":{"Name":"Barbell Guillotine Bench Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Using a medium width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over your neck with your arms locked. This will be your starting position.","As you breathe in, bring the bar down slowly until it is about 1 inch from your neck.","After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position, hold for a second and then start coming down slowly again. It should take at least twice as long to go down than to come up.","Repeat the movement for the prescribed amount of repetitions.","When you are done, place the bar back in the rack."],"Category":"strength"},"10":{"Name":"Barbell Hack Squat","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","forearms","hamstrings"],"Instructions":["Stand up straight while holding a barbell behind you at arms length and your feet at shoulder width. Tip: A shoulder width grip is best with the palms of your hands facing back. You can use wrist wraps for this exercise for a better grip. This will be your starting position.","While keeping your head and eyes up and back straight, squat until your upper thighs are parallel to the floor. Breathe in as you slowly go down.","Pressing mainly with the heel of the foot and squeezing the thighs, go back up as you breathe out.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"11":{"Name":"Barbell Hip Thrust","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["glutes"],"SecondaryMuscles":["calves","hamstrings"],"Instructions":["Begin seated on the ground with a bench directly behind you. Have a loaded barbell over your legs. Using a fat bar or having a pad on the bar can greatly reduce the discomfort caused by this exercise.","Roll the bar so that it is directly above your hips, and lean back against the bench so that your shoulder blades are near the top of it.","Begin the movement by driving through your feet, extending your hips vertically through the bar. Your weight should be supported by your shoulder blades and your feet. Extend as far as possible, then reverse the motion to return to the starting position."],"Category":"powerlifting"},"12":{"Name":"Barbell Incline Bench Press - Medium Grip","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Lie back on an incline bench. Using a medium-width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over you with your arms locked. This will be your starting position.","As you breathe in, come down slowly until you feel the bar on you upper chest.","After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms in the contracted position, squeeze your chest, hold for a second and then start coming down slowly again. Tip: it should take at least twice as long to go down than to come up.","Repeat the movement for the prescribed amount of repetitions.","When you are done, place the bar back in the rack."],"Category":"strength"},"13":{"Name":"Barbell Incline Shoulder Raise","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["chest"],"Instructions":["Lie back on an Incline Bench. Using a medium width grip (a grip that is slightly wider than shoulder width), lift the bar from the rack and hold it straight over you with your arms straight. This will be your starting position.","While keeping the arms straight, lift the bar by protracting your shoulder blades, raising the shoulders from the bench as you breathe out.","Bring back the bar to the starting position as you breathe in.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"14":{"Name":"Barbell Lunge","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack just below shoulder level. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.","Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.","Step away from the rack and step forward with your right leg and squat down through your hips, while keeping the torso upright and maintaining balance. Inhale as you go down. Note: Do not allow your knee to go forward beyond your toes as you come down, as this will put undue stress on the knee joint. li>","Using mainly the heel of your foot, push up and go back to the starting position as you exhale.","Repeat the movement for the recommended amount of repetitions and then perform with the left leg."],"Category":"strength"},"15":{"Name":"Barbell Rear Delt Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["biceps","lats","middle back"],"Instructions":["Stand up straight while holding a barbell using a wide (higher than shoulder width) and overhand (palms facing your body) grip.","Bend knees slightly and bend over as you keep the natural arch of your back. Let the arms hang in front of you as they hold the bar. Once your torso is parallel to the floor, flare the elbows out and away from your body. Tip: Your torso and your arms should resemble the letter \"T\". Now you are ready to begin the exercise.","While keeping the upper arms perpendicular to the torso, pull the barbell up towards your upper chest as you squeeze the rear delts and you breathe out. Tip: When performed correctly, this exercise should resemble a bench press in reverse. Also, refrain from using your biceps to do the work. Focus on targeting the rear delts; the arms should only act as hooks.","Slowly go back to the initial position as you breathe in.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"16":{"Name":"Barbell Rollout from Bench","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["glutes","hamstrings","lats","shoulders"],"Instructions":["Place a loaded barbell on the ground, near the end of a bench. Kneel with both legs on the bench, and take a medium to narrow grip on the barbell. This will be your starting position.","To begin, extend through the hips to slowly roll the bar forward. As you roll out, flex the shoulder to roll the bar above your head. Ensure that your arms remain extended throughout the movement.","When the bar has been moved as far forward as possible, return to the starting position."],"Category":"strength"},"17":{"Name":"Barbell Seated Calf Raise","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["calves"],"SecondaryMuscles":[],"Instructions":["Place a block about 12 inches in front of a flat bench.","Sit on the bench and place the ball of your feet on the block.","Have someone place a barbell over your upper thighs about 3 inches above your knees and hold it there. This will be your starting position.","Raise up on your toes as high as possible as you squeeze the calves and as you breathe out.","After a second contraction, slowly go back to the starting position. Tip: To get maximum benefit stretch your calves as far as you can.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"18":{"Name":"Barbell Shoulder Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["chest","triceps"],"Instructions":["Sit on a bench with back support in a squat rack. Position a barbell at a height that is just above your head. Grab the barbell with a pronated grip (palms facing forward).","Once you pick up the barbell with the correct grip width, lift the bar up over your head by locking your arms. Hold at about shoulder level and slightly in front of your head. This is your starting position.","Lower the bar down to the shoulders slowly as you inhale.","Lift the bar back up to the starting position as you exhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"19":{"Name":"Barbell Shrug","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["traps"],"SecondaryMuscles":[],"Instructions":["Stand up straight with your feet at shoulder width as you hold a barbell with both hands in front of you using a pronated grip (palms facing the thighs). Tip: Your hands should be a little wider than shoulder width apart. You can use wrist wraps for this exercise for a better grip. This will be your starting position.","Raise your shoulders up as far as you can go as you breathe out and hold the contraction for a second. Tip: Refrain from trying to lift the barbell by using your biceps.","Slowly return to the starting position as you breathe in.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"20":{"Name":"Barbell Shrug Behind The Back","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["traps"],"SecondaryMuscles":["forearms","middle back"],"Instructions":["Stand up straight with your feet at shoulder width as you hold a barbell with both hands behind your back using a pronated grip (palms facing back). Tip: Your hands should be a little wider than shoulder width apart. You can use wrist wraps for this exercise for better grip. This will be your starting position.","Raise your shoulders up as far as you can go as you breathe out and hold the contraction for a second. Tip: Refrain from trying to lift the barbell by using your biceps. The arms should remain stretched out at all times.","Slowly return to the starting position as you breathe in.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"21":{"Name":"Barbell Side Bend","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["lower back"],"Instructions":["Stand up straight while holding a barbell placed on the back of your shoulders (slightly below the neck). Your feet should be shoulder width apart. This will be your starting position.","While keeping your back straight and your head up, bend only at the waist to the right as far as possible. Breathe in as you bend to the side. Then hold for a second and come back up to the starting position as you exhale. Tip: Keep the rest of the body stationary.","Now repeat the movement but bending to the left instead. Hold for a second and come back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"22":{"Name":"Barbell Side Split Squat","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","hamstrings","lower back"],"Instructions":["Stand up straight while holding a barbell placed on the back of your shoulders (slightly below the neck). Your feet should be placed wide apart with the foot of the lead leg angled out to the side. This will be your starting position.","Lower your body towards the side of your angled foot by bending the knee and hip of your lead leg and while keeping the opposite leg only slightly bent. Breathe in as you lower your body.","Return to the starting position by extending the hip and knee of the lead leg. Breathe out as you perform this movement.","After performing the recommended amount of reps, repeat the movement with the opposite leg."],"Category":"strength"},"23":{"Name":"Barbell Squat","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","lower back"],"Instructions":["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack to just below shoulder level. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.","Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.","Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section).","Begin to slowly lower the bar by bending the knees and hips as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees. Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to raise the bar as you exhale by pushing the floor with the heel of your foot as you straighten the legs again and go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"24":{"Name":"Barbell Squat To A Bench","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","lower back"],"Instructions":["This exercise is best performed inside a squat rack for safety purposes. To begin, first place a flat bench or a box behind you. The flat bench is used to teach you to set your hips back and to hit depth.","","Then, set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.","Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.","Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section).","Begin to slowly lower the bar by bending the knees and sitting your hips back as you maintain a straight posture with the head up. Continue down until you slightly touch the bench behind you. Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to raise the bar as you exhale by pushing the floor with the heel of your foot as you straighten the legs and extend the hips to go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"25":{"Name":"Barbell Step Ups","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","quadriceps"],"Instructions":["Stand up straight while holding a barbell placed on the back of your shoulders (slightly below the neck) and stand upright behind an elevated platform (such as the one used for spotting behind a flat bench). This is your starting position.","Place the right foot on the elevated platform. Step on the platform by extending the hip and the knee of your right leg. Use the heel mainly to lift the rest of your body up and place the foot of the left leg on the platform as well. Breathe out as you execute the force required to come up.","Step down with the left leg by flexing the hip and knee of the right leg as you inhale. Return to the original standing position by placing the right foot of to next to the left foot on the initial position.","Repeat with the right leg for the recommended amount of repetitions and then perform with the left leg."],"Category":"strength"},"26":{"Name":"Barbell Walking Lunge","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Begin standing with your feet shoulder width apart and a barbell across your upper back.","Step forward with one leg, flexing the knees to drop your hips. Descend until your rear knee nearly touches the ground. Your posture should remain upright, and your front knee should stay above the front foot.","Drive through the heel of your lead foot and extend both knees to raise yourself back up.","Step forward with your rear foot, repeating the lunge on the opposite leg."],"Category":"strength"},"27":{"Name":"Bench Press - Powerlifting","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","forearms","lats","shoulders"],"Instructions":["Begin by lying on the bench, getting your head beyond the bar if possible. Tuck your feet underneath you and arch your back. Using the bar to help support your weight, lift your shoulder off the bench and retract them, squeezing the shoulder blades together. Use your feet to drive your traps into the bench. Maintain this tight body position throughout the movement.","However wide your grip, it should cover the ring on the bar. Pull the bar out of the rack without protracting your shoulders. Focus on squeezing the bar and trying to pull it apart.","Lower the bar to your lower chest or upper stomach. The bar, wrist, and elbow should stay in line at all times.","Pause when the barbell touches your torso, and then drive the bar up with as much force as possible. The elbows should be tucked in until lockout."],"Category":"powerlifting"},"28":{"Name":"Bench Press with Chains","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","lats","shoulders"],"Instructions":["Adjust the leader chain, shortening it to the desired length.Place the chains on the sleeves of the bar.","Lying on the bench, get your head beyond the bar if possible. Tuck your feet underneath you and arch your back. Using the bar to help support your weight, lift your shoulder off the bench and retract them, squeezing the shoulder blades together. Use your feet to drive your traps into the bench. Maintain this tight body position throughout the movement. However wide your grip, it should cover the ring on the bar.","Pull the bar out of the rack without protracting your shoulders. Focus on squeezing the bar and trying to pull it apart. Lower the bar to your lower chest or upper stomach. The bar, wrist, and elbow should stay in line at all times.","Pause when the barbell touches your torso, and then drive the bar up with as much force as possible. The elbows should be tucked in until lockout."],"Category":"powerlifting"},"29":{"Name":"Bent-Arm Barbell Pullover","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["lats"],"SecondaryMuscles":["chest","lats","shoulders","triceps"],"Instructions":["Lie on a flat bench with a barbell using a shoulder grip width.","Hold the bar straight over your chest with a bend in your arms. This will be your starting position.","While keeping your arms in the bent arm position, lower the weight slowly in an arc behind your head while breathing in until you feel a stretch on the chest.","At that point, bring the barbell back to the starting position using the arc through which the weight was lowered and exhale as you perform this movement.","Hold the weight on the initial position for a second and repeat the motion for the prescribed number of repetitions."],"Category":"strength"},"30":{"Name":"Bent Over Barbell Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats","shoulders"],"Instructions":["Holding a barbell with a pronated grip (palms facing down), bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The barbell should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.","Now, while keeping the torso stationary, breathe out and lift the barbell to you. Keep the elbows close to the body and only use the forearms to hold the weight. At the top contracted position, squeeze the back muscles and hold for a brief pause.","Then inhale and slowly lower the barbell back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"31":{"Name":"Bent Over One-Arm Long Bar Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats","lower back","traps"],"Instructions":["Put weight on one of the ends of an Olympic barbell. Make sure that you either place the other end of the barbell in the corner of two walls; or put a heavy object on the ground so the barbell cannot slide backward.","Bend forward until your torso is as close to parallel with the floor as you can and keep your knees slightly bent.","Now grab the bar with one arm just behind the plates on the side where the weight was placed and put your other hand on your knee. This will be your starting position.","Pull the bar straight up with your elbow in (to maximize back stimulation) until the plates touch your lower chest. Squeeze the back muscles as you lift the weight up and hold for a second at the top of the movement. Breathe out as you lift the weight. Tip: Do not allow for any swinging of the torso. Only the arm should move.","Slowly lower the bar to the starting position getting a nice stretch on the lats. Tip: Do not let the plates touch the floor. To ensure the best range of motion, I recommend using small plates (25-lb ones) as opposed to larger plates (like 35-45lb ones).","Repeat for the recommended amount of repetitions and switch arms."],"Category":"strength"},"32":{"Name":"Bent Over Two-Arm Long Bar Row","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Put weight on one of the ends of an Olympic barbell. Make sure that you either place the other end of the barbell in the corner of two walls; or put a heavy object on the ground so the barbell cannot slide backward.","Bend forward until your torso is as close to parallel with the floor as you can and keep your knees slightly bent.","Now grab the bar with both arms just behind the plates on the side where the weight was placed and put your other hand on your knee. This will be your starting position.","Pull the bar straight up with your elbows in (to maximize back stimulation) until the plates touch your lower chest. Squeeze the back muscles as you lift the weight up and hold for a second at the top of the movement. Breathe out as you lift the weight. Tip: Use a stirrup or double handle cable attachment by hooking it under the end of the bar.","Slowly lower the bar to the starting position getting a nice stretch on the lats. Tip: Do not let the plates touch the floor. To ensure the best range of motion, I recommend using small plates (25-lb ones) as opposed to larger plates (like 35-45lb ones).","Repeat for the recommended amount of repetitions."],"Category":"strength"},"33":{"Name":"Board Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","forearms","lats","shoulders"],"Instructions":["Begin by lying on the bench, getting your head beyond the bar if possible. One to five boards, made out of 2x6's, can be screwed together and held in place by a training partner, bands, or just tucked under your shirt.","Tuck your feet underneath you and arch your back. Using the bar to help support your weight, lift your shoulder off the bench and retract them, squeezing the shoulder blades together. Use your feet to drive your traps into the bench. Maintain this tight body position throughout the movement.","You can take a standard bench grip, or shoulder width to focus on the triceps. Pull the bar out of the rack without protracting your shoulders. The bar, wrist, and elbow should stay in line at all times. Focus on squeezing the bar and trying to pull it apart.","Lower the bar to the boards, and then drive the bar up with as much force as possible. The elbows should be tucked in until lockout."],"Category":"powerlifting"},"34":{"Name":"Box Squat","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["adductors","calves","glutes","hamstrings","lower back"],"Instructions":["The box squat allows you to squat to desired depth and develop explosive strength in the squat movement. Begin in a power rack with a box at the appropriate height behind you. Typically, you would aim for a box height that brings you to a parallel squat, but you can train higher or lower if desired.","Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward.","With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box.","Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe."],"Category":"powerlifting"},"35":{"Name":"Box Squat with Bands","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","glutes","hamstrings","lower back"],"Instructions":["Begin in a power rack with a box at the appropriate height behind you. Set up the bands on the sleeves, secured to either band pegs, the rack, or dumbbells so that there is appropriate tension. If dumbbells are used, secure them so that they don't move. Also, ensure that the dumbbells you are using are heavy enough for the bands that you are using. Additional plates can be used to hold the dumbbells down. If more tension is needed, you can either widen the base on the floor or choke the bands. Typically, you would aim for a box height that brings you to a parallel squat, but you can train higher or lower if desired.","Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward.","With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box.","Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe. Use care to return the barbell to the rack."],"Category":"powerlifting"},"36":{"Name":"Box Squat with Chains","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","glutes","hamstrings","lower back"],"Instructions":["Begin in a power rack with a box at the appropriate height behind you. Typically, you would aim for a box height that brings you to a parallel squat, but you can train higher or lower if desired.","To set up the chains, begin by looping the leader chain over the sleeves of the bar. The heavy chain should be attached using a snap hook. Adjust the length of the lead chain so that a few links are still on the floor at the top of the movement.","Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward.","With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box.","Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe."],"Category":"strength"},"37":{"Name":"Bradford/Rocky Presses","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Sit on a Military Press Bench with a bar at shoulder level with a pronated grip (palms facing forward). Tip: Your grip should be wider than shoulder width and it should create a 90-degree angle between the forearm and the upper arm as the barbell goes down. This is your starting position.","Once you pick up the barbell with the correct grip, lift the bar up over your head by locking your arms.","Now lower the bar down to the back of the head slowly as you inhale.","Lift the bar back up to the starting position as you exhale.","Lower the bar down to the starting position slowly as you inhale. This is one repetition.","Alternate in this manner until you complete the recommended amount of repetitions."],"Category":"strength"},"38":{"Name":"Car Drivers","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["forearms"],"Instructions":["While standing upright, hold a barbell plate in both hands at the 3 and 9 o'clock positions. Your palms should be facing each other and your arms should be extended straight out in front of you. This will be your starting position.","Initiate the movement by rotating the plate as far to one side as possible. Use the same type of movement you would use to turn a steering wheel to one side.","Reverse the motion, turning it all the way to the opposite side.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"39":{"Name":"Clean","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","forearms","glutes","lower back","quadriceps","shoulders","traps"],"Instructions":["With a barbell on the floor close to the shins, take an overhand (or hook) grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position.","","Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight. Move the weight with control as you continue to above the knees.","Next comes the second pull, the main source of acceleration for the clean. As the bar approaches the mid-thigh position, begin extending through the hips. In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward. There should be no need to actively pull through the arms to accelerate the weight; at the end of the second pull, the body should be fully extended, leaning slightly back, with the arms still extended.","As full extension is achieved, transition into the third pull by aggressively shrugging and flexing the arms with the elbows up and out. At peak extension, aggressively pull yourself down, rotating your elbows under the bar as you do so. Receive the bar in a front squat position, the depth of which is dependent upon the height of the bar at the end of the third pull. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Continue to descend to the bottom squat position, which will help in the recovery.","Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position."],"Category":"olympic weightlifting"},"40":{"Name":"Clean Deadlift","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["forearms","glutes","lower back","middle back","quadriceps","traps"],"Instructions":["Begin standing with a barbell close to your shins. Your feet should be directly under your hips with your feet turned out slightly. Grip the bar with a double overhand grip or hook grip, about shoulder width apart. Squat down to the bar. Your spine should be in full extension, with a back angle that places your shoulders in front of the bar and your back as vertical as possible.","Begin by driving through the floor through the front of your heels. As the bar travels upward, maintain a constant back angle. Flare your knees out to the side to help keep them out of the bar's path.","After the bar crosses the knees, complete the lift by driving the hips into the bar until your hips and knees are extended."],"Category":"olympic weightlifting"},"41":{"Name":"Clean Pull","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["forearms","glutes","hamstrings","lower back","traps"],"Instructions":["With a barbell on the floor close to the shins, take an overhand or hook grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position.","Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight and elbows out. Move the weight with control as you continue to above the knees.","Next comes the second pull, the main source of acceleration for the clean. As the bar approaches the mid-thigh position, begin extending through the hips. In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward. There should be no need to actively pull through the arms to accelerate the weight; at the end of the second pull, the body should be fully extended, leaning slightly back, with the arms still extended. Full extension should be violent and abrupt, and ensure that you do not prolong the extension for longer than necessary."],"Category":"olympic weightlifting"},"42":{"Name":"Clean Shrug","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["traps"],"SecondaryMuscles":["forearms","shoulders"],"Instructions":["Begin with a shoulder width, double overhand or hook grip, with the bar hanging at the mid thigh position. Your back should be straight and inclined slightly forward.","Shrug your shoulders towards your ears. While this exercise can usually by loaded with heavier weight than a clean, avoid overloading to the point that the execution slows down."],"Category":"olympic weightlifting"},"43":{"Name":"Clean and Jerk","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["abdominals","glutes","hamstrings","lower back","quadriceps","traps","triceps"],"Instructions":["With a barbell on the floor close to the shins, take an overhand or hook grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position.","Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight. Move the weight with control as you continue to above the knees.","Next comes the second pull, the main source of acceleration for the clean. As the bar approaches the mid-thigh position, begin extending through the hips. In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward. There should be no need to actively pull through the arms to accelerate the weight; at the end of the second pull, the body should be fully extended, leaning slightly back, with the arms still extended.","As full extension is achieved, transition into the third pull by aggressively shrugging and flexing the arms with the elbows up and out. At peak extension, aggressively pull yourself down, rotating your elbows under the bar as you do so. Receive the bar in a front squat position, the depth of which is dependent upon the height of the bar at the end of the third pull. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Continue to descend to the bottom squat position, which will help in the recovery.","Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position.","The second phase is the jerk, which raises the weight overhead. Standing with the weight racked on the front of the shoulders, begin with the dip. With your feet directly under your hips, flex the knees without moving the hips backward. Go down only slightly, and reverse direction as powerfully as possible.","Drive through the heels create as much speed and force as possible, and be sure to move your head out of the way as the bar leaves the shoulders.","At this moment as the feet leave the floor, the feet must be placed into the receiving position as quickly as possible. In the brief moment the feet are not actively driving against the platform, the athletes effort to push the bar up will drive them down. The feet should be split, with one foot forward, and one foot back. Receive the bar with the arms locked out overhead. Return to a standing position."],"Category":"olympic weightlifting"},"44":{"Name":"Clean and Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["abdominals","calves","glutes","hamstrings","lower back","middle back","quadriceps","shoulders","traps","triceps"],"Instructions":["Assume a shoulder-width stance, with knees inside the arms. Now while keeping the back flat, bend at the knees and hips so that you can grab the bar with the arms fully extended and a pronated grip that is slightly wider than shoulder width. Point the elbows out to sides. The bar should be close to the shins. Position the shoulders over or slightly ahead of the bar. Establish a flat back posture. This will be your starting position.","Begin to pull the bar by extending the knees. Move your hips forward and raise the shoulders at the same rate while keeping the angle of the back constant; continue to lift the bar straight up while keeping it close to your body.","As the bar passes the knee, extend at the ankles, knees, and hips forcefully, similar to a jumping motion. As you do so, continue to guide the bar with your hands, shrugging your shoulders and using the momentum from your movement to pull the bar as high as possible. The bar should travel close to your body, and you should keep your elbows out.","At maximum elevation, your feet should clear the floor and you should start to pull yourself under the bar. The mechanics of this could change slightly, depending on the weight used. You should descend into a squatting position as you pull yourself under the bar.","As the bar hits terminal height, rotate your elbows around and under the bar. Rack the bar across the front of the shoulders while keeping the torso erect and flexing the hips and knees to absorb the weight of the bar.","Stand to full height, holding the bar in the clean position.","Without moving your feet, press the bar overhead as you exhale. Lower the bar under control ."],"Category":"strength"},"45":{"Name":"Clean from Blocks","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","shoulders","traps"],"Instructions":["With a barbell on boxes or stands of the desired height, take an overhand or hook grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position.","Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight with the elbows pointed out.","As full extension is achieved, transition into the receiving position by aggressively shrugging and flexing the arms with the elbows up and out. Aggressively pull yourself down, rotating your elbows under the bar as you do so. Receive the bar in a front squat position, the depth of which is dependent upon the height of the bar at the end of the third pull. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Continue to descend to the bottom squat position, which will help in the recovery.","Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position. Return the weight to the boxes for the next rep."],"Category":"olympic weightlifting"},"46":{"Name":"Close-Grip Barbell Bench Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["Lie back on a flat bench. Using a close grip (around shoulder width), lift the bar from the rack and hold it straight over you with your arms locked. This will be your starting position.","As you breathe in, come down slowly until you feel the bar on your middle chest. Tip: Make sure that - as opposed to a regular bench press - you keep the elbows close to the torso at all times in order to maximize triceps involvement.","After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your triceps muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up.","Repeat the movement for the prescribed amount of repetitions.","When you are done, place the bar back in the rack."],"Category":"strength"},"47":{"Name":"Close-Grip EZ Bar Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":["forearms"],"Instructions":["Stand up with your torso upright while holding an E-Z Curl Bar at the closer inner handle. The palm of your hands should be facing forward and they should be slightly tilted inwards due to the shape of the bar. The elbows should be close to the torso. This will be your starting position.","While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Tip: Only the forearms should move.","Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second and squeeze the biceps hard.","Slowly begin to bring the bar back to starting position as your breathe in.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"48":{"Name":"Close-Grip Standing Barbell Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":["forearms"],"Instructions":["Hold a barbell with both hands, palms up and a few inches apart.","Stand with your torso straight and your head up. Your feet should be about shoulder width and your elbows close to your torso. This will be your starting position. Tip: You will keep your upper arms and elbows stationary throughout the movement.","Curl the bar up in a semicircular motion until the forearms touch your biceps. Exhale as you perform this portion of the movement and contract your biceps hard for a second at the top. Tip: Avoid bending the back or using swinging motions as you lift the weight. Only the forearms should move.","Slowly go back down to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"49":{"Name":"Deadlift with Bands","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["lower back"],"SecondaryMuscles":["forearms","glutes","hamstrings","middle back","quadriceps","traps"],"Instructions":["To deadlift with short bands, simply loop them over the bar before you start, and step into them to set up. For long bands, they will need to be anchored to a secure base, such as heavy dumbbells or a rack.","With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.","Lower the bar by bending at the hips and guiding it to the floor."],"Category":"powerlifting"},"50":{"Name":"Deadlift with Chains","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["lower back"],"SecondaryMuscles":["forearms","glutes","hamstrings","middle back","quadriceps","traps"],"Instructions":["You can attach the chains to the sleeves of the bar, or just drape the middle over the bar so there is a greater weight increase as you lift.","Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an overhand grip or an over/under grip on heavier sets. With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar.","Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.","Lower the bar by bending at the hips and guiding it to the floor."],"Category":"powerlifting"},"51":{"Name":"Decline Barbell Bench Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Secure your legs at the end of the decline bench and slowly lay down on the bench.","Using a medium width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over you with your arms locked. The arms should be perpendicular to the floor. This will be your starting position. Tip: In order to protect your rotator cuff, it is best if you have a spotter help you lift the barbell off the rack.","As you breathe in, come down slowly until you feel the bar on your lower chest.","After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up).","Repeat the movement for the prescribed amount of repetitions.","When you are done, place the bar back in the rack."],"Category":"strength"},"52":{"Name":"Decline Close-Grip Bench To Skull Crusher","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["Secure your legs at the end of the decline bench and slowly lay down on the bench.","Using a close grip (a grip that is slightly less than shoulder width), lift the bar from the rack and hold it straight over you with your arms locked and elbows in. The arms should be perpendicular to the floor. This will be your starting position. Tip: In order to protect your rotator cuff, it is best if you have a spotter help you lift the barbell off the rack.","Now lower the bar down to your lower chest as you breathe in. Keep the elbows in as you perform this movement.","Using the triceps to push the bar back up, press it back to the starting position as you exhale.","As you breathe in and you keep the upper arms stationary, bring the bar down slowly by moving your forearms in a semicircular motion towards you until you feel the bar slightly touch your forehead. Breathe in as you perform this portion of the movement.","Lift the bar back to the starting position by contracting the triceps and exhaling.","Repeat steps 3-6 until the recommended amount of repetitions is performed."],"Category":"strength"},"53":{"Name":"Decline EZ Bar Triceps Extension","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":[],"Instructions":["Secure your legs at the end of the decline bench and slowly lay down on the bench.","Using a close grip (a grip that is slightly less than shoulder width), lift the EZ bar from the rack and hold it straight over you with your arms locked and elbows in. The arms should be perpendicular to the floor. This will be your starting position. Tip: In order to protect your rotator cuff, it is best if you have a spotter help you lift the barbell off the rack.","As you breathe in and you keep the upper arms stationary, bring the bar down slowly by moving your forearms in a semicircular motion towards you until you feel the bar slightly touch your forehead. Breathe in as you perform this portion of the movement.","Lift the bar back to the starting position by contracting the triceps and exhaling.","Repeat until the recommended amount of repetitions is performed."],"Category":"strength"},"54":{"Name":"Deficit Deadlift","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["lower back"],"SecondaryMuscles":["forearms","glutes","hamstrings","middle back","quadriceps","traps"],"Instructions":["Begin by having a platform or weight plates that you can stand on, usually 1-3 inches in height. Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an overhand grip or an over/under grip on heavier sets.","With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.","Lower the bar by bending at the hips and guiding it to the floor."],"Category":"powerlifting"},"55":{"Name":"Drag Curl","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":["forearms"],"Instructions":["Grab a barbell with a supinated grip (palms facing forward) and get your elbows close to your torso and back. This will be your starting position.","As you exhale, curl the bar up while keeping the elbows to the back as you \"Drag\" the bar up by keeping it in contact with your torso. Tip: As you can see, you will not be keeping the elbows pinned to your sides, but instead you will be bringing them back. Also, do not lift your shoulders.","Slowly go back to the starting position as you keep the bar in contact with the torso at all times.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"56":{"Name":"Elevated Back Lunge","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["glutes","hamstrings"],"Instructions":["Position a bar onto a rack at shoulder height loaded to an appropriate weight. Place a short, raised platform behind you.","Rack the bar onto your upper back, keeping your back arched and tight. Step onto your raised platform with both feet. This will be your starting position.","Begin by stepping backwards with one leg. Descend by flexing your hips and knees until your knee touches the floor.","Pause, and extend through the hips and knees to rise up, returning all the way to the starting position before alternating."],"Category":"strength"},"57":{"Name":"Finger Curls","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["forearms"],"SecondaryMuscles":[],"Instructions":["Hold a barbell with both hands and your palms facing up; hands spaced about shoulder width.","Place your feet flat on the floor, at a distance that is slightly wider than shoulder width apart. This will be your starting position.","Lower the bar as far as possible by extending the fingers. Allowing the bar to roll down the hands, catch the bar with the final joint in the fingers.","Now curl bar up as high as possible by closing your hands while exhaling. Hold the contraction at the top."],"Category":"strength"},"58":{"Name":"Floor Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["Adjust the j-hooks so they are at the appropriate height to rack the bar. Begin lying on the floor with your head near the end of a power rack. Keeping your shoulder blades pulled together; pull the bar off of the hooks.","Lower the bar towards the bottom of your chest or upper stomach, squeezing the bar and attempting to pull it apart as you do so. Ensure that you tuck your elbows throughout the movement. Lower the bar until your upper arm contacts the ground and pause, preventing any slamming or bouncing of the weight.","Press the bar back up as fast as you can, keeping the bar, your wrists, and elbows in line as you do so."],"Category":"powerlifting"},"59":{"Name":"Floor Press with Chains","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["Adjust the j-hooks so they are at the appropriate height to rack the bar. For this exercise, drape the chains directly over the end of the bar, trying to keep the ends away from the plates.","Begin lying on the floor with your head near the end of a power rack. Keeping your shoulder blades pulled together, pull the bar off of the hooks.","Lower the bar towards the bottom of your chest or upper stomach, squeezing the bar and attempting to pull it apart as you do so. Ensure that you tuck your elbows throughout the movement. Lower the bar until your upper arm contacts the ground and pause, preventing any slamming or bouncing of the weight.","Press the bar back up as fast as you can, keeping the bar, your wrists, and elbows in line as you do so."],"Category":"powerlifting"},"60":{"Name":"Frankenstein Squat","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abdominals","calves","glutes","hamstrings"],"Instructions":["This drill teaches you the proper positioning of both the bar and your body during the clean and front squat.","Place the barbell on the front of the shoulders, releasing your grip and extending your arms out in front of you. The shoulders should be pushed forward to create a shelf, and the bar should be in contact with the throat. Ensure that you only move your shoulder blades forward; don't round the thoracic spine.","Squat by flexing the knees and hips, sitting in between your legs. Keep the torso upright, the arms up, and the shoulders forward, and the bar should stay in place. Go to the bottom of the squat, until your hamstrings contact your calves.","Return to the upright position by driving through the front of the heel and extending the knees and hips."],"Category":"olympic weightlifting"},"61":{"Name":"Front Barbell Squat","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, bring your arms up under the bar while keeping the elbows high and the upper arm slightly above parallel to the floor. Rest the bar on top of the deltoids and cross your arms while grasping the bar for total control.","Lift the bar off the rack by first pushing with your legs and at the same time straightening your torso.","Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).","Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to raise the bar as you exhale by pushing the floor mainly with the middle of your foot as you straighten the legs again and go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"62":{"Name":"Front Barbell Squat To A Bench","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["This exercise is best performed inside a squat rack for safety purposes. To begin, first set a flat bench behind you and set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, bring your arms up under the bar while keeping the elbows high and the upper arm slightly above parallel to the floor. Rest the bar on top of the deltoids and cross your arms while grasping the bar for total control.","Lift the bar off the rack by first pushing with your legs and at the same time straightening your torso.","Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).","Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until you touch the bench with your glutes. Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to raise the bar as you exhale by pushing the floor mainly with the heel of your foot as you straighten the legs again and go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"63":{"Name":"Front Raise And Pullover","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["lats","shoulders","triceps"],"Instructions":["Lie on a flat bench while holding a barbell using a palms down grip that is about 15 inches apart.","Place the bar on your upper thighs, extend your arms and lock them while keeping a slight bend on the elbows. This will be your starting position.","Now raise the weight using a semicircular motion and keeping your arms straight as you inhale. Continue the same movement until the bar is on the other side above your head . (Tip: the bar will travel approximately 180-degrees). At this point your arms should be parallel to the floor with the palms of your hands facing the ceiling.","Now return the barbell to the starting position by reversing the motion as you exhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"64":{"Name":"Front Squat (Clean Grip)","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abdominals","glutes","hamstrings"],"Instructions":["To begin, first set the bar in a rack slightly below shoulder level. Rest the bar on top of the deltoids, pushing into the clavicles, and lightly touching the throat. Your hands should be in a clean grip, touching the bar only with your fingers to help keep it in position.","Lift the bar off the rack by first pushing with your legs and at the same time straightening your torso. Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head and elbows up at all times. This will be your starting position.","Bend at the knees, sitting down between your legs. Continue down until your hamstrings are on your calves. Keep your knees aligned with your feet by consciously using your abductors to push your knees out as you squat.","Begin to raise the bar as you exhale by pushing the floor mainly with the heel or middle of your foot as you straighten the legs again and return to the starting position."],"Category":"strength"},"65":{"Name":"Good Morning","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abdominals","glutes","lower back"],"Instructions":["Begin with a bar on a rack at shoulder height. Rack the bar across the rear of your shoulders as you would a power squat, not on top of your shoulders. Keep your back tight, shoulder blades pinched together, and your knees slightly bent. Step back from the rack.","Begin by bending at the hips, moving them back as you bend over to near parallel. Keep your back arched and your cervical spine in proper alignment.","Reverse the motion by extending through the hips with your glutes and hamstrings. Continue until you have returned to the starting position."],"Category":"powerlifting"},"66":{"Name":"Good Morning off Pins","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abdominals","glutes","lower back"],"Instructions":["Begin with a bar on a rack at about the same height as your stomach. Bend over underneath the bar and rack the bar across the rear of your shoulders as you would a power squat, not on top of your shoulders. At the proper height, you should be near parallel to the floor when bent over. Keep your back tight, shoulder blades pinched together, and your knees slightly bent. Keep your back arched and your cervical spine in proper alignment.","Begin the motion by extending through the hips with your glutes and hamstrings, and you are standing with the weight. Slowly lower the weight back to the pins returning to the starting position."],"Category":"powerlifting"},"67":{"Name":"Hang Clean","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","forearms","glutes","hamstrings","lower back","shoulders","traps"],"Instructions":["Begin with a shoulder width, double overhand or hook grip, with the bar hanging at the mid thigh position. Your back should be straight and inclined slightly forward.","Begin by aggressively extending through the hips, knees and ankles, driving the weight upward. As you do so, shrug your shoulders towards your ears.","Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position."],"Category":"olympic weightlifting"},"68":{"Name":"Hang Clean - Below the Knees","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","forearms","glutes","hamstrings","lower back","shoulders","traps"],"Instructions":["Begin with a shoulder width, double overhand or hook grip, with the bar hanging just below the knees. Your back should be straight and inclined slightly forward.","Begin by aggressively extending through the hips, knees and ankles, driving the weight upward. As you do so, shrug your shoulders towards your ears. As full extension is achieved, transition into the third pull by aggressively shrugging and flexing the arms with the elbows up and out.","At peak extension, aggressively pull yourself down, rotating your elbows under the bar as you do so. Receive the bar in a front squat position, the depth of which is dependent upon the height of the bar at the end of the third pull. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Continue to descend to the bottom squat position, which will help in the recovery.","Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position."],"Category":"olympic weightlifting"},"69":{"Name":"Hang Snatch","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abdominals","calves","forearms","glutes","lower back","quadriceps","shoulders","traps"],"Instructions":["Begin with a wide grip on the bar, with an overhand or hook grip. The feet should be directly below the hips with the feet turned out. Your knees should be slightly bent, and the torso inclined forward. The spine should be fully extended and the head facing forward. The bar should be at the hips. This will be your starting position.","Aggressively extend through the legs and hips. At peak extension, shrug the shoulders and allow the elbows to flex to the side.","As you move your feet into the receiving position, forcefully pull yourself below the bar as you elevate the bar overhead. Receive the bar with your body as low as possible and the arms fully extended overhead.","Return to a standing position with the weight overhead. Follow by returning the weight to the ground under control."],"Category":"olympic weightlifting"},"70":{"Name":"Hang Snatch - Below Knees","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abdominals","calves","forearms","glutes","lower back","quadriceps","shoulders","traps"],"Instructions":["Begin with a wide grip on the bar, with an overhand or hook grip. The feet should be directly below the hips with the feet turned out. Your knees should be slightly bent, and the torso inclined forward. The spine should be fully extended and the head facing forward. The bar should be just below the knees. This will be your starting position.","Aggressively extend through the legs and hips. At peak extension, shrug the shoulders and allow the elbows to flex to the side.","As you move your feet into the receiving position, forcefully pull yourself below the bar as you elevate the bar overhead. Receive the bar with your body as low as possible and the arms fully extended overhead.","Return to a standing position with the weight overhead, and then return the weight to the floor under control."],"Category":"olympic weightlifting"},"71":{"Name":"Hanging Bar Good Morning","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abdominals","glutes","lower back"],"Instructions":["Begin with a bar on a rack at about the same height as your stomach. Suspend the bar using chains or suspension straps.","Bend over underneath the bar and rack the bar across the rear of your shoulders as you would a power squat, not on top of your traps. At the proper height, you should be near parallel to the floor when bent over. Keep your back tight, shoulder blades pinched together, and your knees slightly bent. Keep your back arched and your cervical spine in proper alignment.","Begin the motion by extending through the hips with your glutes and hamstrings, and you are standing with the weight.","Slowly lower the weight back to the starting position, where it is supported by the chains."],"Category":"powerlifting"},"72":{"Name":"Heaving Snatch Balance","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abdominals","forearms","glutes","hamstrings","shoulders","triceps"],"Instructions":["This drill helps you learn the snatch. Begin by holding a light weight across the back of the shoulders. Your feet should be slightly wider than hip width apart with the feet turned out, the same position that you would perform a squat with.","Begin by dipping with the knees slightly, and popping back up to briefly unload the bar. Drive yourself underneath the bar, elevating it overhead as you descend into a full squat.","Return to a standing position."],"Category":"olympic weightlifting"},"73":{"Name":"Incline Barbell Triceps Extension","Force":"push","Level":"intermediate","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["forearms"],"Instructions":["Hold a barbell with an overhand grip (palms down) that is a little closer together than shoulder width.","Lie back on an incline bench set at any angle between 45-75-degrees.","Bring the bar overhead with your arms extended and elbows in. The arms should be in line with the torso above the head. This will be your starting position.","Now lower the bar in a semicircular motion behind your head until your forearms touch your biceps. Inhale as you perform this movement. Tip: Keep your upper arms stationary and close to your head at all times. Only the forearms should move.","Return to the starting position as you breathe out and you contract the triceps. Hold the contraction for a second.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"74":{"Name":"Incline Bench Pull","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["lats","shoulders"],"Instructions":["Grab a dumbbell in each hand and lie face down on an incline bench that is set to an incline that is approximately 30 degrees.","Let the arms hang to your sides fully extended as they point to the floor.","Turn the wrists until your hands have a pronated (palms down) grip.","Now flare the elbows out. This will be your starting position.","As you breathe out, start to pull the dumbbells up as if you are doing a reverse bench press. You will do this by bending at the elbows and bringing the upper arms up as you let the forearms hang. Continue this motion until the upper arms are at the same level as your back. Tip: The elbows will come out to the side and your upper arms and torso should make the letter \"T\" at the top of the movement. Hold the contraction at the top for a second.","Slowly go back down to the starting position as you breathe in.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"75":{"Name":"JM Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["Start the exercise the same way you would a close grip bench press. You will lie on a flat bench while holding a barbell at arms length (fully extended) with the elbows in. However, instead of having the arms perpendicular to the torso, make sure the bar is set in a direct line above the upper chest. This will be your starting position.","Now beginning from a fully extended position lower the bar down as if performing a lying triceps extension. Inhale as you perform this movement. When you reach the half way point, let the bar roll back about one inch by moving the upper arms towards your legs until they are perpendicular to the torso. Tip: Keep the bend at the elbows constant as you bring the upper arms forward.","As you exhale, press the bar back up by using the triceps to perform a close grip bench press.","Now go back to the starting position and start over.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"76":{"Name":"Jefferson Squats","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","lower back","traps"],"Instructions":["Place a barbell on the floor.","Stand in the middle of the bar length wise.","Bend down by bending at the knees and keeping your back straight and grasp the front of the bar with your right hand. Your palm should be in (neutral grip) facing the left side.","Grasp the rear of the bar with your left hand. The palm of your hand should be in neutral grip alignment (palms facing the right side). Tip: Ensure that your grip is even on the bar. Your torso should be positioned right in the middle of the bar and the distance between your torso and your right hand (which should be at the front) should be the same as the distance between your torso and your left hand (which should be to your back).","Now stand straight up with the weight. Tip: Your feet should be shoulder width apart and your toes slightly pointed out.","Squat down by bending at the knees and keeping your back straight until your upper thighs are parallel with the floor. Tip: Keep your back as vertical as possible with the floor and your head up. Also remember to not let your knees go past your toes. Inhale during this portion of the movement.","Now drive yourself back up to the starting position by pushing with the feet . Tip: Keep the bar hanging at arm's length and your elbows locked with a slight bend. The arms only serve as hooks. Avoid doing any lifting with them. Do the lifting with your thighs; not your arms."],"Category":"strength"},"77":{"Name":"Jerk Balance","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["glutes","hamstrings","quadriceps","triceps"],"Instructions":["This drill helps you learn to drive yourself low enough during the jerk and corrects those who move backward during the movement. Begin with the bar racked in the jerk position, with the shoulders forward, torso upright, and the feet split slightly apart.","Initiate the movement as you would a normal jerk, dipping at the knees while keeping your torso vertical, and driving back up forcefully, using momentum and not your arms to elevate the weight.","Keep the rear foot in place, using it to drive your body forward into a full split as you jerk the weight. Recover by standing up with the weight overhead."],"Category":"olympic weightlifting"},"78":{"Name":"Jerk Dip Squat","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abdominals","calves"],"Instructions":["This movement strengthens the dip portion of the jerk. Begin with the bar racked in the jerk position, with the shoulders forward to create a shelf and the bar lightly contacting the throat. The feet should be directly under the hips, with the feet turned out as is comfortable.","Keeping the torso vertical, dip by flexing the knees, allowing them to travel forward and without moving the hips to the rear. The dip should not be excessive. Return the weight to the starting position by driving forcefully though the feet."],"Category":"olympic weightlifting"},"79":{"Name":"Kneeling Jump Squat","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["glutes"],"SecondaryMuscles":["calves","hamstrings","quadriceps"],"Instructions":["Begin kneeling on the floor with a barbell racked across the back of your shoulders, or you can use your body weight for this exercise. This can be done inside of a power rack to make unracking easier.","Sit back with your hips until your glutes touch your feet, keeping your head and chest up.","Explode up with your hips, generating enough power to land with your feet flat on the floor.","Continue with the squat by driving through your heels and extending the knees to come to a standing position."],"Category":"olympic weightlifting"},"80":{"Name":"Kneeling Squat","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["glutes"],"SecondaryMuscles":["abdominals","hamstrings","lower back"],"Instructions":["Set the bar to the proper height in a power rack. Kneel behind the bar; it may be beneficial to put a mat down to pad your knees. Slide under the bar, racking it across the back of your shoulders. Your shoulder blades should be retracted and the bar tight across your back. Unrack the weight.","With your head looking forward, sit back with your butt until you touch your calves.","Reverse the motion, returning the torso to an upright position."],"Category":"powerlifting"},"81":{"Name":"Landmine 180's","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["glutes","lower back","shoulders"],"Instructions":["Position a bar into a landmine or securely anchor it in a corner. Load the bar to an appropriate weight.","Raise the bar from the floor, taking it to shoulder height with both hands with your arms extended in front of you. Adopt a wide stance. This will be your starting position.","Perform the movement by rotating the trunk and hips as you swing the weight all the way down to one side. Keep your arms extended throughout the exercise.","Reverse the motion to swing the weight all the way to the opposite side.","Continue alternating the movement until the set is complete."],"Category":"strength"},"82":{"Name":"Landmine Linear Jammer","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["abdominals","calves","chest","hamstrings","quadriceps","triceps"],"Instructions":["Position a bar into landmine or, lacking one, securely anchor it in a corner. Load the bar to an appropriate weight and position the handle attachment on the bar.","Raise the bar from the floor, taking the handles to your shoulders. This will be your starting position.","In an athletic stance, squat by flexing your hips and setting your hips back, keeping your arms flexed.","Reverse the motion by powerfully extending through the hips, knees, and ankles, while also extending the elbows to straighten the arms. This movement should be done explosively, coming out of the squat to full extension as powerfully as possible.","Return to the starting position."],"Category":"strength"},"83":{"Name":"Lying Cambered Barbell Row","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats","traps"],"Instructions":["Place a cambered bar underneath an exercise bench.","Lie face down on the exercise bench and grab the bar using a palms down (pronated grip) that is wider than shoulder width. This will be your starting position.","As you exhale row the bar up as you keep the elbows close to your body to either your chest, in order to target the upper mid back, or to your stomach if targeting the lats is your goal.","After a second hold at the top, lower back down to the starting position slowly as you inhale."],"Category":"strength"},"84":{"Name":"Lying Close-Grip Barbell Triceps Extension Behind The Head","Force":"push","Level":"intermediate","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":[],"Instructions":["While holding a barbell or EZ Curl bar with a pronated grip (palms facing forward), lie on your back on a flat bench with your head close to the end of the bench. Tip: If you are holding a barbell grab it using a shoulder-width grip and if you are using an E-Z Bar grab it on the inner handles.","Extend your arms in front of you and slowly bring the bar back in a semi circular motion (while keeping the arms extended) to a position over your head. At the end of this step your arms should be overhead and parallel to the floor. This will be your starting position. Tip: Keep your elbows in at all times.","As you inhale, lower the bar by bending at the elbows and while keeping the upper arm stationary. Keep lowering the bar until your forearms are perpendicular to the floor.","As you exhale bring the bar back up to the starting position by pushing the bar up in a semi-circular motion until the lower arms are also parallel to the floor. Contract the triceps hard at the top of the movement for a second. Tip: Again, only the forearms should move. The upper arms should remain stationary at all times.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"85":{"Name":"Lying High Bench Barbell Curl","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Lie face forward on a tall flat bench while holding a barbell with a supinated grip (palms facing up). Tip: If you are holding a barbell grab it using a shoulder-width grip and if you are using an E-Z Bar grab it on the inner handles. Your upper body should be positioned in a way that the upper chest is over the end of the bench and the barbell is hanging in front of you with the arms extended and perpendicular to the floor. This will be your starting position.","While keeping the elbows in and the upper arms stationary, curl the weight up in a semi-circular motion as you contract the biceps and exhale. Hold at the top of the movement for a second.","As you inhale, slowly go back to the starting position. Tip: Maintain full control of the weight at all times and avoid any swinging. Remember, only the forearms should move throughout the movement.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"86":{"Name":"Muscle Snatch","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["glutes","lower back","quadriceps","shoulders","triceps"],"Instructions":["Begin with a loaded barbell held at the mid thigh position with a wide grip. The feet should be directly below the hips, with the feet turned out as needed. Lower the hips, with the chest up and the head looking forward. The shoulders should be just in front of the bar. This will be the starting position.","Begin the pull by driving through the front of the heels, raising the bar. Transition into the second pull by extending through the hips knees and ankles, driving the bar up as quickly as possible. The bar should be close to the body.","Continue raising the bar to the overhead position, without rebending the knees."],"Category":"olympic weightlifting"},"87":{"Name":"Narrow Stance Squats","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","lower back"],"Instructions":["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.","Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.","Step away from the rack and position your legs using a less-than-shoulder-width narrow stance with the toes slightly pointed out. Feet should be around 3-6 inches apart. Keep your head up at all times (looking down will get you off balance) and maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section).","Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to raise the bar as you exhale by pushing the floor with the heel of your foot mainly as you straighten the legs again and go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"88":{"Name":"Neck Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Lie back on a flat bench. Using a medium-width grip (a grip that creates a 90-degree angle in the middle of the movement between the forearms and the upper arms), lift the bar from the rack and hold it straight over your neck with your arms locked. This will be your starting position.","As you breathe in, come down slowly until you feel the bar on your neck.","After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up).","Repeat the movement for the prescribed amount of repetitions.","When you are done, place the bar back in the rack."],"Category":"strength"},"89":{"Name":"Olympic Squat","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Begin with a barbell supported on top of the traps. The chest should be up, and the head facing forward. Adopt a hip width stance with the feet turned out as needed.","Descend by flexing the knees, refraining from moving the hips back as much as possible. This requires that the knees travel forward; ensure that they stay aligned with the feet. The goal is to keep the torso as upright as possible. Continue all the way down, keeping the weight on the front of the heel.","At the moment the upper legs contact the lower, reverse the motion, driving the weight upward."],"Category":"olympic weightlifting"},"90":{"Name":"One-Arm Long Bar Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Position a bar into a landmine or in a corner to keep it from moving. Load an appropriate weight onto your end.","Stand next to the bar, and take a grip with one hand close to the collar. Using your hips and legs, rise to a standing position.","Assume a bent-knee stance with your hips back and your chest up. Your arm should be extended. This will be your starting position.","Pull the weight to your side by retracting the shoulder and flexing the elbow. Do not jerk the weight or cheat during the movement.","After a brief pause, return to the starting position."],"Category":"strength"},"91":{"Name":"One-Arm Side Deadlift","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abdominals","calves","glutes","hamstrings","lower back","traps"],"Instructions":["Stand to the side of a barbell next to its center. Bend your knees and lower your body until you are able to reach the barbell.","Grasp the bar as if you were grabbing a briefcase (palms facing you since the bar is sideways). You may need a wrist wrap if you are using a significant amount of weight. This is your starting position.","Use your legs to help lift the barbell up while exhaling. Your arms should extend fully as bring the barbell up until you are in a standing position.","Slowly bring the barbell back down while inhaling. Tip: Make sure to bend your knees while lowering the weight to avoid any injury from occurring.","Repeat for the recommended amount of repetitions.","Switch arms and repeat the movement."],"Category":"strength"},"92":{"Name":"One Arm Floor Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["Lie down on a flat surface with your back pressing against the floor or an exercise mat. Make sure your knees are bent.","Have a partner hand you the bar on one hand. When starting, your arm should be just about fully extended, similar to the starting position of a barbell bench press. However, this time your grip will be neutral (palms facing your torso).","Make sure the hand you are not using to lift the weight is placed by your side.","Begin the exercise by lowering the barbell until your elbow touches the ground. Make sure to breathe in as this is the eccentric (lowering part of the exercise).","Then start lifting the barbell back up to the original starting position. Remember to breathe out during the concentric (lifting part of the exercise).","Repeat until you have performed your recommended repetitions.","Switch arms and repeat the movement."],"Category":"strength"},"93":{"Name":"One Leg Barbell Squat","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Start by standing about 2 to 3 feet in front of a flat bench with your back facing the bench. Have a barbell in front of you on the floor. Tip: Your feet should be shoulder width apart from each other.","Bend the knees and use a pronated grip with your hands being wider than shoulder width apart from each other to lift the barbell up until you can rest it on your chest.","Then lift the barbell over your head and rest it on the base of your neck. Move one foot back so that your toe is resting on the flat bench. Your other foot should be stationary in front of you. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. Tip: Make sure your back is straight and chest is out while performing this exercise.","As you inhale, slowly lower your leg until your thigh is parallel to the floor. At this point, your knee should be over your toes. Your chest should be directly above the middle of your thigh.","Leading with the chest and hips and contracting the quadriceps, elevate your leg back to the starting position as you exhale.","Repeat for the recommended amount of repetitions.","Switch legs and repeat the movement."],"Category":"strength"},"94":{"Name":"Overhead Squat","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abdominals","calves","glutes","hamstrings","lower back","shoulders","triceps"],"Instructions":["Start out by having a barbell in front of you on the floor. Your feet should be wider than shoulder width apart from each other.","Bend the knees and use a pronated grip (palms facing you) to grab the barbell. Your hands should be at a wider than shoulder width apart from each other before lifting. Once you are positioned, lift the barbell up until you can rest it on your chest.","Move the barbell over and slightly behind your head and make sure your arms are fully extended. Keep your head up at all times and also maintain a straight back. Retract your shoulder blades. This is your starting position.","Slowly lower the weight by bending your knees until your thighs are parallel to the ground while inhaling. Tip: Keep your back straight while performing this exercise to avoid any injuries and your arms should remain extended and over your head at all times.","Now use your feet and legs to help bring the weight back up to the starting position while exhaling.","Repeat for the recommended amount of repetitions."],"Category":"olympic weightlifting"},"95":{"Name":"Palms-Down Wrist Curl Over A Bench","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["forearms"],"SecondaryMuscles":[],"Instructions":["Start out by placing a barbell on one side of a flat bench.","Kneel down on both of your knees so that your body is facing the flat bench.","Use your arms to grab the barbell with a pronated grip (palms down) and bring them up so that your forearms are resting against the flat bench. Your wrists should be hanging over the edge.","Start out by curling your wrist upwards and exhaling.","Slowly lower your wrists back down to the starting position while inhaling.","Your forearms should be stationary as your wrist is the only movement needed to perform this exercise.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"96":{"Name":"Palms-Up Barbell Wrist Curl Over A Bench","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["forearms"],"SecondaryMuscles":[],"Instructions":["Start out by placing a barbell on one side of a flat bench.","Kneel down on both of your knees so that your body is facing the flat bench.","Use your arms to grab the barbell with a supinated grip (palms up) and bring them up so that your forearms are resting against the flat bench. Your wrists should be hanging over the edge.","Start out by curling your wrist upwards and exhaling.","Slowly lower your wrists back down to the starting position while inhaling.","Your forearms should be stationary as your wrist is the only movement needed to perform this exercise.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"97":{"Name":"Pin Presses","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","forearms","lats","middle back","shoulders"],"Instructions":["Pin presses remove the eccentric phase of the bench press, developing starting strength. They also allow you to train a desired range of motion.","The bench should be set up in a power rack. Set the pins to the desired point in your range of motion, whether it just be lockout or an inch off of your chest. The bar should be moved to the pins and prepared for lifting.","Begin by lying on the bench, with the bar directly above the contact point during your regular bench. Tuck your feet underneath you and arch your back. Using the bar to help support your weight, lift your shoulder off the bench and retract them, squeezing the shoulder blades together. Use your feet to drive your traps into the bench. Maintain this tight body position throughout the movement.","You can take a standard bench grip, or shoulder width to focus on the triceps. The bar, wrist, and elbow should stay in line at all times. Focus on squeezing the bar and trying to pull it apart.","Drive the bar up with as much force as possible. The elbows should be tucked in until lockout.","Return the bar to the pins, pausing before beginning the next repetition."],"Category":"powerlifting"},"98":{"Name":"Power Clean","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","forearms","glutes","lower back","middle back","quadriceps","shoulders","traps","triceps"],"Instructions":["Stand with your feet slightly wider than shoulder width apart and toes pointing out slightly.","Squat down and grasp bar with a closed, pronated grip. Your hands should be slightly wider than shoulder width apart outside knees with elbows fully extended.","Place the bar about 1 inch in front of your shins and over the balls of your feet.","Your back should be flat or slightly arched, your chest held up and out and your shoulder blades should be retracted.","Keep your head in a neutral position (in line with vertebral column and not tilted or rotated) with your eyes focused straight ahead. Inhale during this phase.","Lift the bar from the floor by forcefully extending the hips and the knees as you exhale. Tip: The upper torso should maintain the same angle. Do not bend at the waist yet and do not let the hips rise before the shoulders (this would have the effect of pushing the glutes in the air and stretching the hamstrings.","Keep elbows fully extended with the head in a neutral position and the shoulders over the bar.","As the bar raises keep it as close to the shins as possible.","As the bar passes the knees, thrust your hips forward and slightly bend the knees to avoid locking them. Tip: At this point your thighs should be against the bar.","Keep the back flat or slightly arched, elbows fully extended and your head neutral. Tip: You will hold your breath until the next phase.","Inhale and then forcefully and quickly extend your hips and knees and stand on your toes.","Keep the bar as close to your body as possible. Tip: Your back should be flat with the elbows pointed out to the sides and your head in a neutral position. Also, keep your shoulders over the bar and arms straight as long as possible.","When your lower body joints are fully extended, shrug the shoulders upward rapidly without letting the elbows flex yet. Exhale during this portion of the movement.","As the shoulders reach their highest elevation flex your elbows to begin pulling your body under the bar.","Continue to pull the arms as high and as long as possible. Tip: Due to the explosive nature of this phase, your torso will be erect or with an arched back, your head will be tilted back slightly and your feet may lose contact with the floor.","After the lower body has fully extended and the bar reaches near maximal height, pull your body under the bar and rotate the arms around and under the bar.","Simultaneously, flex the hips and knees into a quarter squat position.","Once the arms are under the bar, inhale and then lift your elbows to position the upper arms parallel to the floor. Rack the bar across the front of your collar bones and front shoulder muscles.","Catch the bar with an erect and tight torso, a neutral head position and flat feet. Exhale during this movement.","Stand up by extending the hips and knees to a fully erect position.","Lower the bar by gradually reducing the muscular tension of the arms to allow a controlled descent of the bar to the thighs. Inhale during this movement.","Simultaneously flex the hips and knees to cushion the impact of the bar on the thighs.","Squat down with the elbows fully extended until the bar touches the floor.","Start over at Phase 1 and repeat for the recommended amount of repetitions."],"Category":"strength"},"99":{"Name":"Power Clean from Blocks","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["quadriceps"],"Instructions":["With a barbell on boxes of the desired height, take a grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position.","Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight. As the bar approaches the mid-thigh position, begin extending through the hips.","In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward. There should be no need to actively pull through the arms to accelerate the weight. At the end of the second pull, the body should be fully extended, leaning slightly back, with the arms still extended.","As full extension is achieved, transition into the third pull by aggressively shrugging and flexing the arms with the elbows up and out. At peak extension, pull yourself under the bar far enough that it can be racked onto the shoulders, rotating your elbows under the bar as you do so. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed.","Immediately recover by driving through the heels, keeping the torso upright and elbows up. Continue until you have risen to a standing position, and complete the repetition by returning the weight to the boxes."],"Category":"olympic weightlifting"},"100":{"Name":"Power Jerk","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abdominals","calves","glutes","hamstrings","shoulders","triceps"],"Instructions":["Standing with the weight racked on the front of the shoulders, begin with the dip. With your feet directly under your hips, flex the knees without moving the hips backward. Go down only slightly, and reverse direction as powerfully as possible.","Drive through the heels create as much speed and force as possible, and be sure to move your head out of the way as the bar leaves the shoulders.","At this moment as the feet leave the floor, the feet must be placed into the receiving position as quickly as possible. In the brief moment the feet are not actively driving against the platform, the athletes effort to push the bar up will drive them down. The feet should be moved to a slightly wider stance, with the knees partially bent.","Receive the bar with the arms locked out overhead.","Return to a standing position."],"Category":"olympic weightlifting"},"101":{"Name":"Power Snatch","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","glutes","lower back","quadriceps","shoulders","traps","triceps"],"Instructions":["Begin with a loaded barbell on the floor. The bar should be close to or touching the shins, and a wide grip should be taken on the bar. The feet should be directly below the hips, with the feet turned out as needed. Lower the hips, with the chest up and the head looking forward. The shoulders should be just in front of the bar. This will be the starting position.","Begin the first pull by driving through the front of the heels, raising the bar from the ground. The back angle should stay the same until the bar passes the knees.","Transition into the second pull by extending through the hips knees and ankles, driving the bar up as quickly as possible. The bar should be close to the body. At peak extension, shrug the shoulders and allow the elbows to flex to the side.","As you move your feet into the receiving position, a slightly wider position, pull yourself below the bar as you elevate the bar overhead. The bar should be received in a partial squat. Continue raising the bar to the overhead position, receiving the bar locked out overhead.","Return to a standing position with the weight over head."],"Category":"olympic weightlifting"},"102":{"Name":"Power Snatch from Blocks","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","forearms","glutes","hamstrings","lower back","shoulders","traps","triceps"],"Instructions":["Begin with a loaded barbell on boxes or stands of the desired height. A wide grip should be taken on the bar. The feet should be directly below the hips, with the feet turned out as needed. Lower the hips, with the chest up and the head looking forward. The shoulders should be just in front of the bar, with the elbows pointed out. This will be the starting position.","Begin the first pull by driving through the front of the heels, raising the bar from the boxes.","Transition into the second pull by extending through the hips knees and ankles, driving the bar up as quickly as possible. The bar should be close to the body. At peak extension, shrug the shoulders and allow the elbows to flex to the side.","As you move your feet into the receiving position, forcefully pull yourself below the bar as you elevate the bar overhead. The feet should move to just outside the hips, turned out as necessary. Receive the bar above a full squat and with the arms fully extended overhead.","Keeping the bar aligned over the front of the heels, your head and chest up, drive through heels of the feet to move to a standing position. Carefully return the weight to the boxes."],"Category":"olympic weightlifting"},"103":{"Name":"Preacher Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["To perform this movement you will need a preacher bench and an E-Z bar. Grab the E-Z curl bar at the close inner handle (either have someone hand you the bar which is preferable or grab the bar from the front bar rest provided by most preacher benches). The palm of your hands should be facing forward and they should be slightly tilted inwards due to the shape of the bar.","With the upper arms positioned against the preacher bench pad and the chest against it, hold the E-Z Curl Bar at shoulder length. This will be your starting position.","As you breathe in, slowly lower the bar until your upper arm is extended and the biceps is fully stretched.","As you exhale, use the biceps to curl the weight up until your biceps is fully contracted and the bar is at shoulder height. Squeeze the biceps hard and hold this position for a second.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"104":{"Name":"Press Sit-Up","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["chest","shoulders","triceps"],"Instructions":["To begin, lie down on a bench with a barbell resting on your chest. Position your legs so they are secure on the extension of the abdominal bench. This is the starting position.","While inhaling, tighten your abdominals and glutes. Simultaneously curl your torso as you do when performing a sit-up and press the barbell to an overhead position while exhaling. Tip: Use your arms to push the barbell out as you perform this exercise while still focusing on the abdominal muscles.","Lower your upper body back down to the starting position while bringing the barbell back down to your torso. Remember to breathe in while lowering the body.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"105":{"Name":"Push Press","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["quadriceps","triceps"],"Instructions":[],"Category":"olympic weightlifting"},"106":{"Name":"Push Press - Behind the Neck","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["calves","quadriceps","triceps"],"Instructions":["Standing with the weight racked on the back of the shoulders, begin with the dip. With your feet directly under your hips, flex the knees without moving the hips backward. Go down only slightly, and reverse direction as powerfully as possible. Drive through the heels create as much speed and force as possible, moving the bar in a vertical path.","Using the momentum generated, finish pressing the weight overhead be extending through the arms.","Return to the starting position, using your legs to absorb the impact."],"Category":"olympic weightlifting"},"107":{"Name":"Rack Delivery","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["forearms","traps"],"Instructions":["This drill teaches the delivery of the barbell to the rack position on the shoulders. Begin holding a bar in the scarecrow position, with the upper arms parallel to the floor, and the forearms hanging down. Use a hook grip, with your fingers wrapped over your thumbs.","Begin by rotating the elbows around the bar, delivering the bar to the shoulders. As your elbows come forward, relax your grip. The shoulders should be protracted, providing a shelf for the bar, which should lightly contact the throat.","It is important that the bar stay close to the body at all times, as with a heavier load any distance will result in an unwanted collision. As the movement becomes smoother, speed and load can be increased before progressing further."],"Category":"olympic weightlifting"},"108":{"Name":"Rack Pull with Bands","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["lower back"],"SecondaryMuscles":["forearms","glutes","hamstrings","quadriceps","traps"],"Instructions":["Set up in a power rack with the bar on the pins. The pins should be set to the desired point; just below the knees, just above, or in the mid thigh position. Attach bands to the base of the rack, or secure them with dumbbells. Attach the other end to the bar. You may need to choke the bands to provide tension.","Position yourself against the bar in proper deadlifting position. Your feet should be under your hips, your grip shoulder width, back arched, and hips back to engage the hamstrings. Since the weight is typically heavy, you may use a mixed grip, a hook grip, or use straps to aid in holding the weight.","With your head looking forward, extend through the hips and knees, pulling the weight up and back until lockout. Be sure to pull your shoulders back as you complete the movement. Return the weight to the pins and repeat."],"Category":"powerlifting"},"109":{"Name":"Rack Pulls","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["lower back"],"SecondaryMuscles":["forearms","glutes","hamstrings","traps"],"Instructions":["Set up in a power rack with the bar on the pins. The pins should be set to the desired point; just below the knees, just above, or in the mid thigh position. Position yourself against the bar in proper deadlifting position. Your feet should be under your hips, your grip shoulder width, back arched, and hips back to engage the hamstrings. Since the weight is typically heavy, you may use a mixed grip, a hook grip, or use straps to aid in holding the weight.","With your head looking forward, extend through the hips and knees, pulling the weight up and back until lockout. Be sure to pull your shoulders back as you complete the movement.","Return the weight to the pins and repeat."],"Category":"powerlifting"},"110":{"Name":"Reverse Band Bench Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","forearms","lats","middle back","shoulders"],"Instructions":["Position a bench inside a power rack, with the bar set to the correct height. Begin by anchoring bands either to band pegs or to the top of the rack. Ensure that you will be position properly under the bands. Attach the other end to the barbell.","Lie on the bench, tuck your feet underneath you and arch your back. Using the bar to help support your weight, lift your shoulder off the bench and retract them, squeezing the shoulder blades together. Use your feet to drive your traps into the bench. Maintain this tight body position throughout the movement. However wide your grip, it should cover the ring on the bar.","Pull the bar out of the rack without protracting your shoulders. Focus on squeezing the bar and trying to pull it apart. Lower the bar to your lower chest or upper stomach. The bar, wrist, and elbow should stay in line at all times.","Pause when the barbell touches your torso, and then drive the bar up with as much force as possible. The elbows should be tucked in until lockout."],"Category":"powerlifting"},"111":{"Name":"Reverse Band Box Squat","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","forearms","glutes","hamstrings","lower back"],"Instructions":["Begin in a power rack with a box at the appropriate height behind you. Set up the bands either on band pegs or attached to the top of the rack, ensuring they will be directly above the bar during the squat. Attach the other end to the bar.","Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wider for more emphasis on the back, glutes, adductors, and hamstrings, or closer together for more quad development. Keep your head facing forward.","With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. Ideally, your shins should be perpendicular to the ground. Pause when you reach the box, and relax the hip flexors. Never bounce off of a box.","Keeping the weight on your heels and pushing your feet and knees out, drive upward off of the box as you lead the movement with your head. Continue upward, maintaining tightness head to toe. Use care to return the barbell to the rack."],"Category":"powerlifting"},"112":{"Name":"Reverse Band Deadlift","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["lower back"],"SecondaryMuscles":["abductors","adductors","calves","glutes","hamstrings","quadriceps"],"Instructions":["Set the bar up in a power rack. Attach bands to the top of the rack, using either bands pegs or the frame itself. Attach the other end of the bands to the bar.","Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an overhand grip or an over/under grip on heavier sets.","With your feet, and your grip set, take a big breath and then lower your hips and bend the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward.","After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.","Lower the bar by bending at the hips and guiding it to the floor."],"Category":"powerlifting"},"113":{"Name":"Reverse Band Power Squat","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["adductors","calves","glutes","hamstrings","lower back"],"Instructions":["Begin in a power rack with the pins and bar set at the appropriate height. After loading the bar, attach bands to the top of the rack, using either pegs or the frame itself. Attach the other end of the bands to the bar.","Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wide for more emphasis on the back, glutes, adductors, and hamstrings.","Keep your head facing forward. With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips as much as possible. Ideally, your shins should be perpendicular to the ground. Lower bar position necessitates a greater torso lean to keep the bar over the heels. Continue until you break parallel, which is defined as the crease of the hip being in line with the top of the knee.","Keeping the weight on your heels and pushing your feet and knees out, drive upward as you lead the movement with your head. Continue upward, maintaining tightness head to toe, until you have returned to the starting position."],"Category":"powerlifting"},"114":{"Name":"Reverse Band Sumo Deadlift","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abductors","adductors","calves","forearms","glutes","lower back","quadriceps","traps"],"Instructions":["Begin with a bar loaded on the floor inside of a power rack. Attach bands to the top of the rack, using either pegs or the frame itself. Attach the other end to the barbell.","Approach the bar so that the bar intersects the middle of the feet. The feet should be set very wide, near the collars. Bend at the hips to grip the bar. The arms should be directly below the shoulders, inside the legs, and you can use a pronated grip, a mixed grip, or hook grip. Relax the shoulders, which in effect lengthens your arms.","Take a breath, and then lower your hips, looking forward with your head with your chest up. Drive through the floor, spreading your feet apart, with your weight on the back half of your feet. Extend through the hips and knees.","As the bar passes through the knees, lean back and drive the hips into the bar, pulling your shoulder blades together.","Return the weight to the ground by bending at the hips and controlling the weight on the way down."],"Category":"powerlifting"},"115":{"Name":"Reverse Barbell Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":["forearms"],"Instructions":["Stand up with your torso upright while holding a barbell at shoulder width with the elbows close to the torso. The palm of your hands should be facing down (pronated grip). This will be your starting position.","While holding the upper arms stationary, curl the weights while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second as you squeeze the muscle.","Slowly begin to bring the bar back to starting position as your breathe in.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"116":{"Name":"Reverse Grip Bent-Over Rows","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats","shoulders"],"Instructions":["Stand erect while holding a barbell with a supinated grip (palms facing up).","Bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The barbell should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.","While keeping the torso stationary, lift the barbell as you breathe out, keeping the elbows close to the body and not doing any force with the forearm other than holding the weights. On the top contracted position, squeeze the back muscles and hold for a second.","Slowly lower the weight again to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"117":{"Name":"Reverse Triceps Bench Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["Lie back on a flat bench. Using a close, supinated grip (around shoulder width), lift the bar from the rack and hold it straight over you with your arms locked extended in front of you and perpendicular to the floor. This will be your starting position.","As you breathe in, come down slowly until you feel the bar on your middle chest. Tip: Make sure that as opposed to a regular bench press, you keep the elbows close to the torso at all times in order to maximize triceps involvement.","After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your triceps muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up.","Repeat the movement for the prescribed amount of repetitions.","When you are done, place the bar back in the rack."],"Category":"strength"},"118":{"Name":"Rocking Standing Calf Raise","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["calves"],"SecondaryMuscles":[],"Instructions":["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place it on the back of your shoulders (slightly below the neck).","Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.","Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance. Also maintain a straight back and keep the knees with a slight bend; never locked. This will be your starting position.","Raise your heels as you breathe out by extending your ankles as high as possible and flexing your calf. Ensure that the knee is kept stationary at all times. There should be no bending (other than the slight initial bend we created during positioning) at any time. Hold the contracted position by a second before you start to go back down.","Go back slowly to the starting position as you breathe in by lowering your heels as you bend the ankles until calves are stretched.","Now lift your toes by contracting the tibia muscles in the front of the calves as you breathe out.","Hold for a second and bring them back down as you breathe in.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"119":{"Name":"Romanian Deadlift","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","glutes","lower back"],"Instructions":["Put a barbell in front of you on the ground and grab it using a pronated (palms facing down) grip that a little wider than shoulder width. Tip: Depending on the weight used, you may need wrist wraps to perform the exercise and also a raised platform in order to allow for better range of motion.","Bend the knees slightly and keep the shins vertical, hips back and back straight. This will be your starting position.","Keeping your back and arms completely straight at all times, use your hips to lift the bar as you exhale. Tip: The movement should not be fast but steady and under control.","Once you are standing completely straight up, lower the bar by pushing the hips back, only slightly bending the knees, unlike when squatting. Tip: Take a deep breath at the start of the movement and keep your chest up. Hold your breath as you lower and exhale as you complete the movement.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"120":{"Name":"Romanian Deadlift from Deficit","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["forearms","glutes","lower back","traps"],"Instructions":["Begin standing while holding a bar at arms length in front of you. You can stand on a raised platform to increase the range of motion.","Begin by flexing the knees slightly, and then flex at the hip, moving your butt back as far as possible, lowering the torso as far as flexibility allows. The back should remain in absolute extension at all times, and the bar should remain in contact with the legs. If done properly, there should be heavy tension felt in the hamstrings.","Reverse the motion to return to the starting position."],"Category":"olympic weightlifting"},"121":{"Name":"Seated Barbell Military Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Sit on a Military Press Bench with a bar behind your head and either have a spotter give you the bar (better on the rotator cuff this way) or pick it up yourself carefully with a pronated grip (palms facing forward). Tip: Your grip should be wider than shoulder width and it should create a 90-degree angle between the forearm and the upper arm as the barbell goes down.","Once you pick up the barbell with the correct grip length, lift the bar up over your head by locking your arms. Hold at about shoulder level and slightly in front of your head. This is your starting position.","Lower the bar down to the collarbone slowly as you inhale.","Lift the bar back up to the starting position as you exhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"122":{"Name":"Seated Barbell Twist","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["abdominals"],"SecondaryMuscles":[],"Instructions":["Start out by sitting at the end of a flat bench with a barbell placed on top of your thighs. Your feet should be shoulder width apart from each other.","Grip the bar with your palms facing down and make sure your hands are wider than shoulder width apart from each other. Begin to lift the barbell up over your head until your arms are fully extended.","Now lower the barbell behind your head until it is resting along the base of your neck. This is the starting position.","While keeping your feet and head stationary, move your waist from side to side so that your oblique muscles feel the contraction. Only move from side to side as far as your waist will allow you to go. Stretching or moving too far can cause an injury to occur. Tip: Use a slow and controlled motion.","Remember to breathe out while twisting your body to the side and in when moving back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"123":{"Name":"Seated Close-Grip Concentration Barbell Curl","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Sit down on a flat bench with a barbell or E-Z Bar in front of you in between your legs. Your legs should be spread with the knees bent and the feet on the floor.","Use your arms to pick the barbell up and place the back of your upper arms on top of your inner thighs (around three and a half inches away from the front of the knee). A supinated grip closer than shoulder width is needed to perform this exercise. Tip: Your arm should be extended at arms length and the barbell should be above the floor. This will be your starting position.","While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the biceps.","Slowly begin to bring the barbell back to starting position as your breathe in. Tip: Avoid swinging motions at any time.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"124":{"Name":"Seated Good Mornings","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["lower back"],"SecondaryMuscles":["glutes"],"Instructions":["Set up a box in a power rack. The pins should be set at an appropriate height. Begin by stepping under the bar and placing it across the back of the shoulders, not on top of your traps. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders.","Remove the bar from the rack, creating a tight arch in your lower back. Keep your head facing forward. With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips until you are seated on the box. This will be your starting position.","Keeping the bar tight, bend forward at the hips as much as possible. If you set the pins to what would be parallel, you not only have a safety if you fail, but know when to stop.","Pause just above the pins and reverse the motion until your torso it upright."],"Category":"powerlifting"},"125":{"Name":"Seated Palm-Up Barbell Wrist Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["forearms"],"SecondaryMuscles":[],"Instructions":["Hold a barbell with both hands and your palms facing up; hands spaced about shoulder width.","Place your feet flat on the floor, at a distance that is slightly wider than shoulder width apart.","Lean forward and place your forearms on top of your upper thighs with your palms up. Tip: Make sure that the front of the wrists lay on top of your knees. This will be your starting position.","Lower the bar as far as possible while inhaling and keeping a tight grip.","Now curl bar up as high as possible while flexing the forearms and exhaling. Hold the contraction at the top for a second and Tip: Only the wrist should move."],"Category":"strength"},"126":{"Name":"Seated Palms-Down Barbell Wrist Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["forearms"],"SecondaryMuscles":[],"Instructions":["Hold a barbell with both hands and your palms facing down; hands spaced about shoulder width.","Place your feet flat on the floor, at a distance that is slightly wider than shoulder width apart.","Lean forward and place your forearms on top of your upper thighs with your palms down. Tip: Make sure that the back of the wrists lay on top of your knees. This will be your starting position.","Lower the bar as far as possible while inhaling and keeping a tight grip.","Now curl bar up as high as possible while flexing the forearms and exhaling. Hold the contraction at the top for a second and Tip: Only the wrist should move."],"Category":"strength"},"127":{"Name":"Single-Arm Linear Jammer","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["chest","triceps"],"Instructions":["Position a bar into a landmine or securely anchor it in a corner. Load the bar to an appropriate weight.","Raise the bar from the floor, taking it to your shoulders with one or both hands. Adopt a wide stance. This will be your starting position.","Perform the movement by extending the elbow, pressing the weight up. Move explosively, extending the hips and knees fully to produce maximal force.","Return to the starting position."],"Category":"strength"},"128":{"Name":"Smith Incline Shoulder Raise","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["chest"],"Instructions":["Place an incline bench underneath the smith machine. Place the barbell at a height that you can reach when lying down and your arms are almost fully extended. Once the weight you need is selected, lie down on the incline bench and make sure your shoulders are aligned right under the barbell.","Using a shoulder width pronated (palms forward) grip, lift the bar from the rack and hold it straight over you with a slight bend at the elbows. This will be your starting position.","As you breathe out, lift the bar up until your arms are fully extended. Note: The contraction should be felt around the shoulders.","After a second pause, bring the bar back down to the starting position as you breathe in.","Repeat the movement for the prescribed amount of repetitions.","When you are done, place the bar back in the rack."],"Category":"strength"},"129":{"Name":"Snatch","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["biceps","glutes","hamstrings","lower back","shoulders","traps","triceps"],"Instructions":["Place your feet at a shoulder width stance with the barbell resting right above the connection between the toes and the rest of the foot.","With a palms facing down grip, bend at the knees and keeping the back flat grab the bar using a wider than shoulder width grip. Bring the hips down and make sure that your body drops as if you were going to sit on a chair. This will be your starting position.","Start pushing the floor as if it were a moving platform with your feet and simultaneously start lifting the barbell keeping it close to your legs.","As the bar reaches the middle of your thighs, push the floor with your legs and lift your body to a complete extension in an explosive motion.","Lift your shoulders back in a shrugging movement as you bring the bar up while lifting your elbows out to the side and keeping them above the bar for as long as possible.","Now in a very quick but powerful motion, you have to get your body under the barbell when it has reached a high enough point where it can be controlled and drop while locking your arms and holding the barbell overhead as you assume a squat position.","Finalize the movement by rising up out of the squat position to finish the lift. At the end of the lift both feet should be on line and the arms fully extended holding the barbell overhead."],"Category":"olympic weightlifting"},"130":{"Name":"Snatch Balance","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","shoulders","triceps"],"Instructions":["Begin with the feet in the pulling position, the bar racked across the back of the shoulders, and the hands placed in a wide snatch grip.","Pop the bar with an abrupt dip and drive of the knees, and aggressively drive under the bar, transitioning the feet into the receiving position.","Receive the bar locked out overhead near the bottom of the squat. The torso should remain vertical, lowering the hips between the legs.","Continue to descend to full depth, and return to a standing position. Carefully lower the weight."],"Category":"olympic weightlifting"},"131":{"Name":"Snatch Deadlift","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["forearms","glutes","hamstrings","lower back","quadriceps","traps"],"Instructions":["The snatch deadlift strengthens the first pull of the snatch. Begin with a wide snatch grip with the barbell placed on the platform. The feet should be directly under the hips, with the feet turned out. Squat down to the bar, keeping the back in absolute extension with the head facing forward.","Initiate the movement by driving through the heels, raising the hips. The back angle should remain the same until the bar passes the knees.","At that point, drive your hips through the bar as you lay back. Return the bar to the platform by reversing the motion."],"Category":"olympic weightlifting"},"132":{"Name":"Snatch Pull","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","glutes","lower back","quadriceps","traps"],"Instructions":["With a barbell on the floor close to the shins, take a wide snatch grip. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position.","Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight. Move the weight with control as you continue to above the knees.","Next comes the second pull, the main source of acceleration for the pull. As the bar approaches the mid-thigh position, begin extending through the hips. In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward.","There should be no need to actively pull through the arms to accelerate the weight; at the end of the second pull, the body should be fully extended, leaning slightly back. Full extension should be violent and abrupt, and ensure that you do not prolong the extension for longer than necessary."],"Category":"strength"},"133":{"Name":"Snatch Shrug","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["traps"],"SecondaryMuscles":["forearms","shoulders"],"Instructions":["Begin with a wide grip, with the bar hanging at the mid thigh position. You can use a hook or overhand grip. Your back should be straight and inclined slightly forward.","Shrug your shoulders towards your ears. While this exercise can usually by loaded with heavier weight than a snatch, avoid overloading to the point that the execution slows down."],"Category":"olympic weightlifting"},"134":{"Name":"Snatch from Blocks","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","forearms","glutes","hamstrings","lower back","shoulders","traps","triceps"],"Instructions":["Begin with a loaded barbell on boxes or stands of the desired height. A wide grip should be taken on the bar. The feet should be directly below the hips, with the feet turned out as needed. Lower the hips, with the chest up and the head looking forward. The shoulders should be just in front of the bar, with the elbows pointed out. This will be the starting position.","Begin the first pull by driving through the front of the heels, raising the bar from the boxes.","Transition into the second pull by extending through the hips knees and ankles, driving the bar up as quickly as possible. The bar should be close to the body. At peak extension, shrug the shoulders and allow the elbows to flex to the side.","As you move your feet into the receiving position, forcefully pull yourself below the bar as you elevate the bar overhead. The feet should move to just outside the hips, turned out as necessary. Receive the bar with your body as low as possible and the arms fully extended overhead.","Keeping the bar aligned over the front of the heels, your head and chest up, drive through heels of the feet to move to a standing position. Carefully return the weight to the boxes."],"Category":"olympic weightlifting"},"135":{"Name":"Speed Box Squat","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Attach bands to the bar that are securely anchored near the ground. You may need to choke the bands to get adequate tension.","Use a box of an appropriate height for this exercise. Load the bar to a weight that still requires effort, but isn't so heavy that speed is compromised. Typically, that will be between 50-70% of your one rep max.","Position the bar on your upper back, shoulder blades retracted, back arched and everything tight head to toe. This will be the starting position.","Unrack the bar and position yourself in front of the box. Sit back with your hips until you are seated on the box, ensuring that you descend under control and don't crash onto the surface.","Pause briefly, and explode off of the box, extending through the hips and knees."],"Category":"powerlifting"},"136":{"Name":"Speed Squats","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","lower back"],"Instructions":["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.","Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.","Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance which targets overall development; however you can choose any of the three stances discussed in the foot stances section).","Begin to lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to raise the bar as fast as possible without involving momentum as you exhale by pushing the floor with the heel of your foot mainly as you straighten the legs again and go back to the starting position. Note: You should perform these exercises as fast as possible but without breaking perfect form and without involving momentum.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"137":{"Name":"Split Clean","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","forearms","glutes","hamstrings","lower back","shoulders","traps"],"Instructions":["With a barbell on the floor close to the shins, take an overhand grip just outside the legs. Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar. This will be your starting position.","Begin the first pull by driving through the heels, extending your knees. Your back angle should stay the same, and your arms should remain straight. Move the weight with control as you continue to above the knees.","Next comes the second pull, the main source of acceleration for the clean. As the bar approaches the mid-thigh position, begin extending through the hips. In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward. There should be no need to actively pull through the arms to accelerate the weight; at the end of the second pull, the body should be fully extended, leaning slightly back, with the arms still extended.","As full extension is achieved, transition into the third pull by aggressively shrugging and flexing the arms with the elbows up and out. At peak extension, aggressively pull yourself down, rotating your elbows under the bar as you do so.","Receive the bar with the feet split, aggressively moving one foot forward and one foot back. The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed. Continue to descend to the bottom position, which will help in the recovery.","Immediately recover by driving through the heels, keeping the torso upright and elbows up. Bring the feet together as you stand up."],"Category":"olympic weightlifting"},"138":{"Name":"Split Jerk","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["glutes","hamstrings","shoulders","triceps"],"Instructions":["Standing with the weight racked on the front of the shoulders, begin with the dip. With your feet directly under your hips, flex the knees without moving the hips backward.","Go down only slightly, and reverse direction as powerfully as possible. Drive through the heels create as much speed and force as possible, and be sure to move your head out of the way as the bar leaves the shoulders. At this moment as the feet leave the floor, the feet must be placed into the receiving position as quickly as possible.","In the brief moment the feet are not actively driving against the platform, the athletes effort to push the bar up will drive them down. The feet should be moved to a split stance, one foot forward, one foot back, with the knees partially bent. Receive the bar with the arms locked out overhead.","Return to a standing position, bringing the feet together."],"Category":"olympic weightlifting"},"139":{"Name":"Split Snatch","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","forearms","glutes","hamstrings","lower back","quadriceps","shoulders","traps","triceps"],"Instructions":["Begin with a loaded barbell on the floor. The bar should be close to or touching the shins, and a wide grip should be taken on the bar. The feet should be directly below the hips, with the feet turned out as needed. Lower the hips, with the chest up and the head looking forward. The shoulders should be just in front of the bar. This will be the starting position.","Begin the first pull by driving through the front of the heels, raising the bar from the ground. The back angle should stay the same until the bar passes the knees.","Transition into the second pull by extending through the hips knees and ankles, driving the bar up as quickly as possible. The bar should be close to the body. At peak extension, shrug the shoulders and allow the elbows to flex to the side.","As you move your feet into the receiving position, forcefully pull yourself below the bar as you elevate the bar overhead. The feet should move forcefully to a split position, one foot forward one foot back. Receive the bar with your body as low as possible and the arms fully extended overhead.","Keeping the bar aligned over the front of the heels, your head and chest up, drive through heels of the feet to move to a standing position, bringing your feet together.","Carefully return the weight to floor."],"Category":"olympic weightlifting"},"140":{"Name":"Squat Jerk","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","shoulders","triceps"],"Instructions":["Standing with the weight racked on the front of the shoulders, begin with the dip. With your feet directly under your hips, flex the knees without moving the hips backward. Go down only slightly, and reverse direction as powerfully as possible. Drive through the heels create as much speed and force as possible, and be sure to move your head out of the way as the bar leaves the shoulders.","At this moment as the feet leave the floor, the feet must be placed into the receiving position as quickly as possible. In the brief moment the feet are not actively driving against the platform, the athletes effort to push the bar up will drive them down. The feet should move forcefully to just outside the hips, turned out as necessary. Receive the bar with your body in a full squat and the arms fully extended overhead.","Keeping the bar aligned over the front of the heels, your head and chest up, drive throught heels of the feet to move to a standing position. Carefully return the weight to floor."],"Category":"strength"},"141":{"Name":"Squat with Bands","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["adductors","calves","glutes","hamstrings","lower back"],"Instructions":["Set up the bands on the sleeves, secured to either band pegs, the rack, or dumbbells so that there is appropriate tension.","Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wide for more emphasis on the back, glutes, adductors, and hamstrings. Keep your head facing forward.","With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips as much as possible. Ideally, your shins should be perpendicular to the ground. Lower bar position necessitates a greater torso lean to keep the bar over the heels. Continue until you break parallel, which is defined as the crease of the hip being in line with the top of the knee.","Keeping the weight on your heels and pushing your feet and knees out, drive upward as you lead the movement with your head. Continue upward, maintaining tightness head to toe, until you have returned to the starting position."],"Category":"powerlifting"},"142":{"Name":"Squat with Chains","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["adductors","calves","glutes","hamstrings","lower back"],"Instructions":["To set up the chains, begin by looping the leader chain over the sleeves of the bar. The heavy chain should be attached using a snap hook. Adjust the length of the lead chain so that a few links are still on the floor at the top of the movement.","Begin by stepping under the bar and placing it across the back of the shoulders. Squeeze your shoulder blades together and rotate your elbows forward, attempting to bend the bar across your shoulders. Remove the bar from the rack, creating a tight arch in your lower back, and step back into position. Place your feet wide for more emphasis on the back, glutes, adductors, and hamstrings. Keep your head facing forward.","With your back, shoulders, and core tight, push your knees and butt out and you begin your descent. Sit back with your hips as much as possible. Ideally, your shins should be perpendicular to the ground. Lower bar position necessitates a greater torso lean to keep the bar over the heels. Continue until you break parallel, which is defined as the crease of the hip being in line with the top of the knee.","Keeping the weight on your heels and pushing your feet and knees out, drive upward as you lead the movement with your head. Continue upward, maintaining tightness head to toe, until you have returned to the starting position."],"Category":"powerlifting"},"143":{"Name":"Squat with Plate Movers","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","glutes","hamstrings"],"Instructions":["To begin, first set the bar on a rack to just below shoulder level. Position a weight plate on the ground a couple feet back from the rack. Once the bar is loaded, step under it and place the back of your shoulders across it.","Hold on to the bar with both hands and lift it off the rack by first pushing with your legs and at the same time straighten your torso.","Step away from the rack and adopt a wide stance with the toes slightly pointed out, with one foot on the weight plate. Keep your head up at all times. This will be your starting position.","Begin to slowly lower the bar by bending the knees and hips. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees.","Raise the bar as you exhale by pushing the floor with the heels of your feet as you extend the hips and knees.","At the top of the movement, side step, bringing your feet together on the opposite side of the plate.","Using your inside foot, push the weight plate, sliding it across the floor to where you were just standing.","Place your inside foot on the weight plate, adopting a wide stance for the next repetition."],"Category":"strength"},"144":{"Name":"Standing Barbell Calf Raise","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["calves"],"SecondaryMuscles":[],"Instructions":["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the bar on the back of your shoulders (slightly below the neck).","Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.","Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. The knees should be kept with a slight bend; never locked. This will be your starting position. Tip: For better range of motion you may also place the ball of your feet on a wooden block but be careful as this option requires more balance and a sturdy block.","Raise your heels as you breathe out by extending your ankles as high as possible and flexing your calf. Ensure that the knee is kept stationary at all times. There should be no bending at any time. Hold the contracted position by a second before you start to go back down.","Go back slowly to the starting position as you breathe in by lowering your heels as you bend the ankles until calves are stretched.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"145":{"Name":"Standing Barbell Press Behind Neck","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["This exercise is best performed inside a squat rack for easier pick up of the bar. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.","Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.","Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Your back should be kept straight while performing this exercise. This will be your starting position.","Elevate the barbell overhead by fully extending your arms while breathing out.","Hold the contraction for a second and lower the barbell back down to the starting position by inhaling.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"146":{"Name":"Standing Bradford Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Place a loaded bar at shoulder level in a rack. With a pronated grip at shoulder width, begin with the bar racked across the front of your shoulders. This is your starting position.","Initiate the lift by extending the elbows to press the bar overhead. Avoid locking out the elbow as you move the weight behind your head.","Lower the bar down to the back of the head until your elbow forms a right angle.","Lift the bar back over your head by extending the elbows","Lower the bar down to the starting position.","Alternate in this manner until you complete the recommended amount of repetitions."],"Category":"strength"},"147":{"Name":"Standing Front Barbell Raise Over Head","Force":"push","Level":"intermediate","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["To begin, stand straight with a barbell in your hands. You should grip the bar with palms facing down and a closer than shoulder width grip apart from each other.","Your feet should be shoulder width apart from each other. Your elbows should be slightly bent. This is the starting position.","Lift the barbell up until it is directly over your head while exhaling. Make sure to keep your elbows slightly bent when performing each repetition.","Once you feel the contraction, begin to lower the barbell back down to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"148":{"Name":"Standing Military Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Start by placing a barbell that is about chest high on a squat rack. Once you have selected the weights, grab the barbell using a pronated (palms facing forward) grip. Make sure to grip the bar wider than shoulder width apart from each other.","Slightly bend the knees and place the barbell on your collar bone. Lift the barbell up keeping it lying on your chest. Take a step back and position your feet shoulder width apart from each other.","Once you pick up the barbell with the correct grip length, lift the bar up over your head by locking your arms. Hold at about shoulder level and slightly in front of your head. This is your starting position.","Lower the bar down to the collarbone slowly as you inhale.","Lift the bar back up to the starting position as you exhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"149":{"Name":"Standing Overhead Barbell Triceps Extension","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["shoulders"],"Instructions":["To begin, stand up holding a barbell or e-z bar using a pronated grip (palms facing forward) with your hands closer than shoulder width apart from each other. Your feet should be about shoulder width apart.","Now elevate the barbell above your head until your arms are fully extended. Keep your elbows in. This will be your starting position.","Keeping your upper arms close to your head and elbows in, perpendicular to the floor, lower the resistance in a semicircular motion behind your head until your forearms touch your biceps. Tip: The upper arms should remain stationary and only the forearms should move. Breathe in as you perform this step.","Go back to the starting position by using the triceps to raise the barbell. Breathe out as you perform this step.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"150":{"Name":"Standing Palms-Up Barbell Behind The Back Wrist Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["forearms"],"SecondaryMuscles":[],"Instructions":["Start by standing straight and holding a barbell behind your glutes at arm's length while using a pronated grip (palms will be facing back away from the glutes) and having your hands shoulder width apart from each other.","You should be looking straight forward while your feet are shoulder width apart from each other. This is the starting position.","While exhaling, slowly elevate the barbell up by curling your wrist in a semi-circular motion towards the ceiling. Note: Your wrist should be the only body part moving for this exercise.","Hold the contraction for a second and lower the barbell back down to the starting position while inhaling.","Repeat for the recommended amount of repetitions.","When finished, lower the barbell down to the squat rack or the floor by bending the knees. Tip: It is easiest to either pick it up from a squat rack or have a partner hand it to you."],"Category":"strength"},"151":{"Name":"Stiff-Legged Barbell Deadlift","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["glutes","lower back"],"Instructions":["Grasp a bar using an overhand grip (palms facing down). You may need some wrist wraps if using a significant amount of weight.","Stand with your torso straight and your legs spaced using a shoulder width or narrower stance. The knees should be slightly bent. This is your starting position.","Keeping the knees stationary, lower the barbell to over the top of your feet by bending at the hips while keeping your back straight. Keep moving forward as if you were going to pick something from the floor until you feel a stretch on the hamstrings. Inhale as you perform this movement.","Start bringing your torso up straight again by extending your hips until you are back at the starting position. Exhale as you perform this movement.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"152":{"Name":"Stiff Leg Barbell Good Morning","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["lower back"],"SecondaryMuscles":["glutes","hamstrings"],"Instructions":["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.","Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.","Step away from the rack and position your legs using a shoulder width medium stance. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position.","Keeping your legs stationary, move your torso forward by bending at the hips while inhaling. Lower your torso until it is parallel with the floor.","Begin to raise the bar as you exhale by elevating your torso back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"153":{"Name":"Straight Bar Bench Mid Rows","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Place a loaded barbell on the end of a bench. Standing on the bench behind the bar, take a medium, pronated grip. Stand with your hips back and chest up, maintaining a neutral spine. This will be your starting position.","Row the bar to your torso by retracting the shoulder blades and flexing the elbows. Use a controlled movement with no jerking.","After a brief pause, slowly return the bar to the starting position, ensuring to go all the way down."],"Category":"strength"},"154":{"Name":"Straight Raises on Incline Bench","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["traps"],"Instructions":["Place a bar on the ground behind the head of an incline bench.","Lay on the bench face down. With a pronated grip, pick the barbell up from the floor, keeping your arms straight. Allow the bar to hang straight down. This will be your starting position.","To begin, raise the barbell out in front of your head while keeping your arms extended.","Return to the starting position."],"Category":"strength"},"155":{"Name":"Sumo Deadlift","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["adductors","forearms","glutes","lower back","middle back","quadriceps","traps"],"Instructions":["Begin with a bar loaded on the ground. Approach the bar so that the bar intersects the middle of the feet. The feet should be set very wide, near the collars. Bend at the hips to grip the bar. The arms should be directly below the shoulders, inside the legs, and you can use a pronated grip, a mixed grip, or hook grip. Relax the shoulders, which in effect lengthens your arms.","Take a breath, and then lower your hips, looking forward with your head with your chest up. Drive through the floor, spreading your feet apart, with your weight on the back half of your feet. Extend through the hips and knees.","As the bar passes through the knees, lean back and drive the hips into the bar, pulling your shoulder blades together.","Return the weight to the ground by bending at the hips and controlling the weight on the way down."],"Category":"powerlifting"},"156":{"Name":"Sumo Deadlift with Bands","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["adductors","forearms","glutes","lower back","middle back","quadriceps","traps"],"Instructions":["To deadlift with short bands, simply loop them over the bar before you start, and step into them to set up. Ensure that they under the back half of your foot, directly where you are driving into the floor.","Begin with a bar loaded on the ground. Approach the bar so that the bar intersects the middle of the feet. The feet should be set very wide, near the collars. Bend at the hips to grip the bar. The arms should be directly below the shoulders, inside the legs, and you can use a pronated grip, a mixed grip, or hook grip.","Take a breath, and then lower your hips, looking forward with your head with your chest up. Drive through the floor, spreading your feet apart, with your weight on the back half of your feet. Extend through the hips and knees.","As the bar passes through the knees, lean back and drive the hips into the bar, pulling your shoulder blades together.","Return the weight to the ground by bending at the hips and controlling the weight on the way down."],"Category":"powerlifting"},"157":{"Name":"Sumo Deadlift with Chains","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abductors","adductors","forearms","glutes","lower back","middle back","quadriceps","traps"],"Instructions":["You can attach the chains to the sleeves of the bar, or just drape the middle over the bar so there is a greater weight increase as you lift. Attempt to keep the ends of the chains away from the plates so you don't hit them when you lower the weight.","Begin with a bar loaded on the ground. Approach the bar so that the bar intersects the middle of the feet. The feet should be set very wide, near the collars. Bend at the hips to grip the bar. The arms should be directly below the shoulders, inside the legs, and you can use a pronated grip, a mixed grip, or hook grip. Relax the shoulders, which in effect lengthens your arms.","Take a breath, and then lower your hips, looking forward with your head with your chest up. Drive through the floor, spreading your feet apart, with your weight on the back half of your feet. Extend through the hips and knees.","As the bar passes through the knees, lean back and drive the hips into the bar, pulling your shoulder blades together.","Return the weight to the ground by bending at the hips and controlling the weight on the way down."],"Category":"powerlifting"},"158":{"Name":"T-Bar Row with Handle","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Position a bar into a landmine or in a corner to keep it from moving. Load an appropriate weight onto your end.","Stand over the bar, and position a Double D row handle around the bar next to the collar. Using your hips and legs, rise to a standing position.","Assume a wide stance with your hips back and your chest up. Your arms should be extended. This will be your starting position.","Pull the weight to your upper abdomen by retracting the shoulder blades and flexing the elbows. Do not jerk the weight or cheat during the movement.","After a brief pause, return to the starting position."],"Category":"strength"},"159":{"Name":"Upright Barbell Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["traps"],"Instructions":["Grasp a barbell with an overhand grip that is slightly less than shoulder width. The bar should be resting on the top of your thighs with your arms extended and a slight bend in your elbows. Your back should also be straight. This will be your starting position.","Now exhale and use the sides of your shoulders to lift the bar, raising your elbows up and to the side. Keep the bar close to your body as you raise it. Continue to lift the bar until it nearly touches your chin. Tip: Your elbows should drive the motion, and should always be higher than your forearms. Remember to keep your torso stationary and pause for a second at the top of the movement.","Lower the bar back down slowly to the starting position. Inhale as you perform this portion of the movement.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"160":{"Name":"Weighted Jump Squat","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","lower back"],"Instructions":["Position a lightly loaded barbell across the back of your shoulders. You could also use a weighted vest, sandbag, or other type of resistance for this exercise.","The weight should be light enough that it doesn't slow you down significantly. Your feet should be just outside of shoulder width with your head and chest up. This will be your starting position.","Using a countermovement, squat partially down and immediately reverse your direction to explode off of the ground, extending through your hips, knees, and ankles. Maintain good posture throughout the jump.","As you return to the ground, absorb the impact through your legs."],"Category":"strength"},"161":{"Name":"Weighted Sissy Squat","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Standing upright, with feet at shoulder width and toes raised, use one hand to hold onto the beams of a squat rack and the opposite arm to hold a plate on top of your chest. This is your starting position.","As you use one arm to hold yourself, bend at the knees and slowly lower your torso toward the ground by bringing your pelvis and knees forward. Inhale as you go down and stop when your upper and lower legs almost create a 90-degree angle. Hold the stretch position for a second.","After your one second hold, use your thigh muscles to bring your torso back up to the starting position. Exhale as you move up.","Repeat for the recommended amount of times."],"Category":"strength"},"162":{"Name":"Wide-Grip Barbell Bench Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Lie back on a flat bench with feet firm on the floor. Using a wide, pronated (palms forward) grip that is around 3 inches away from shoulder width (for each hand), lift the bar from the rack and hold it straight over you with your arms locked. The bar will be perpendicular to the torso and the floor. This will be your starting position.","As you breathe in, come down slowly until you feel the bar on your middle chest.","After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up.","Repeat the movement for the prescribed amount of repetitions."],"Category":"strength"},"163":{"Name":"Wide-Grip Decline Barbell Bench Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Lie back on a decline bench with the feet securely locked at the front of the bench. Using a wide, pronated (palms forward) grip that is around 3 inches away from shoulder width (for each hand), lift the bar from the rack and hold it straight over you with your arms locked. The bar will be perpendicular to the torso and the floor. This will be your starting position.","As you breathe in, come down slowly until you feel the bar on your lower chest.","After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms and squeeze your chest in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up.","Repeat the movement for the prescribed amount of repetitions."],"Category":"strength"},"164":{"Name":"Wide-Grip Decline Barbell Pullover","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Lie down on a decline bench with both legs securely locked in position. Reach for the barbell behind the head using a pronated grip (palms facing out). Make sure to grab the barbell wider than shoulder width apart for this exercise. Slowly lift the barbell up from the floor by using your arms.","When positioned properly, your arms should be fully extended and perpendicular to the floor. This is the starting position.","Begin by moving the barbell back down in a semicircular motion as if you were going to place it on the floor, but instead, stop when the arms are parallel to the floor. Tip: Keep the arms fully extended at all times. The movement should only happen at the shoulder joint. Inhale as you perform this portion of the movement.","Now bring the barbell up while exhaling until you are back at the starting position. Remember to keep full control of the barbell at all times.","Repeat the movement for the prescribed amount of repetitions of your training program.","When finished with your set, slowly lower the barbell back down until it is level with your head and release it."],"Category":"strength"},"165":{"Name":"Wide-Grip Standing Barbell Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Stand up with your torso upright while holding a barbell at the wide outer handle. The palm of your hands should be facing forward. The elbows should be close to the torso. This will be your starting position.","While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out. Tip: Only the forearms should move.","Continue the movement until your biceps are fully contracted and the bar is at shoulder level. Hold the contracted position for a second and squeeze the biceps hard.","Slowly begin to bring the bar back to starting position as your breathe in.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"166":{"Name":"Wide Stance Barbell Squat","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","lower back"],"Instructions":["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.","Hold on to the bar using both arms at each side and lift it off the rack by first pushing with your legs and at the same time straightening your torso.","Step away from the rack and position your legs using a wider-than-shoulder-width stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance, and also maintain a straight back. This will be your starting position.","Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to raise the bar as you exhale by pushing the floor with the heel of your foot as you straighten the legs again and go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"167":{"Name":"Wide Stance Stiff Legs","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["adductors","glutes","lower back"],"Instructions":["Begin with a barbell loaded on the floor. Adopt a wide stance, and then bend at the hips to grab the bar. Your hips should be as far back as possible, and your legs nearly straight. Keep your back straight, and your head and chest up. This will be your starting position.","Begin the movement be engaging the hips, driving them forward as you allow the arms to hang straight. Continue until you are standing straight up, and then slowly return the weight to the starting position. For successive reps, the weight need not touch the floor."],"Category":"olympic weightlifting"},"168":{"Name":"Wrist Rotations with Straight Bar","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"barbell","PrimaryMuscles":["forearms"],"SecondaryMuscles":[],"Instructions":["Hold a barbell with both hands and your palms facing down; hands spaced about shoulder width. This will be your starting position.","Alternating between each of your hands, perform the movement by extending the wrist as though you were rolling up a newspaper. Continue alternating back and forth until failure.","Reverse the motion by flexing the wrist, rolling the opposite direction. Continue the alternating motion until failure."],"Category":"strength"},"169":{"Name":"Zercher Squats","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"barbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["This exercise is best performed inside a squat rack for safety purposes. To begin, first set the bar on a rack that best matches your height. The correct height should be anywhere above the waist but below the chest. Once the correct height is chosen and the bar is loaded, lock your hands together and place the bar on top of your arms in between the forearm and upper arm.","Lift the bar up so that it is resting on top of your forearms. If you are holding the bar properly, it should look as if you have your arms crossed but with a bar running across them.","Step away from the rack and position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section).","Begin to lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to raise the bar as you exhale by pushing the floor with the ball of your foot mainly as you straighten the legs again and go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"}}