{"0":{"Name":"Alternate Hammer Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":["forearms"],"Instructions":["Stand up with your torso upright and a dumbbell in each hand being held at arms length. The elbows should be close to the torso.","The palms of the hands should be facing your torso. This will be your starting position.","While holding the upper arm stationary, curl the right weight forward while contracting the biceps as you breathe out. Continue the movement until your biceps is fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the biceps. Tip: Only the forearms should move.","Slowly begin to bring the dumbbells back to starting position as your breathe in.","Repeat the movement with the left hand. This equals one repetition.","Continue alternating in this manner for the recommended amount of repetitions."],"Category":"strength"},"1":{"Name":"Alternate Incline Dumbbell Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":["forearms"],"Instructions":["Sit down on an incline bench with a dumbbell in each hand being held at arms length. Tip: Keep the elbows close to the torso.This will be your starting position.","While holding the upper arm stationary, curl the right weight forward while contracting the biceps as you breathe out. As you do so, rotate the hand so that the palm is facing up. Continue the movement until your biceps is fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the biceps. Tip: Only the forearms should move.","Slowly begin to bring the dumbbell back to starting position as your breathe in.","Repeat the movement with the left hand. This equals one repetition.","Continue alternating in this manner for the recommended amount of repetitions."],"Category":"strength"},"2":{"Name":"Alternating Deltoid Raise","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["In a standing position, hold a pair of dumbbells at your side.","Keeping your elbows slightly bent, raise the weights directly in front of you to shoulder height, avoiding any swinging or cheating.","Return the weights to your side.","On the next repetition, raise the weights laterally, raising them out to your side to about shoulder height.","Return the weights to the starting position and continue alternating to the front and side."],"Category":"strength"},"3":{"Name":"Arnold Dumbbell Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Sit on an exercise bench with back support and hold two dumbbells in front of you at about upper chest level with your palms facing your body and your elbows bent. Tip: Your arms should be next to your torso. The starting position should look like the contracted portion of a dumbbell curl.","Now to perform the movement, raise the dumbbells as you rotate the palms of your hands until they are facing forward.","Continue lifting the dumbbells until your arms are extended above you in straight arm position. Breathe out as you perform this portion of the movement.","After a second pause at the top, begin to lower the dumbbells to the original position by rotating the palms of your hands towards you. Tip: The left arm will be rotated in a counter clockwise manner while the right one will be rotated clockwise. Breathe in as you perform this portion of the movement.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"4":{"Name":"Around The Worlds","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders"],"Instructions":["Lay down on a flat bench holding a dumbbell in each hand with the palms of the hands facing towards the ceiling. Tip: Your arms should be parallel to the floor and next to your thighs. To avoid injury, make sure that you keep your elbows slightly bent. This will be your starting position.","Now move the dumbbells by creating a semi-circle as you displace them from the initial position to over the head. All of the movement should happen with the arms parallel to the floor at all times. Breathe in as you perform this portion of the movement.","Reverse the movement to return the weight to the starting position as you exhale."],"Category":"strength"},"5":{"Name":"Bent-Arm Dumbbell Pullover","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["lats","shoulders","triceps"],"Instructions":["Place a dumbbell standing up on a flat bench.","Ensuring that the dumbbell stays securely placed at the top of the bench, lie perpendicular to the bench (torso across it as in forming a cross) with only your shoulders lying on the surface. Hips should be below the bench and legs bent with feet firmly on the floor. The head will be off the bench as well.","Grasp the dumbbell with both hands and hold it straight over your chest with a bend in your arms. Both palms should be pressing against the underside one of the sides of the dumbbell. This will be your starting position. Caution: Always ensure that the dumbbell used for this exercise is secure. Using a dumbbell with loose plates can result in the dumbbell falling apart and falling on your face.","While keeping your arms locked in the bent arm position, lower the weight slowly in an arc behind your head while breathing in until you feel a stretch on the chest.","At that point, bring the dumbbell back to the starting position using the arc through which the weight was lowered and exhale as you perform this movement.","Hold the weight on the initial position for a second and repeat the motion for the prescribed number of repetitions."],"Category":"strength"},"6":{"Name":"Bent Over Dumbbell Rear Delt Raise With Head On Bench","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["Stand up straight while holding a dumbbell in each hand and with an incline bench in front of you.","While keeping your back straight and maintaining the natural arch of your back, lean forward until your forehead touches the bench in front of you. Let the arms hang in front of you perpendicular to the ground. The palms of your hands should be facing each other and your torso should be parallel to the floor. This will be your starting position.","Keeping your torso forward and stationary, and the arms straight with a slight bend at the elbows, lift the dumbbells straight to the side until both arms are parallel to the floor. Exhale as you lift the weights. Caution: avoid swinging the torso or bringing the arms back as opposed to the side.","After a one second contraction at the top, slowly lower the dumbbells back to the starting position.","Repeat the recommended amount of repetitions."],"Category":"strength"},"7":{"Name":"Bent Over Two-Dumbbell Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats","shoulders"],"Instructions":["With a dumbbell in each hand (palms facing your torso), bend your knees slightly and bring your torso forward by bending at the waist; as you bend make sure to keep your back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The weights should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.","While keeping the torso stationary, lift the dumbbells to your side (as you breathe out), keeping the elbows close to the body (do not exert any force with the forearm other than holding the weights). On the top contracted position, squeeze the back muscles and hold for a second.","Slowly lower the weight again to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"8":{"Name":"Bent Over Two-Dumbbell Row With Palms In","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["With a dumbbell in each hand (palms facing each other), bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up. The weights should hang directly in front of you as your arms hang perpendicular to the floor and your torso. This is your starting position.","While keeping the torso stationary, lift the dumbbells to your side as you breathe out, squeezing your shoulder blades together. On the top contracted position, squeeze the back muscles and hold for a second.","Slowly lower the weight again to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"9":{"Name":"Calf Raise On A Dumbbell","Force":"push","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["calves"],"SecondaryMuscles":[],"Instructions":["Hang on to a sturdy object for balance and stand on a dumbbell handle, preferably one with round plates so that it rolls as in this manner you have to work harder to stabilize yourself; thus increasing the effectiveness of the exercise.","Now roll your foot slightly forward so that you can get a nice stretch of the calf. This will be your starting position.","Lift the calf as you roll your foot over the top of the handle so that you get a full extension. Exhale during the execution of this movement. Contract the calf hard at the top and hold for a second. Tip: As you come up, roll the dumbbell slightly backward.","Now inhale as you roll the dumbbell slightly forward as you come down to get a better stretch.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"10":{"Name":"Close-Grip Dumbbell Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["Place a dumbbell standing up on a flat bench.","Ensuring that the dumbbell stays securely placed at the top of the bench, lie perpendicular to the bench with only your shoulders lying on the surface. Hips should be below the bench and your legs bent with your feet firmly on the floor.","Grasp the dumbbell with both hands and hold it straight over your chest at arm’s length. Both palms should be pressing against the underside of the sides of the dumbbell. This will be your starting position.","Initiate the movement by lowering the dumbbell to your chest.","Return to the starting position by extending the elbows."],"Category":"strength"},"11":{"Name":"Concentration Curls","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":["forearms"],"Instructions":["Sit down on a flat bench with one dumbbell in front of you between your legs. Your legs should be spread with your knees bent and feet on the floor.","Use your right arm to pick the dumbbell up. Place the back of your right upper arm on the top of your inner right thigh. Rotate the palm of your hand until it is facing forward away from your thigh. Tip: Your arm should be extended and the dumbbell should be above the floor. This will be your starting position.","While holding the upper arm stationary, curl the weights forward while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Tip: At the top of the movement make sure that the little finger of your arm is higher than your thumb. This guarantees a good contraction. Hold the contracted position for a second as you squeeze the biceps.","Slowly begin to bring the dumbbells back to starting position as your breathe in. Caution: Avoid swinging motions at any time.","Repeat for the recommended amount of repetitions. Then repeat the movement with the left arm."],"Category":"strength"},"12":{"Name":"Cross Body Hammer Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":["forearms"],"Instructions":["Stand up straight with a dumbbell in each hand. Your hands should be down at your side with your palms facing in.","While keeping your palms facing in and without twisting your arm, curl the dumbbell of the right arm up towards your left shoulder as you exhale. Touch the top of the dumbbell to your shoulder and hold the contraction for a second.","Slowly lower the dumbbell along the same path as you inhale and then repeat the same movement for the left arm.","Continue alternating in this fashion until the recommended amount of repetitions is performed for each arm."],"Category":"strength"},"13":{"Name":"Cuban Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["traps"],"Instructions":["Take a dumbbell in each hand with a pronated grip in a standing position. Raise your upper arms so that they are parallel to the floor, allowing your lower arms to hang in the \"scarecrow\" position. This will be your starting position.","To initiate the movement, externally rotate the shoulders to move the upper arm 180 degrees. Keep the upper arms in place, rotating the upper arms until the wrists are directly above the elbows, the forearms perpendicular to the floor.","Now press the dumbbells by extending at the elbows, straightening your arms overhead.","Return to the starting position as you breathe in by reversing the steps.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"14":{"Name":"Decline Dumbbell Bench Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Secure your legs at the end of the decline bench and lie down with a dumbbell on each hand on top of your thighs. The palms of your hand will be facing each other.","Once you are laying down, move the dumbbells in front of you at shoulder width.","Once at shoulder width, rotate your wrists forward so that the palms of your hands are facing away from you. This will be your starting position.","Bring down the weights slowly to your side as you breathe out. Keep full control of the dumbbells at all times. Tip: Throughout the motion, the forearms should always be perpendicular to the floor.","As you breathe out, push the dumbbells up using your pectoral muscles. Lock your arms in the contracted position, squeeze your chest, hold for a second and then start coming down slowly. Tip: It should take at least twice as long to go down than to come up..","Repeat the movement for the prescribed amount of repetitions of your training program."],"Category":"strength"},"15":{"Name":"Decline Dumbbell Flyes","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["chest"],"SecondaryMuscles":[],"Instructions":["Secure your legs at the end of the decline bench and lie down with a dumbbell on each hand on top of your thighs. The palms of your hand will be facing each other.","Once you are laying down, move the dumbbells in front of you at shoulder width. The palms of the hands should be facing each other and the arms should be perpendicular to the floor and fully extended. This will be your starting position.","With a slight bend on your elbows in order to prevent stress at the biceps tendon, lower your arms out at both sides in a wide arc until you feel a stretch on your chest. Breathe in as you perform this portion of the movement. Tip: Keep in mind that throughout the movement, the arms should remain stationary; the movement should only occur at the shoulder joint.","Return your arms back to the starting position as you squeeze your chest muscles and breathe out. Tip: Make sure to use the same arc of motion used to lower the weights.","Hold for a second at the contracted position and repeat the movement for the prescribed amount of repetitions."],"Category":"strength"},"16":{"Name":"Decline Dumbbell Triceps Extension","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":[],"Instructions":["Secure your legs at the end of the decline bench and lie down with a dumbbell on each hand on top of your thighs. The palms of your hand will be facing each other.","Once you are laying down, move the dumbbells in front of you at shoulder width. The palms of the hands should be facing each other and the arms should be perpendicular to the floor and fully extended. This will be your starting position.","As you breathe in and you keep the upper arms stationary (and elbows in), bring the dumbbells down slowly by moving your forearms in a semicircular motion towards you until your thumbs are next to your ears. Breathe in as you perform this portion of the movement.","Lift the dumbbells back to the starting position by contracting the triceps and exhaling.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"17":{"Name":"Dumbbell Alternate Bicep Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":["forearms"],"Instructions":["Stand (torso upright) with a dumbbell in each hand held at arms length. The elbows should be close to the torso and the palms of your hand should be facing your thighs.","While holding the upper arm stationary, curl the right weight as you rotate the palm of the hands until they are facing forward. At this point continue contracting the biceps as you breathe out until your biceps is fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the biceps. Tip: Only the forearms should move.","Slowly begin to bring the dumbbell back to the starting position as your breathe in. Tip: Remember to twist the palms back to the starting position (facing your thighs) as you come down.","Repeat the movement with the left hand. This equals one repetition.","Continue alternating in this manner for the recommended amount of repetitions."],"Category":"strength"},"18":{"Name":"Dumbbell Bench Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Lie down on a flat bench with a dumbbell in each hand resting on top of your thighs. The palms of your hands will be facing each other.","Then, using your thighs to help raise the dumbbells up, lift the dumbbells one at a time so that you can hold them in front of you at shoulder width.","Once at shoulder width, rotate your wrists forward so that the palms of your hands are facing away from you. The dumbbells should be just to the sides of your chest, with your upper arm and forearm creating a 90 degree angle. Be sure to maintain full control of the dumbbells at all times. This will be your starting position.","Then, as you breathe out, use your chest to push the dumbbells up. Lock your arms at the top of the lift and squeeze your chest, hold for a second and then begin coming down slowly. Tip: Ideally, lowering the weight should take about twice as long as raising it.","Repeat the movement for the prescribed amount of repetitions of your training program."],"Category":"strength"},"19":{"Name":"Dumbbell Bench Press with Neutral Grip","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Take a dumbbell in each hand and lay back onto a flat bench. Your feet should be flat on the floor and your shoulder blades retracted.","Maintaining a neutral grip, palms facing each other, begin with your arms extended directly above you, perpendicular to the floor. This will be your starting position.","Begin the movement by flexing the elbow, lowering the upper arms to the side. Descend until the dumbbells are to your torso.","Pause, then extend the elbow and return to the starting position."],"Category":"strength"},"20":{"Name":"Dumbbell Bicep Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":["forearms"],"Instructions":["Stand up straight with a dumbbell in each hand at arm's length. Keep your elbows close to your torso and rotate the palms of your hands until they are facing forward. This will be your starting position.","Now, keeping the upper arms stationary, exhale and curl the weights while contracting your biceps. Continue to raise the weights until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a brief pause as you squeeze your biceps.","Then, inhale and slowly begin to lower the dumbbells back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"21":{"Name":"Dumbbell Clean","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","forearms","glutes","lower back","quadriceps","shoulders","traps"],"Instructions":["Begin standing with a dumbbell in each hand with your feet shoulder width apart.","Lower the weights to the floor by flexing at the hips and knees, pushing your hips back until the dumbbells reach the floor. This will be your starting position.","To initiate the movement, violently jump upward by extending the hips, knees, and ankles to acclerate the weights upward. Maintaining a neutral grip on the dumbbells, keep the arms straight until full extension is reached.","After full extension, rebend the hips and knees to receive the weight in a squat position. Allow the arms to bend, guiding the dumbbells to your shoulders.","Upon receiving the weight in the squat position, extend the hips and knees to finish in a standing position with the weights on your shoulders."],"Category":"strength"},"22":{"Name":"Dumbbell Floor Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["Lay on the floor holding dumbbells in your hands. Your knees can be bent. Begin with the weights fully extended above you.","Lower the weights until your upper arm comes in contact with the floor. You can tuck your elbows to emphasize triceps size and strength, or to focus on your chest angle your arms to the side.","Pause at the bottom, and then bring the weight together at the top by extending through the elbows."],"Category":"powerlifting"},"23":{"Name":"Dumbbell Flyes","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["chest"],"SecondaryMuscles":[],"Instructions":["Lie down on a flat bench with a dumbbell on each hand resting on top of your thighs. The palms of your hand will be facing each other.","Then using your thighs to help raise the dumbbells, lift the dumbbells one at a time so you can hold them in front of you at shoulder width with the palms of your hands facing each other. Raise the dumbbells up like you're pressing them, but stop and hold just before you lock out. This will be your starting position.","With a slight bend on your elbows in order to prevent stress at the biceps tendon, lower your arms out at both sides in a wide arc until you feel a stretch on your chest. Breathe in as you perform this portion of the movement. Tip: Keep in mind that throughout the movement, the arms should remain stationary; the movement should only occur at the shoulder joint.","Return your arms back to the starting position as you squeeze your chest muscles and breathe out. Tip: Make sure to use the same arc of motion used to lower the weights.","Hold for a second at the contracted position and repeat the movement for the prescribed amount of repetitions."],"Category":"strength"},"24":{"Name":"Dumbbell Incline Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","forearms","lats","shoulders"],"Instructions":["Using a neutral grip, lean into an incline bench.","Take a dumbbell in each hand with a neutral grip, beginning with the arms straight. This will be your starting position.","Retract the shoulder blades and flex the elbows to row the dumbbells to your side.","Pause at the top of the motion, and then return to the starting position."],"Category":"strength"},"25":{"Name":"Dumbbell Incline Shoulder Raise","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Sit on an Incline Bench while holding a dumbbell on each hand on top of your thighs.","Lift your legs up to kick the weights to your shoulders and lean back. Position the dumbbells above your shoulders with your arms extended. The arms should be perpendicular to the floor with your palms facing forward and knuckles pointing towards the ceiling. This will be your starting position.","While keeping the arms straight and locked, lift the dumbbells by raising the shoulders from the bench as you breathe out.","Bring back the dumbbells to the starting position as you breathe in.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"26":{"Name":"Dumbbell Lunges","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Stand with your torso upright holding two dumbbells in your hands by your sides. This will be your starting position.","Step forward with your right leg around 2 feet or so from the foot being left stationary behind and lower your upper body down, while keeping the torso upright and maintaining balance. Inhale as you go down. Note: As in the other exercises, do not allow your knee to go forward beyond your toes as you come down, as this will put undue stress on the knee joint. Make sure that you keep your front shin perpendicular to the ground.","Using mainly the heel of your foot, push up and go back to the starting position as you exhale.","Repeat the movement for the recommended amount of repetitions and then perform with the left leg."],"Category":"strength"},"27":{"Name":"Dumbbell Lying One-Arm Rear Lateral Raise","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["middle back"],"Instructions":["While holding a dumbbell in one hand, lay with your chest down on a slightly inclined (around 15 degrees when measured from the floor) adjustable bench. The other hand can be used to hold to the leg of the bench for stability.","Position the palm of the hand that is holding the dumbbell in a neutral manner (palms facing your torso) as you keep the arm extended with the elbow slightly bent. This will be your starting position.","Now raise the arm with the dumbbell to the side until your elbow is at shoulder height and your arm is roughly parallel to the floor as you exhale. Tip: Maintain your arm perpendicular to the torso while keeping your arm extended throughout the movement. Also, keep the contraction at the top for a second.","Slowly lower the dumbbell to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"28":{"Name":"Dumbbell Lying Pronation","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["forearms"],"SecondaryMuscles":[],"Instructions":["Lie on a flat bench face down with one arm holding a dumbbell and the other hand on top of the bench folded so that you can rest your head on it.","Bend the elbows of the arm holding the dumbbell so that it creates a 90-degree angle between the upper arm and the forearm.","Now raise the upper arm so that the forearm is perpendicular to the floor and the upper arm is perpendicular to your torso. Tip: The upper arm should be parallel to the floor and also creating a 90-degree angle with your torso. This will be your starting position.","As you breathe out, externally rotate your forearm so that the dumbbell is lifted forward as you maintain the 90 degree angle bend between the upper arms and the forearm. You will continue this external rotation until the forearm is parallel to the floor. At this point you will hold the contraction for a second.","As you breathe in, slowly go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"29":{"Name":"Dumbbell Lying Rear Lateral Raise","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["While holding a dumbbell in each hand, lay with your chest down on a slightly inclined (around 15 degrees when measured from the floor) adjustable bench.","Position the palms of the hands in a neutral manner (palms facing your torso) as you keep the arms extended with the elbows slightly bent. This will be your starting position.","Now raise the arms to the side until your elbows are at shoulder height and your arms are roughly parallel to the floor as you exhale. Tip: Maintain your arms perpendicular to the torso while keeping them extended throughout the movement. Also, keep the contraction at the top for a second.","Slowly lower the dumbbells to the starting position as you inhale.","Repeat for the recommended amount of repetitions and then switch to the other arm."],"Category":"strength"},"30":{"Name":"Dumbbell Lying Supination","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["forearms"],"SecondaryMuscles":[],"Instructions":["Lie sideways on a flat bench with one arm holding a dumbbell and the other hand on top of the bench folded so that you can rest your head on it.","Bend the elbows of the arm holding the dumbbell so that it creates a 90-degree angle between the upper arm and the forearm.","Now raise the upper arm so that the forearm is parallel to the floor and perpendicular to your torso (Tip: So the forearm will be directly in front of you). The upper arm will be stationary by your torso and should be parallel to the floor (aligned with your torso at all times). This will be your starting position.","As you breathe out, externally rotate your forearm so that the dumbbell is lifted up in a semicircle motion as you maintain the 90 degree angle bend between the upper arms and the forearm. You will continue this external rotation until the forearm is perpendicular to the floor and the torso pointing towards the ceiling. At this point you will hold the contraction for a second.","As you breathe in, slowly go back to the starting position.","Repeat for the recommended amount of repetitions and then switch to the other arm."],"Category":"strength"},"31":{"Name":"Dumbbell One-Arm Shoulder Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Grab a dumbbell and either sit on a military press bench or a utility bench that has a back support on it as you place the dumbbells upright on top of your thighs or stand up straight.","Clean the dumbbell up to bring it to shoulder height. The other hand can be kept fully extended to the side, by the waist or grabbing a fixed surface.","Rotate the wrist so that the palm of your hand is facing forward. This is your starting position.","As you exhale, push the dumbbell up until your arm is fully extended.","After a second pause, slowly come down back to the starting position as you inhale.","Repeat for the recommended amount of repetitions and then switch arms."],"Category":"strength"},"32":{"Name":"Dumbbell One-Arm Triceps Extension","Force":"push","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":[],"Instructions":["Grab a dumbbell and either sit on a military press bench or a utility bench that has a back support on it as you place the dumbbells upright on top of your thighs or stand up straight.","Clean the dumbbell up to bring it to shoulder height and then extend the arm over your head so that the whole arm is perpendicular to the floor and next to your head. The dumbbell should be on top of you. The other hand can be kept fully extended to the side, by the waist, supporting the upper arm that has the dumbbell or grabbing a fixed surface.","Rotate the wrist so that the palm of your hand is facing forward and the pinkie is facing the ceiling. This will be your starting position.","Slowly lower the dumbbell behind your head as you hold the upper arm stationary. Inhale as you perform this movement and pause when your triceps are fully stretched.","Return to the starting position by flexing your triceps as you breathe out. Tip: It is imperative that only the forearm moves. The upper arm should remain at all times stationary next to your head.","Repeat for the recommended amount of repetitions and switch arms."],"Category":"strength"},"33":{"Name":"Dumbbell One-Arm Upright Row","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["biceps","traps"],"Instructions":["Grab a dumbbell and stand up straight with your arm extended in front of you with a slight bend at the elbows and your back straight. This will be your starting position. Tip: The dumbbell should be resting on top of your thigh with the palm of your hands facing your thighs.","Keep the other hand can be kept fully extended to the side, by the waist or grabbing a fixed surface. This will be your starting position.","Use your side shoulders to lift the dumbbell as you exhale. The dumbbell should be close to the body as you move it up. Continue to lift it until the dumbbell is nearly in line with your chin. Tip: Your elbows should drive the motion. As you lift the dumbbell, your elbow should always be higher than your forearm. Also, keep your torso stationary and pause for a second at the top of the movement.","Lower the dumbbell back down slowly to the starting position. Inhale as you perform this portion of the movement.","Repeat for the recommended amount of repetitions and switch arms."],"Category":"strength"},"34":{"Name":"Dumbbell Prone Incline Curl","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Grab a dumbbell on each hand and lie face down on an incline bench with your shoulders near top of the incline. Your knees can rest on the seat or your legs can be straddled to the sides (my preferred way).","Let your arms extend and hang naturally in front of you so that they are perpendicular to the floor.","Now keep your elbows in by your side and face the palms forward. This will be your starting position.","Raise the dumbbells by contracting the biceps until your arms are fully flexed. Exhale as you perform this portion of the movement and ensure that only the forearms move. The upper arms should remain stationary at all times.","Lower the dumbbells until your arms are fully extended.","Repeat for the recommended amount of times."],"Category":"strength"},"35":{"Name":"Dumbbell Raise","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["biceps"],"Instructions":["Grab a dumbbell in each arm and stand up straight with your arms extended by your sides with a slight bend at the elbows and your back straight. This will be your starting position. Tip: The dumbbell should be next to your thighs with the palm of your hands facing back.","Use your side shoulders to lift the dumbbells as you exhale. The dumbbells should be to the side of the body as you move them up. Continue to lift it until the dumbbells are nearly in line with your chin. Tip: Your elbows should drive the motion. As you lift the dumbbell, your elbow should always be higher than your forearm. Also, keep your torso stationary and pause for a second at the top of the movement.","Lower the dumbbells back down slowly to the starting position. Inhale as you perform this portion of the movement.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"36":{"Name":"Dumbbell Rear Lunge","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Stand with your torso upright holding two dumbbells in your hands by your sides. This will be your starting position.","Step backward with your right leg around two feet or so from the left foot and lower your upper body down, while keeping the torso upright and maintaining balance. Inhale as you go down. Tip: As in the other exercises, do not allow your knee to go forward beyond your toes as you come down, as this will put undue stress on the knee joint. Make sure that you keep your front shin perpendicular to the ground. Keep the torso upright during the lunge; flexible hip flexors are important. A long lunge emphasizes the Gluteus Maximus; a short lunge emphasizes Quadriceps.","Push up and go back to the starting position as you exhale. Tip: Use the ball of your feet to push in order to accentuate the quadriceps. To focus on the glutes, press with your heels.","Now repeat with the opposite leg."],"Category":"strength"},"37":{"Name":"Dumbbell Scaption","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["traps"],"Instructions":["This corrective exercise strengthens the muscles that stabilize your shoulder blade. Hold a light weight in each hand, hanging at your sides. Your thumbs should pointing up.","Begin the movement raising your arms out in front of you, about 30 degrees off center. Your arms should be fully extended as you perform the movement.","Continue until your arms are parallel to the ground, and then return to the starting position."],"Category":"strength"},"38":{"Name":"Dumbbell Seated Box Jump","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Position a box a couple feet to the side of a bench. Hold a dumbbell to your chest with both hands and seat yourself on the bench facing the box. This will be your starting position.","Plant your feet firmly on the ground as you lean forward, extending through the hips and knees to jump up and forward.","Land on the box with both feet, absorbing the impact by allowing the hips and knees to bend.","Step down and return to the starting position."],"Category":"plyometrics"},"39":{"Name":"Dumbbell Seated One-Leg Calf Raise","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["calves"],"SecondaryMuscles":[],"Instructions":["Place a block on the floor about 12 inches from a flat bench.","Sit on a flat bench and place a dumbbell on your upper left thigh about 3 inches above your knee.","Now place the ball of your left foot on the block. This will be your starting position.","Raise your toes up as high as possible as you exhale and you contract your calf muscle. Hold the contraction for a second.","Slowly return to the starting position, stretching as far down as possible.","Repeat for your prescribed number of repetitions and then repeat with the right leg."],"Category":"strength"},"40":{"Name":"Dumbbell Shoulder Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["While holding a dumbbell in each hand, sit on a military press bench or utility bench that has back support. Place the dumbbells upright on top of your thighs.","Now raise the dumbbells to shoulder height one at a time using your thighs to help propel them up into position.","Make sure to rotate your wrists so that the palms of your hands are facing forward. This is your starting position.","Now, exhale and push the dumbbells upward until they touch at the top.","Then, after a brief pause at the top contracted position, slowly lower the weights back down to the starting position while inhaling.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"41":{"Name":"Dumbbell Shrug","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["traps"],"SecondaryMuscles":[],"Instructions":["Stand erect with a dumbbell on each hand (palms facing your torso), arms extended on the sides.","Lift the dumbbells by elevating the shoulders as high as possible while you exhale. Hold the contraction at the top for a second. Tip: The arms should remain extended at all times. Refrain from using the biceps to help lift the dumbbells. Only the shoulders should be moving up and down.","Lower the dumbbells back to the original position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"42":{"Name":"Dumbbell Side Bend","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["abdominals"],"SecondaryMuscles":[],"Instructions":["Stand up straight while holding a dumbbell on the left hand (palms facing the torso) as you have the right hand holding your waist. Your feet should be placed at shoulder width. This will be your starting position.","While keeping your back straight and your head up, bend only at the waist to the right as far as possible. Breathe in as you bend to the side. Then hold for a second and come back up to the starting position as you exhale. Tip: Keep the rest of the body stationary.","Now repeat the movement but bending to the left instead. Hold for a second and come back to the starting position.","Repeat for the recommended amount of repetitions and then change hands."],"Category":"strength"},"43":{"Name":"Dumbbell Squat","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","lower back"],"Instructions":["Stand up straight while holding a dumbbell on each hand (palms facing the side of your legs).","Position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section.","Begin to slowly lower your torso by bending the knees as you maintain a straight posture with the head up. Continue down until your thighs are parallel to the floor. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to raise your torso as you exhale by pushing the floor with the heel of your foot mainly as you straighten the legs again and go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"44":{"Name":"Dumbbell Squat To A Bench","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","lower back"],"Instructions":["Stand up straight with a flat bench behind you while holding a dumbbell on each hand (palms facing the side of your legs).","Position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times as looking down will get you off balance and also maintain a straight back. This will be your starting position. Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances discussed in the foot stances section.","Begin to slowly lower your torso by bending the knees as you maintain a straight posture with the head up. Continue down until you slightly touch the bench behind you. Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to raise the bar as you exhale by pushing the floor with the heel of your foot mainly as you straighten the legs again and go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"45":{"Name":"Dumbbell Step Ups","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Stand up straight while holding a dumbbell on each hand (palms facing the side of your legs).","Place the right foot on the elevated platform. Step on the platform by extending the hip and the knee of your right leg. Use the heel mainly to lift the rest of your body up and place the foot of the left leg on the platform as well. Breathe out as you execute the force required to come up.","Step down with the left leg by flexing the hip and knee of the right leg as you inhale. Return to the original standing position by placing the right foot of to next to the left foot on the initial position.","Repeat with the right leg for the recommended amount of repetitions and then perform with the left leg."],"Category":"strength"},"46":{"Name":"Dumbbell Tricep Extension -Pronated Grip","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":[],"Instructions":["Lie down on a flat bench holding two dumbbells directly above your shoulders. Your arms should be fully extended and form a 90 degree angle from your torso and the floor.","The palms of your hands should be facing forward, and your elbows should be tucked in. This will be your starting position.","Now, inhale and slowly lower the dumbbells until they are near your ears. Be sure to keep your upper arms stationary and your elbows tucked in.","Then, exhale and use your triceps to return the weight to the starting position."],"Category":"strength"},"47":{"Name":"External Rotation","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["Lie sideways on a flat bench with one arm holding a dumbbell and the other hand on top of the bench folded so that you can rest your head on it.","Bend the elbows of the arm holding the dumbbell so that it creates a 90-degree angle between the upper arm and the forearm. Tip: Keep the arm parallel to your torso.","Now bend the elbow while keeping the upper arm stationary. In this manner, the forearm will be parallel to the floor and perpendicular to your torso (Tip: So the forearm will be directly in front of you). The upper arm will be stationary by your torso and should be parallel to the floor (aligned with your torso at all times). This will be your starting position.","As you breathe out, externally rotate your forearm so that the dumbbell is lifted up in a semicircle motion as you maintain the 90 degree angle bend between the upper arms and the forearm. You will continue this external rotation until the forearm is perpendicular to the floor and the torso pointing towards the ceiling. At this point you will hold the contraction for a second.","As you breathe in, slowly go back to the starting position.","Repeat for the recommended amount of repetitions and then switch to the other arm."],"Category":"strength"},"48":{"Name":"Flexor Incline Dumbbell Curls","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Hold the dumbbell towards the side farther from you so that you have more weight on the side closest to you. (This can be done for a good effect on all bicep dumbbell exercises). Now do a normal incline dumbbell curl, but keep your wrists as far back as possible so as to neutralize any stress that is placed on them.","Sit on an incline bench that is angled at 45-degrees while holding a dumbbell on each hand.","Let your arms hang down on your sides, with the elbows in, and turn the palms of your hands forward with the thumbs pointing away from the body. Tip: You will keep this hand position throughout the movement as there should not be any twisting of the hands as they come up. This will be your starting position.","Curl up the two dumbbells at the same time until your biceps are fully contracted and exhale. Tip: Do not swing the arms or use momentum. Keep a controlled motion at all times. Hold the contracted position for a second at the top.","As you inhale, slowly go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"49":{"Name":"Front Dumbbell Raise","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["Pick a couple of dumbbells and stand with a straight torso and the dumbbells on front of your thighs at arms length with the palms of the hand facing your thighs. This will be your starting position.","While maintaining the torso stationary (no swinging), lift the left dumbbell to the front with a slight bend on the elbow and the palms of the hands always facing down. Continue to go up until you arm is slightly above parallel to the floor. Exhale as you execute this portion of the movement and pause for a second at the top. Inhale after the second pause.","Now lower the dumbbell back down slowly to the starting position as you simultaneously lift the right dumbbell.","Continue alternating in this fashion until all of the recommended amount of repetitions have been performed for each arm."],"Category":"strength"},"50":{"Name":"Front Incline Dumbbell Raise","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["Sit down on an incline bench with the incline set anywhere between 30 to 60 degrees while holding a dumbbell on each hand. Tip: You can change the angle to hit the muscle a little differently each time.","Extend your arms straight in front of you and have your palms facing down with the dumbbells raised about 1 inch above your thighs. This will be your starting position.","Slowly raise the dumbbells straight up until they are slightly above your shoulders, while keeping your elbows locked. Squeeze at the top for a second and make sure you breathe out during this portion of the movement. Tip: Keep your head resting down against the bench and your legs on the floor at all times.","Lower the arms back to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"51":{"Name":"Front Two-Dumbbell Raise","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["Pick a couple of dumbbells and stand with a straight torso and the dumbbells on front of your thighs at arms length with the palms of the hand facing your thighs. This will be your starting position.","While maintaining the torso stationary (no swinging), lift the dumbbells to the front with a slight bend on the elbow and the palms of the hands always facing down. Continue to go up until you arms are slightly above parallel to the floor. Exhale as you execute this portion of the movement and pause for a second at the top.","As you inhale, lower the dumbbells back down slowly to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"52":{"Name":"Hammer Curls","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Stand up with your torso upright and a dumbbell on each hand being held at arms length. The elbows should be close to the torso.","The palms of the hands should be facing your torso. This will be your starting position.","Now, while holding your upper arm stationary, exhale and curl the weight forward while contracting the biceps. Continue to raise the weight until the biceps are fully contracted and the dumbbell is at shoulder level. Hold the contracted position for a brief moment as you squeeze the biceps. Tip: Focus on keeping the elbow stationary and only moving your forearm.","After the brief pause, inhale and slowly begin the lower the dumbbells back down to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"53":{"Name":"Hammer Grip Incline DB Bench Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Lie back on an incline bench with a dumbbell on each hand on top of your thighs. The palms of your hand will be facing each other.","By using your thighs to help you get the dumbbells up, clean the dumbbells one arm at a time so that you can hold them at shoulder width.","Once at shoulder width, keep the palms of your hands with a neutral grip (palms facing each other). Keep your elbows flared out with the upper arms in line with the shoulders (perpendicular to the torso) and the elbows bent creating a 90-degree angle between the upper arm and the forearm. This will be your starting position.","Now bring down the weights slowly to your side as you breathe in. Keep full control of the dumbbells at all times.","As you breathe out, push the dumbbells up using your pectoral muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly. Tip: It should take at least twice as long to go down than to come up.","Repeat the movement for the prescribed amount of repetitions.","When you are done, place the dumbbells back in your thighs and then on the floor. This is the safest manner to dispose of the dumbbells."],"Category":"strength"},"54":{"Name":"Incline Dumbbell Bench With Palms Facing In","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Lie back on an incline bench with a dumbbell on each hand on top of your thighs. The palms of your hand will be facing each other.","By using your thighs to help you get the dumbbells up, clean the dumbbells one arm at a time so that you can hold them at shoulder width.","Once at shoulder width, keep the palms of your hands with a neutral grip (palms facing each other). Keep your elbows flared out with the upper arms in line with the shoulders (perpendicular to the torso) and the elbows bent creating a 90-degree angle between the upper arm and the forearm. This will be your starting position.","Now bring down the weights slowly to your side as you breathe in. Keep full control of the dumbbells at all times.","As you breathe out, push the dumbbells up using your pectoral muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly. Tip: It should take at least twice as long to go down than to come up.","Repeat the movement for the prescribed amount of repetitions.","When you are done, place the dumbbells back in your thighs and then on the floor. This is the safest manner to dispose of the dumbbells."],"Category":"strength"},"55":{"Name":"Incline Dumbbell Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Sit back on an incline bench with a dumbbell in each hand held at arms length. Keep your elbows close to your torso and rotate the palms of your hands until they are facing forward. This will be your starting position.","While holding the upper arm stationary, curl the weights forward while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second.","Slowly begin to bring the dumbbells back to starting position as your breathe in.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"56":{"Name":"Incline Dumbbell Flyes","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders"],"Instructions":["Hold a dumbbell on each hand and lie on an incline bench that is set to an incline angle of no more than 30 degrees.","Extend your arms above you with a slight bend at the elbows.","Now rotate the wrists so that the palms of your hands are facing you. Tip: The pinky fingers should be next to each other. This will be your starting position.","As you breathe in, start to slowly lower the arms to the side while keeping the arms extended and while rotating the wrists until the palms of the hand are facing each other. Tip: At the end of the movement the arms will be by your side with the palms facing the ceiling.","As you exhale start to bring the dumbbells back up to the starting position by reversing the motion and rotating the hands so that the pinky fingers are next to each other again. Tip: Keep in mind that the movement will only happen at the shoulder joint and at the wrist. There is no motion that happens at the elbow joint.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"57":{"Name":"Incline Dumbbell Flyes - With A Twist","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders"],"Instructions":["Hold a dumbbell in each hand and lie on an incline bench that is set to an incline angle of no more than 30 degrees.","Extend your arms above you with a slight bend at the elbows.","Now rotate the wrists so that the palms of your hands are facing you. Tip: The pinky fingers should be next to each other. This will be your starting position.","As you breathe in, start to slowly lower the arms to the side while keeping the arms extended and while rotating the wrists until the palms of the hand are facing each other. Tip: At the end of the movement the arms will be by your side with the palms facing the ceiling.","As you exhale start to bring the dumbbells back up to the starting position by reversing the motion and rotating the hands so that the pinky fingers are next to each other again. Tip: Keep in mind that the movement will only happen at the shoulder joint and at the wrist. There is no motion that happens at the elbow joint.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"58":{"Name":"Incline Dumbbell Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Lie back on an incline bench with a dumbbell in each hand atop your thighs. The palms of your hands will be facing each other.","Then, using your thighs to help push the dumbbells up, lift the dumbbells one at a time so that you can hold them at shoulder width.","Once you have the dumbbells raised to shoulder width, rotate your wrists forward so that the palms of your hands are facing away from you. This will be your starting position.","Be sure to keep full control of the dumbbells at all times. Then breathe out and push the dumbbells up with your chest.","Lock your arms at the top, hold for a second, and then start slowly lowering the weight. Tip Ideally, lowering the weights should take about twice as long as raising them.","Repeat the movement for the prescribed amount of repetitions.","When you are done, place the dumbbells back on your thighs and then on the floor. This is the safest manner to release the dumbbells."],"Category":"strength"},"59":{"Name":"Incline Hammer Curls","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Seat yourself on an incline bench with a dumbbell in each hand. You should pressed firmly against he back with your feet together. Allow the dumbbells to hang straight down at your side, holding them with a neutral grip. This will be your starting position.","Initiate the movement by flexing at the elbow, attempting to keep the upper arm stationary.","Continue to the top of the movement and pause, then slowly return to the start position."],"Category":"strength"},"60":{"Name":"Incline Inner Biceps Curl","Force":null,"Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Hold a dumbbell in each hand and lie back on an incline bench.","The dumbbells should be at arm's length hanging at your sides and your palms should be facing out. This will be your starting position.","Now as you exhale curl the weight outward and up while keeping your forearms in line with your side deltoids. Continue the curl until the dumbbells are at shoulder height and to the sides of your deltoids. Tip: The end of the movement should look similar to a double biceps pose.","After a second contraction at the top of the movement, start to inhale and slowly lower the weights back to the starting position using the same path used to bring them up.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"61":{"Name":"Iron Cross","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["chest","glutes","hamstrings","lower back","quadriceps","traps"],"Instructions":[],"Category":"strength"},"62":{"Name":"Lying Dumbbell Tricep Extension","Force":"push","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["Lie on a flat bench while holding two dumbbells directly in front of you. Your arms should be fully extended at a 90-degree angle from your torso and the floor. The palms should be facing in and the elbows should be tucked in. This is the starting position.","As you breathe in and you keep the upper arms stationary with the elbows in, slowly lower the weight until the dumbbells are near your ears.","At that point, while keeping the elbows in and the upper arms stationary, use the triceps to bring the weight back up to the starting position as you breathe out.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"63":{"Name":"Lying One-Arm Lateral Raise","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["While holding a dumbbell in one hand, lay with your chest down on a flat bench. The other hand can be used to hold to the leg of the bench for stability.","Position the palm of the hand that is holding the dumbbell in a neutral manner (palms facing your torso) as you keep the arm extended with the elbow slightly bent. This will be your starting position.","Now raise the arm with the dumbbell to the side until your elbow is at shoulder height and your arm is roughly parallel to the floor as you exhale. Tip: Maintain your arm perpendicular to the torso while keeping your arm extended throughout the movement. Also, keep the contraction at the top for a second.","Slowly lower the dumbbell to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"64":{"Name":"Lying Rear Delt Raise","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["While holding a dumbbell in each hand, lay with your chest down on a flat bench.","Position the palms of the hands in a neutral manner (palms facing your torso) as you keep the arms extended with the elbows slightly bent. This will be your starting position.","Now raise the arms to the side until your elbows are at shoulder height and your arms are roughly parallel to the floor as you exhale. Tip: Maintain your arms perpendicular to the torso while keeping them extended throughout the movement. Also, keep the contraction at the top for a second.","Slowly lower the dumbbells to the starting position as you inhale.","Repeat for the recommended amount of repetitions and then switch to the other arm."],"Category":"strength"},"65":{"Name":"Lying Supine Dumbbell Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Lie down on a flat bench face up while holding a dumbbell in each arm on top of your thighs.","Bring the dumbbells to the sides with the arms extended and the palms of the hands facing your thighs (neutral grip).","While keeping the arms close to your torso and elbows in, slowly lower your arms (as you keep them extended with a slight bend at the elbows) as far down towards the floor as you can go. Once you cannot go down any further, lock your upper arms in that position and that will be your starting position.","As you breathe out, slowly begin to curl the weights up as you simultaneously rotate your wrists so that the palms of the hands face up. Continue curling the weight until your biceps are fully contracted and squeeze hard at the top position for a second. Tip: Only the forearms should move. Upper arms should remain stationary and elbows should stay in throughout the movement.","Return back to the starting position very slowly."],"Category":"strength"},"66":{"Name":"Middle Back Shrug","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":[],"Instructions":["Lie facedown on an incline bench while holding a dumbbell in each hand. Your arms should be fully extended hanging down and pointing towards the floor. The palms of your hands should be facing each other. This will be your starting position.","As you exhale, squeeze your shoulder blades together and hold the contraction for a full second. Tip: This movement is just like the reverse action of a hug, or trying to perform rear laterals as if you had no arms.","As you inhale go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"67":{"Name":"One-Arm Dumbbell Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats","shoulders"],"Instructions":["Choose a flat bench and place a dumbbell on each side of it.","Place the right leg on top of the end of the bench, bend your torso forward from the waist until your upper body is parallel to the floor, and place your right hand on the other end of the bench for support.","Use the left hand to pick up the dumbbell on the floor and hold the weight while keeping your lower back straight. The palm of the hand should be facing your torso. This will be your starting position.","Pull the resistance straight up to the side of your chest, keeping your upper arm close to your side and keeping the torso stationary. Breathe out as you perform this step. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. Also, make sure that the force is performed with the back muscles and not the arms. Finally, the upper torso should remain stationary and only the arms should move. The forearms should do no other work except for holding the dumbbell; therefore do not try to pull the dumbbell up using the forearms.","Lower the resistance straight down to the starting position. Breathe in as you perform this step.","Repeat the movement for the specified amount of repetitions.","Switch sides and repeat again with the other arm."],"Category":"strength"},"68":{"Name":"One-Arm Flat Bench Dumbbell Flye","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["chest"],"SecondaryMuscles":[],"Instructions":["Lie down on a flat bench with a dumbbell in one hand resting on top of your thigh. The palm of your hand with the dumbbell in it should be at a neutral grip.","By using your thighs to help you get the dumbbell up, clean the dumbbell so that you can hold it in front of you with your lifting arm being fully extended. Remember to maintain a neutral grip with this exercise. Your non lifting hand should be to the side holding the flat bench for better support. This will be your starting position.","Your arm with the weight should have a slight bend on your elbow in order to prevent stress at the biceps tendon. Begin by lowering your arm with the weight in it out in a wide arc until you feel a stretch on your chest. Breathe in as you perform this portion of the movement. Tip: Keep in mind that throughout the movement, your lifting arm should remain stationary; the movement should only occur at the shoulder joint.","Return your lifting arm back to the starting position as you squeeze your chest muscles and breathe out. Tip: Make sure to use the same arc of motion used to lower the weights.","Hold for a second at the contracted position and repeat the movement for the prescribed amount of repetitions.","Switch arms and repeat the exercise."],"Category":"strength"},"69":{"Name":"One-Arm Incline Lateral Raise","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["Lie down sideways on an incline bench press with a dumbbell in the hand. Make sure the shoulder is pressing against the incline bench and the arm is lying across your body with the palm around your navel.","Hold a dumbbell in your uppermost arm while keeping it extended in front of you parallel to the floor. This is your starting position.","While keeping the dumbbell parallel to the floor at all times, perform a lateral raise. Your arm should travel straight up until it is pointing at the ceiling. Tip: Exhale as you perform this movement. Hold the dumbbell in the position and feel the contraction in the shoulders for a second.","While inhaling lower the weight across your body back into the starting position.","Repeat the movement for the prescribed amount of repetitions.","Switch arms and repeat the movement."],"Category":"strength"},"70":{"Name":"One-Arm Side Laterals","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["Pick a dumbbell and place it in one of your hands. Your non lifting hand should be used to grab something steady such as an incline bench press. Lean towards your lifting arm and away from the hand that is gripping the incline bench as this will allow you to keep your balance.","Stand with a straight torso and have the dumbbell by your side at arm’s length with the palm of the hand facing you. This will be your starting position.","While maintaining the torso stationary (no swinging), lift the dumbbell to your side with a slight bend on the elbow and your hand slightly tilted forward as if pouring water in a glass. Continue to go up until you arm is parallel to the floor. Exhale as you execute this movement and pause for a second at the top.","Lower the dumbbell back down slowly to the starting position as you inhale.","Repeat for the recommended amount of repetitions.","Switch arms and repeat the exercise."],"Category":"strength"},"71":{"Name":"One Arm Dumbbell Bench Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Lie down on a flat bench with a dumbbell in one hand on top of your thigh.","By using your thigh to help you get the dumbbell up, clean the dumbbell up so that you can hold it in front of you at shoulder width. Use the hand you are not lifting with to help position the dumbbell over you properly.","Once at shoulder width, rotate your wrist forward so that the palm of your hand is facing away from you. This will be your starting position.","Bring down the weights slowly to your side as you breathe in. Keep full control of the dumbbell at all times. Tip: Use the hand that you are not lifting with to help keep the dumbbell balance as you may struggle a bit at first. Only use your non-lifting hand if it is needed. Otherwise, keep it resting to the side.","As you breathe out, push the dumbbells up using your pectoral muscles. Lock your arms in the contracted position, squeeze your chest, hold for a second and then start coming down slowly. Tip: It should take at least twice as long to go down than to come up.","Repeat the movement for the prescribed amount of repetitions of your training program.","Switch arms and repeat the movement."],"Category":"strength"},"72":{"Name":"One Arm Dumbbell Preacher Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Grab a dumbbell with the right arm and place the upper arm on top of the preacher bench or the incline bench. The dumbbell should be held at shoulder length. This will be your starting position.","As you breathe in, slowly lower the dumbbell until your upper arm is extended and the biceps is fully stretched.","As you exhale, use the biceps to curl the weight up until your biceps is fully contracted and the dumbbell is at shoulder height. Again, remember that to ensure full contraction you need to bring that small finger higher than the thumb.","Squeeze the biceps hard for a second at the contracted position and repeat for the recommended amount of repetitions.","Switch arms and repeat the movement."],"Category":"strength"},"73":{"Name":"One Arm Pronated Dumbbell Triceps Extension","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":[],"Instructions":["Lie flat on a bench while holding a dumbbell at arms length. Your arm should be perpendicular to your body. The palm of your hand should be facing towards your feet as a pronated grip is required to perform this exercise.","Place your non lifting hand on your bicep for support.","Slowly begin to lower the dumbbell down as you breathe in.","Then, begin lifting the dumbbell upward as you contract the triceps. Remember to breathe out during the concentric (lifting part of the exercise).","Repeat until you have performed your set repetitions.","Switch arms and repeat the movement."],"Category":"strength"},"74":{"Name":"One Arm Supinated Dumbbell Triceps Extension","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":[],"Instructions":["Lie flat on a bench while holding a dumbbell at arms length. Your arm should be perpendicular to your body. The palm of your hand should be facing towards your face as a supinated grip is required to perform this exercise.","Place your non lifting hand on your bicep for support.","Slowly begin to lower the dumbbell down as you breathe in.","Then, begin lifting the dumbbell upward as you contract the triceps. Remember to breathe out during the concentric (lifting part of the exercise).","Repeat until you have performed your set repetitions.","Switch arms and repeat the movement.","Switch arms again and repeat the movement."],"Category":"strength"},"75":{"Name":"Palms-Down Dumbbell Wrist Curl Over A Bench","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["forearms"],"SecondaryMuscles":[],"Instructions":["Start out by placing two dumbbells on one side of a flat bench.","Kneel down on both of your knees so that your body is facing the flat bench.","Use your arms to grab both of the dumbbells with a pronated grip (palms facing down) and bring them up so that your forearms are resting against the flat bench. Your wrists should be hanging over the edge.","Start out by curling your wrist upwards and exhaling.","Slowly lower your wrists back down to the starting position while inhaling.","Your forearms should be stationary as your wrist is the only movement needed to perform this exercise.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"76":{"Name":"Palms-Up Dumbbell Wrist Curl Over A Bench","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["forearms"],"SecondaryMuscles":[],"Instructions":["Start out by placing two dumbbells on one side of a flat bench.","Kneel down on both of your knees so that your body is facing the flat bench.","Use your arms to grab both of the dumbbells with a supinated grip (palms up) and bring them up so that your forearms are resting against the flat bench. Your wrists should be hanging over the edge.","Start out by curling your wrist upwards and exhaling.","Slowly lower your wrists back down to the starting position while inhaling. Make sure to inhale during this part of the exercise.","Your forearms should be stationary as your wrist is the only movement needed to perform this exercise.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"77":{"Name":"Plie Dumbbell Squat","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abdominals","calves","glutes","hamstrings"],"Instructions":["Hold a dumbbell at the base with both hands and stand straight up. Move your legs so that they are wider than shoulder width apart from each other with your knees slightly bent.","Your toes should be facing out. Note: Your arms should be stationary while performing the exercise. This is the starting position.","Slowly bend the knees and lower your legs until your thighs are parallel to the floor. Make sure to inhale as this is the eccentric part of the exercise.","Press mainly with the heel of the foot to bring the body back to the starting position while exhaling.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"78":{"Name":"Power Partials","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["Stand up with your torso upright and a dumbbell on each hand being held at arms length. The elbows should be close to the torso.","The palms of the hands should be facing your torso. Your feet should be about shoulder width apart. This will be your starting position.","Keeping your arms straight and the torso stationary, lift the weights out to your sides until they are about shoulder level height while exhaling.","Feel the contraction for a second and begin to lower the weights back down to the starting position while inhaling. Tip: Keep the palms facing down with the little finger slightly higher while lifting and lowering the weights as it will concentrate the stress on your shoulders mainly.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"79":{"Name":"Preacher Hammer Dumbbell Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":["forearms"],"Instructions":["Place the upper part of both arms on top of the preacher bench as you hold a dumbbell in each hand with the palms facing each other (neutral grip).","As you breathe in, slowly lower the dumbbells until your upper arm is extended and the biceps is fully stretched.","As you exhale, use the biceps to curl the weight up until your biceps is fully contracted and the dumbbells are at shoulder height.","Squeeze the biceps hard for a second at the contracted position and repeat for the recommended amount of repetitions."],"Category":"strength"},"80":{"Name":"Reverse Flyes","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["To begin, lie down on an incline bench with the chest and stomach pressing against the incline. Have the dumbbells in each hand with the palms facing each other (neutral grip).","Extend the arms in front of you so that they are perpendicular to the angle of the bench. The legs should be stationary while applying pressure with the ball of your toes. This is the starting position.","Maintaining the slight bend of the elbows, move the weights out and away from each other (to the side) in an arc motion while exhaling. Tip: Try to squeeze your shoulder blades together to get the best results from this exercise.","The arms should be elevated until they are parallel to the floor.","Feel the contraction and slowly lower the weights back down to the starting position while inhaling.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"81":{"Name":"Reverse Flyes With External Rotation","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["To begin, lie down on an incline bench set at a 30-degree angle with the chest and stomach pressing against the incline.","Have the dumbbells in each hand with the palms facing down to the floor. Your arms should be in front of you so that they are perpendicular to the angle of the bench. Tip: Your elbows should have a slight bend. The legs should be stationary while applying pressure with the ball of your toes (your heels should not be touching the floor). This is the starting position.","Maintaining the slight bend of the elbows, move the weights out and away from each other in an arc motion while exhaling.","As you lift the weight, your wrist should externally rotate by 90-degrees so that you go from a palms down (pronated) grip to a palms facing each other (neutral) grip. Tip: Try to squeeze your shoulder blades together to get the best results from this exercise.","The arms should be elevated until they are level with the head.","Feel the contraction and slowly lower the weights back down to the starting position while inhaling.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"82":{"Name":"Seated Bent-Over One-Arm Dumbbell Triceps Extension","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":[],"Instructions":["Sit down at the end of a flat bench with a dumbbell in one arm using a neutral grip (palms of the hand facing you).","Bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Make sure that you keep the head up.","The upper arm with the dumbbell should be close to the torso and aligned with it (lifted up until it is parallel to the floor while the forearms are pointing towards the floor as the hands hold the weights). Tip: There should be a 90-degree angle between the forearms and the upper arm. This is your starting position.","Keeping the upper arm stationary, use the triceps to lift the weight as you exhale until the forearm is parallel to the floor and the whole arm is extended. Like many other arm exercises, only the forearm moves.","After a second contraction at the top, slowly lower the dumbbell back to the starting position as you inhale.","Repeat the movement for the prescribed amount of repetitions.","Switch arms and repeat the exercise."],"Category":"strength"},"83":{"Name":"Seated Bent-Over Rear Delt Raise","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["Place a couple of dumbbells looking forward in front of a flat bench.","Sit on the end of the bench with your legs together and the dumbbells behind your calves.","Bend at the waist while keeping the back straight in order to pick up the dumbbells. The palms of your hands should be facing each other as you pick them. This will be your starting position.","Keeping your torso forward and stationary, and the arms slightly bent at the elbows, lift the dumbbells straight to the side until both arms are parallel to the floor. Exhale as you lift the weights. (Note: avoid swinging the torso or bringing the arms back as opposed to the side.)","After a one second contraction at the top, slowly lower the dumbbells back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"84":{"Name":"Seated Bent-Over Two-Arm Dumbbell Triceps Extension","Force":"push","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":[],"Instructions":["Sit down at the end of a flat bench with a dumbbell in both arms using a neutral grip (palms of the hand facing you).","Bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Make sure that you keep the head up.","The upper arms with the dumbbells should be close to the torso and aligned with it (lifted up until they are parallel to the floor while the forearms are pointing towards the floor as the hands hold the weights). Tip: There should be a 90-degree angle between the forearms and the upper arm. This is your starting position.","Keeping the upper arms stationary, use the triceps to lift the weight as you exhale until the forearms are parallel to the floor and the whole arm is extended. Like many other arm exercises, only the forearm moves.","After a second contraction at the top, slowly lower the dumbbells back to the starting position as you inhale.","Repeat the movement for the prescribed amount of repetitions."],"Category":"strength"},"85":{"Name":"Seated Dumbbell Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Sit on a flat bench with a dumbbell on each hand being held at arms length. The elbows should be close to the torso.","Rotate the palms of the hands so that they are facing your torso. This will be your starting position.","While holding the upper arm stationary, curl the weights and start twisting the wrists once the dumbbells pass your thighs so that the palms of your hands face forward at the end of the movement. Make sure that you contract the biceps as you breathe out and make sure that only the forearms move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the biceps.","Slowly begin to bring the dumbbells back to the starting position as your breathe in and as you rotate the wrists back to a neutral grip.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"86":{"Name":"Seated Dumbbell Inner Biceps Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Sit on the end of a flat bench with a dumbbell in each hand being held at arms length. The elbows should be close to the torso.","Rotate the palms of the hands so that they are facing inward in a neutral position. This will be your starting position.","While holding the upper arms stationary, curl the dumbbells out and up, turning the palms out as you lift and keeping your forearms in line with your outer deltoids. Tips:","Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the biceps.","Slowly begin to bring the dumbbells back to the starting position as your breathe in. Remember to rotate your arms as you lower the dumbbells so that you can switch back to a neutral grip.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"87":{"Name":"Seated Dumbbell Palms-Down Wrist Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["forearms"],"SecondaryMuscles":[],"Instructions":["Start out by placing two dumbbells on the floor in front of a flat bench.","Sit down on the edge of the flat bench with your legs at about shoulder width apart. Make sure to keep your feet on the floor.","Use your arms to grab both of the dumbbells and bring them up so that your forearms are resting against your thighs with the palms of the hands facing down. Your wrists should be hanging over the edge of your thighs.","Start out by curling your wrist upwards and exhaling.","Slowly lower your wrists back down to the starting position while inhaling. Make sure to inhale during this part of the exercise. Tip: Your forearms should be stationary as your wrist is the only movement needed to perform this exercise.","Repeat for the recommended amount of repetitions.","When finished, simply lower the dumbbells to the floor."],"Category":"strength"},"88":{"Name":"Seated Dumbbell Palms-Up Wrist Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["forearms"],"SecondaryMuscles":[],"Instructions":["Start out by placing two dumbbells on the floor in front of a flat bench.","Sit down on the edge of the flat bench with your legs at about shoulder width apart. Make sure to keep your feet on the floor.","Use your arms to grab both of the dumbbells and bring them up so that your forearms are resting against your thighs with the palms of the hands facing up. Your wrists should be hanging over the edge of your thighs.","Start out by curling your wrist upwards and exhaling.","Slowly lower your wrists back down to the starting position while inhaling. Make sure to inhale during this part of the exercise. Tip: Your forearms should be stationary as your wrist is the only movement needed to perform this exercise.","Repeat for the recommended amount of repetitions.","When finished, simply lower the dumbbells to the floor."],"Category":"strength"},"89":{"Name":"Seated Dumbbell Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Grab a couple of dumbbells and sit on a military press bench or a utility bench that has a back support on it as you place the dumbbells upright on top of your thighs.","Clean the dumbbells up one at a time by using your thighs to bring the dumbbells up to shoulder height at each side.","Rotate the wrists so that the palms of your hands are facing forward. This is your starting position.","As you exhale, push the dumbbells up until they touch at the top.","After a second pause, slowly come down back to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"90":{"Name":"Seated One-Arm Dumbbell Palms-Down Wrist Curl","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["forearms"],"SecondaryMuscles":[],"Instructions":["Sit on a flat bench with a dumbbell in your right hand.","Place your feet flat on the floor, at a distance that is slightly wider than shoulder width apart.","Lean forward and place your right forearm on top of your upper right thigh with your palm down. Tip: Make sure that the back of the wrist lies on top of your knees. This will be your starting position.","Lower the dumbbell as far as possible as you keep a tight grip on the dumbbell. Inhale as you perform this movement.","Now curl the dumbbell as high as possible as you contract the forearms and as you exhale. Keep the contraction for a second before you lower again. Tip: The only movement should happen at the wrist.","Perform for the recommended amount of repetitions, switch arms and repeat the movement."],"Category":"strength"},"91":{"Name":"Seated One-Arm Dumbbell Palms-Up Wrist Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["forearms"],"SecondaryMuscles":[],"Instructions":["Sit on a flat bench with a dumbbell in your right hand.","Place your feet flat on the floor, at a distance that is slightly wider than shoulder width apart.","Lean forward and place your right forearm on top of your upper right thigh with your palm up. Tip: Make sure that the front of the wrist lies on top of your knees. This will be your starting position.","Lower the dumbbell as far as possible as you keep a tight grip on the dumbbell. Inhale as you perform this movement.","Now curl the dumbbell as high as possible as you contract the forearms and as you exhale. Keep the contraction for a second before you lower again. Tip: The only movement should happen at the wrist.","Perform for the recommended amount of repetitions, switch arms and repeat the movement."],"Category":"strength"},"92":{"Name":"Seated Side Lateral Raise","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["Pick a couple of dumbbells and sit at the end of a flat bench with your feet firmly on the floor. Hold the dumbbells with your palms facing in and your arms straight down at your sides at arms' length. This will be your starting position.","While maintaining the torso stationary (no swinging), lift the dumbbells to your side with a slight bend on the elbow and the hands slightly tilted forward as if pouring water in a glass. Continue to go up until you arms are parallel to the floor. Exhale as you execute this movement and pause for a second at the top.","Lower the dumbbells back down slowly to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"93":{"Name":"Seated Triceps Press","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":[],"Instructions":["Sit down on a bench with back support and grasp a dumbbell with both hands and hold it overhead at arm's length. Tip: a better way is to have somebody hand it to you especially if it is very heavy. The resistance should be resting in the palms of your hands with your thumbs around it. The palm of the hand should be facing inward. This will be your starting position.","Keeping your upper arms close to your head (elbows in) and perpendicular to the floor, lower the resistance in a semi-circular motion behind your head until your forearms touch your biceps. Tip: The upper arms should remain stationary and only the forearms should move. Breathe in as you perform this step.","Go back to the starting position by using the triceps to raise the dumbbell. Breathe out as you perform this step.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"94":{"Name":"See-Saw Press (Alternating Side Press)","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["abdominals","triceps"],"Instructions":["Grab a dumbbell with each hand and stand up erect.","Clean (lift) the dumbbells to the chest/shoulder level and then rotate your wrists so that your palms are facing towards you as if you were getting ready to perform an Arnold Press. This will be your starting position.","Now start extending your left arm overhead as you rotate the wrist so that the palm of your hand faces forward as you go up. Your elbows should come out also as you lift the weight. Simultaneously, you will also be bending from your hip to your opposite side. Tip: If you perform the exercise correctly, is should look as if you are trying to reach for something overhead on the right hand side of your body, but with your left arm. Breathe out as you perform this movement.","Once you reach the top position breathe in. Then, with the weight fully extended overhead and you bent over to your right hand side, begin the movement to the left side.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"95":{"Name":"Side Lateral Raise","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["Pick a couple of dumbbells and stand with a straight torso and the dumbbells by your side at arms length with the palms of the hand facing you. This will be your starting position.","While maintaining the torso in a stationary position (no swinging), lift the dumbbells to your side with a slight bend on the elbow and the hands slightly tilted forward as if pouring water in a glass. Continue to go up until you arms are parallel to the floor. Exhale as you execute this movement and pause for a second at the top.","Lower the dumbbells back down slowly to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"96":{"Name":"Side Laterals to Front Raise","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["traps"],"Instructions":["In a standing position, hold a pair of dumbbells at your side. This will be your starting position.","Keeping your elbows slightly bent, raise the weights directly in front of you to shoulder height, avoiding any swinging or cheating.","At the top of the exercise move the weights out in front of you, keeping your arms extended.","Lower the weights with a controlled motion.","On the next repetition, raise the weights in front of you to shoulder height before moving the weights laterally to your sides.","Lower the weights to the starting position."],"Category":"strength"},"97":{"Name":"Single Dumbbell Raise","Force":null,"Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["forearms","traps"],"Instructions":["With a wide stance, hold a dumbell with both hands, grasping the head of the dumbbell instead of the handle. Your arms should be extended and hanging at the waist. This will be your starting position.","Raise the weight until it is above shoulder level, keeping your arms extended. Your torso and hips should remain stationary throughout the movement.","Return to the starting position and repeat for the recommended amount of repetitions."],"Category":"strength"},"98":{"Name":"Spell Caster","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["glutes","shoulders"],"Instructions":["Hold a dumbbell in each hand with a pronated grip. Your feet should be wide with your hips and knees extended. This will be your starting position.","Begin the movement by pulling both of the dumbbells to one side next to your hip, rotating your torso.","Keeping your arms straight and the dumbbells parallel to the ground, rotate your torso to swing the weights to your opposite side.","Continue alternating, rotating from one side to the other until the set is complete."],"Category":"strength"},"99":{"Name":"Split Squat with Dumbbells","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["glutes","hamstrings"],"Instructions":["Position yourself into a staggered stance with the rear foot elevated and front foot forward.","Hold a dumbbell in each hand, letting them hang at the sides. This will be your starting position.","Begin by descending, flexing your knee and hip to lower your body down. Maintain good posture througout the movement. Keep the front knee in line with the foot as you perform the exercise.","At the bottom of the movement, drive through the heel to extend the knee and hip to return to the starting position."],"Category":"strength"},"100":{"Name":"Standing Alternating Dumbbell Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Stand with a dumbbell in each hand. Raise the dumbbells to your shoulders with your palms facing forward and your elbows pointed out. This will be your starting position.","Extend one arm to press the dumbbell straight up, keeping your off hand in place. Do not lean or jerk the weight during the movement.","After a brief pause, return the weight to the starting position.","Repeat for the opposite side, continuing to alternate between arms."],"Category":"strength"},"101":{"Name":"Standing Bent-Over One-Arm Dumbbell Triceps Extension","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["shoulders"],"Instructions":["With a dumbbell in one hand and the palm facing your torso, bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Make sure that you keep the head up.","The upper arm should be close to the torso and parallel to the floor while the forearm is pointing towards the floor as the hand holds the weight. Tip: There should be a 90-degree angle between the forearm and the upper arm. This is your starting position.","Keeping the upper arms stationary, use the triceps to lift the weights as you exhale until the forearms are parallel to the floor and the whole arm is extended. Like many other arm exercises, only the forearm moves.","After a second contraction at the top, slowly lower the dumbbell back to the starting position as you inhale.","Repeat the movement for the prescribed amount of repetitions.","Switch arms and repeat the exercise."],"Category":"strength"},"102":{"Name":"Standing Bent-Over Two-Arm Dumbbell Triceps Extension","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":[],"Instructions":["With a dumbbell in each hand and the palms facing your torso, bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Make sure that you keep the head up. The upper arms should be close to the torso and parallel to the floor while the forearms are pointing towards the floor as the hands hold the weights. Tip: There should be a 90-degree angle between the forearms and the upper arm. This is your starting position.","Keeping the upper arms stationary, use the triceps to lift the weights as you exhale until the forearms are parallel to the floor and the whole arms are extended. Like many other arm exercises, only the forearm moves.","After a second contraction at the top, slowly lower the dumbbells back to their starting position as you inhale.","Repeat the movement for the prescribed amount of repetitions."],"Category":"strength"},"103":{"Name":"Standing Concentration Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":["forearms"],"Instructions":["Taking a dumbbell in your working hand, lean forward. Allow your working arm to hang perpendicular to the ground with the elbow pointing out. This will be your starting position.","Flex the elbow to curl the weight, keeping the upper arm stationary. At the top of the repetition, flex the biceps and pause.","Lower the dumbbell back to the starting position.","Repeat the movement for the prescribed amount of repetitions."],"Category":"strength"},"104":{"Name":"Standing Dumbbell Calf Raise","Force":"push","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["calves"],"SecondaryMuscles":[],"Instructions":["Stand with your torso upright holding two dumbbells in your hands by your sides. Place the ball of the foot on a sturdy and stable wooden board (that is around 2-3 inches tall) while your heels extend off and touch the floor. This will be your starting position.","With the toes pointing either straight (to hit all parts equally), inwards (for emphasis on the outer head) or outwards (for emphasis on the inner head), raise the heels off the floor as you exhale by contracting the calves. Hold the top contraction for a second.","As you inhale, go back to the starting position by slowly lowering the heels.","Repeat for the recommended amount of times."],"Category":"strength"},"105":{"Name":"Standing Dumbbell Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Standing with your feet shoulder width apart, take a dumbbell in each hand. Raise the dumbbells to head height, the elbows out and about 90 degrees. This will be your starting position.","Maintaining strict technique with no leg drive or leaning back, extend through the elbow to raise the weights together directly above your head.","Pause, and slowly return the weight to the starting position."],"Category":"strength"},"106":{"Name":"Standing Dumbbell Reverse Curl","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":["forearms"],"Instructions":["To begin, stand straight with a dumbbell in each hand using a pronated grip (palms facing down). Your arms should be fully extended while your feet are shoulder width apart from each other. This is the starting position.","While holding the upper arms stationary, curl the weights while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Hold the contracted position for a second as you squeeze the muscle.","Slowly begin to bring the dumbbells back to starting position as your breathe in.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"107":{"Name":"Standing Dumbbell Straight-Arm Front Delt Raise Above Head","Force":"push","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["Hold the dumbbells in front of your thighs, palms facing your thighs.","Keep your arms straight with a slight bend at the elbows but keep them locked. This will be your starting position.","Raise the dumbbells in a semicircular motion to arm's length overhead as you exhale.","Slowly return to the starting position using the same path as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"108":{"Name":"Standing Dumbbell Triceps Extension","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":[],"Instructions":["To begin, stand up with a dumbbell held by both hands. Your feet should be about shoulder width apart from each other. Slowly use both hands to grab the dumbbell and lift it over your head until both arms are fully extended.","The resistance should be resting in the palms of your hands with your thumbs around it. The palm of the hands should be facing up towards the ceiling. This will be your starting position.","Keeping your upper arms close to your head with elbows in and perpendicular to the floor, lower the resistance in a semicircular motion behind your head until your forearms touch your biceps. Tip: The upper arms should remain stationary and only the forearms should move. Breathe in as you perform this step.","Go back to the starting position by using the triceps to raise the dumbbell. Breathe out as you perform this step.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"109":{"Name":"Standing Dumbbell Upright Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["traps"],"SecondaryMuscles":["biceps","shoulders"],"Instructions":["Grasp a dumbbell in each hand with a pronated (palms forward) grip that is slightly less than shoulder width. The dumbbells should be resting on top of your thighs. Your arms should be extended with a slight bend at the elbows and your back should be straight. This will be your starting position.","Use your side shoulders to lift the dumbbells as you exhale. The dumbbells should be close to the body as you move it up and the elbows should drive the motion. Continue to lift them until they nearly touch your chin. Tip: Your elbows should drive the motion. As you lift the dumbbells, your elbows should always be higher than your forearms. Also, keep your torso stationary and pause for a second at the top of the movement.","Lower the dumbbells back down slowly to the starting position. Inhale as you perform this portion of the movement.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"110":{"Name":"Standing Inner-Biceps Curl","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Stand up with a dumbbell in each hand being held at arms length. The elbows should be close to the torso. Your legs should be at about shoulder's width apart from each other.","Rotate the palms of the hands so that they are facing inward in a neutral position. This will be your starting position.","While holding the upper arms stationary, curl the weights out while contracting the biceps as you breathe out. Your wrist should turn so that when the weights are fully elevated you have supinated grip (palms facing up).","Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level. Tip: Keep the forearms aligned with your outer deltoids.","Hold the contracted position for a second as you squeeze the biceps.","Slowly begin to bring the dumbbells back to the starting position as your breathe in. Remember to rotate the wrists as you lower the weight in order to switch back to a neutral grip.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"111":{"Name":"Standing One-Arm Dumbbell Curl Over Incline Bench","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Stand on the back side of an incline bench as if you were going to be a spotter for someone. Have a dumbbell in one hand and rest it across the incline bench with a supinated (palms up) grip.","Position your non lifting hand at the corner or side of the incline bench. The chest should be pressed against the top part of the incline and your feet should be pressed against the floor at a wide stance. This is the starting position.","While holding the upper arm stationary, curl the dumbbell upward while contracting the biceps as you breathe out. Only the forearms should move. Continue the movement until your biceps are fully contracted and the dumbbell is at shoulder level. Hold the contracted position for a second.","Slowly begin to bring the dumbbells back to starting position as your breathe in.","Repeat for the recommended amount of repetitions.","Switch arms while performing this exercise."],"Category":"strength"},"112":{"Name":"Standing One-Arm Dumbbell Triceps Extension","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["To begin, stand up with a dumbbell held in one hand. Your feet should be about shoulder width apart from each other. Now fully extend the arm with the dumbbell over your head. Tip: The small finger of your hand should be facing the ceiling and the palm of your hand should be facing forward. The dumbbell should be above your head.","This will be your starting position.","Keeping your upper arm close to your head (elbows in) and perpendicular to the floor, lower the resistance in a semicircular motion behind your head until your forearm touch your bicep. Tip: The upper arm should remain stationary and only the forearm should move. Breathe in as you perform this step.","Go back to the starting position by using the triceps to raise the dumbbell. Breathe out as you perform this step.","Repeat for the recommended amount of repetitions.","Switch arms and repeat the exercise."],"Category":"strength"},"113":{"Name":"Standing Palm-In One-Arm Dumbbell Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Start by having a dumbbell in one hand with your arm fully extended to the side using a neutral grip. Use your other arm to hold on to an incline bench to keep your balance.","Your feet should be shoulder width apart from each other. Now slowly lift the dumbbell up until you create a 90 degree angle with your arm. Note: Your forearm should be perpendicular to the floor. Continue to maintain a neutral grip throughout the entire exercise.","Slowly lift the dumbbell up until your arm is fully extended. This the starting position.","While inhaling lower the weight down until your arm is at a 90 degree angle again.","Feel the contraction for a second and then lift the weight back up towards the starting position while exhaling. Remember to hold on to the incline bench and keep your feet positioned to keep balance during the exercise.","Repeat for the recommended amount of repetitions.","Switch arms and repeat the exercise."],"Category":"strength"},"114":{"Name":"Standing Palms-In Dumbbell Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Start by having a dumbbell in each hand with your arm fully extended to the side using a neutral grip. Your feet should be shoulder width apart from each other. Now slowly lift the dumbbells up until you create a 90 degree angle with your arms. Note: Your forearms should be perpendicular to the floor. This the starting position.","Continue to maintain a neutral grip throughout the entire exercise. Slowly lift the dumbbells up until your arms are fully extended.","While inhaling lower the weights down until your arm is at a 90 degree angle again.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"115":{"Name":"Stiff-Legged Dumbbell Deadlift","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["glutes","lower back"],"Instructions":["Grasp a couple of dumbbells holding them by your side at arm's length.","Stand with your torso straight and your legs spaced using a shoulder width or narrower stance. The knees should be slightly bent. This is your starting position.","Keeping the knees stationary, lower the dumbbells to over the top of your feet by bending at the waist while keeping your back straight. Keep moving forward as if you were going to pick something from the floor until you feel a stretch on the hamstrings. Exhale as you perform this movement","Start bringing your torso up straight again by extending your hips and waist until you are back at the starting position. Inhale as you perform this movement.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"116":{"Name":"Straight-Arm Dumbbell Pullover","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["chest"],"SecondaryMuscles":["lats","shoulders","triceps"],"Instructions":["Place a dumbbell standing up on a flat bench.","Ensuring that the dumbbell stays securely placed at the top of the bench, lie perpendicular to the bench (torso across it as in forming a cross) with only your shoulders lying on the surface. Hips should be below the bench and legs bent with feet firmly on the floor. The head will be off the bench as well.","Grasp the dumbbell with both hands and hold it straight over your chest at arms length. Both palms should be pressing against the underside one of the sides of the dumbbell. This will be your starting position.\nCaution: Always ensure that the dumbbell used for this exercise is secure. Using a dumbbell with loose plates can result in the dumbbell falling apart and falling on your face.","While keeping your arms straight, lower the weight slowly in an arc behind your head while breathing in until you feel a stretch on the chest.","At that point, bring the dumbbell back to the starting position using the arc through which the weight was lowered and exhale as you perform this movement.","Hold the weight on the initial position for a second and repeat the motion for the prescribed number of repetitions."],"Category":"strength"},"117":{"Name":"Tate Press","Force":"push","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["Lie down on a flat bench with a dumbbell in each hand on top of your thighs. The palms of your hand will be facing each other.","By using your thighs to help you get the dumbbells up, clean the dumbbells one arm at a time so that you can hold them in front of you at shoulder width. Note: when holding the dumbbells in front of you, make sure your arms are wider than shoulder width apart from each other using a pronated (palms forward) grip. Allow your elbows to point out. This is your starting position.","Keeping the upper arms stationary, slowly move the dumbbells in and down in a semi circular motion until they touch the upper chest while inhaling. Keep full control of the dumbbells at all times and do not move the upper arms nor rest the dumbbells on the chest.","As you breathe out, move the dumbbells up using your triceps and the same semi-circular motion but in reverse. Attempt to keep the dumbbells together as they move up. Lock your arms in the contracted position, hold for a second and then start coming down again slowly again. Tip: It should take at least twice as long to go down than to come up.","Repeat the movement for the prescribed amount of repetitions of your training program."],"Category":"strength"},"118":{"Name":"Tricep Dumbbell Kickback","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["triceps"],"SecondaryMuscles":[],"Instructions":["Start with a dumbbell in each hand and your palms facing your torso. Keep your back straight with a slight bend in the knees and bend forward at the waist. Your torso should be almost parallel to the floor. Make sure to keep your head up. Your upper arms should be close to your torso and parallel to the floor. Your forearms should be pointed towards the floor as you hold the weights. There should be a 90-degree angle formed between your forearm and upper arm. This is your starting position.","Now, while keeping your upper arms stationary, exhale and use your triceps to lift the weights until the arm is fully extended. Focus on moving the forearm.","After a brief pause at the top contraction, inhale and slowly lower the dumbbells back down to the starting position.","Repeat the movement for the prescribed amount of repetitions."],"Category":"strength"},"119":{"Name":"Two-Arm Dumbbell Preacher Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Grab a dumbbell with each arm and place the upper arms on top of the preacher bench or the incline bench. The dumbbell should be held at shoulder length. This will be your starting position.","As you breathe in, slowly lower the dumbbells until your upper arm is extended and the biceps is fully stretched.","As you exhale, use the biceps to curl the weights up until your biceps is fully contracted and the dumbbells are at shoulder height.","Squeeze the biceps hard for a second at the contracted position and repeat for the recommended amount of repetitions."],"Category":"strength"},"120":{"Name":"Vertical Swing","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["glutes","quadriceps","shoulders"],"Instructions":["Allow the dumbbell to hang at arms length between your legs, holding it with both hands. Keep your back straight and your head up.","Swing the dumbbell between your legs, flexing at the hips and bending the knees slightly.","Powerfully reverse the motion by extending at the hips, knees, and ankles to propel yourself upward, swinging the dumbell over your head.","As you land, absorb the impact through your legs and draw the dumbbell to your torso before the next repetition."],"Category":"plyometrics"},"121":{"Name":"Zottman Curl","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":["forearms"],"Instructions":["Stand up with your torso upright and a dumbbell in each hand being held at arms length. The elbows should be close to the torso.","Make sure the palms of the hands are facing each other. This will be your starting position.","While holding the upper arm stationary, curl the weights while contracting the biceps as you breathe out. Only the forearms should move. Your wrist should rotate so that you have a supinated (palms up) grip. Continue the movement until your biceps are fully contracted and the dumbbells are at shoulder level.","Hold the contracted position for a second as you squeeze the biceps.","Now during the contracted position, rotate your wrist until you now have a pronated (palms facing down) grip with the thumb at a higher position than the pinky.","Slowly begin to bring the dumbbells back down using the pronated grip.","As the dumbbells close your thighs, start rotating the wrist so that you go back to a neutral (palms facing your body) grip.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"122":{"Name":"Zottman Preacher Curl","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"dumbbell","PrimaryMuscles":["biceps"],"SecondaryMuscles":["forearms"],"Instructions":["Grab a dumbbell in each hand and place your upper arms on top of the preacher bench or the incline bench. The dumbbells should be held at shoulder height and the elbows should be flexed. Hold the dumbbells with the palms of your hands facing down. This will be your starting position.","As you breathe in, slowly lower the dumbbells keeping the palms down until your upper arm is extended and your biceps are fully stretched.","Now rotate your wrists once you are at the bottom of the movement so that the palms of the hands are facing up.","As you exhale, use your biceps to curl the weights up until they are fully contracted and the dumbbells are at shoulder height. Again, remember that to ensure full contraction you need to bring that small finger higher than the thumb.","Squeeze the biceps hard for a second at the contracted position and rotate your wrists so that the palms are facing down again.","Repeat for the recommended amount of repetitions."],"Category":"strength"}}