{"0":{"Name":"Advanced Kettlebell Windmill","Force":"push","Level":"intermediate","Mechanic":"isolation","Equipment":"kettlebells","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["glutes","hamstrings","shoulders"],"Instructions":["Clean and press a kettlebell overhead with one arm.","Keeping the kettlebell locked out at all times, push your butt out in the direction of the locked out kettlebell. Keep the non-working arm behind your back and turn your feet out at a forty-five degree angle from the arm with the kettlebell.","Lower yourself as far as possible.","Pause for a second and reverse the motion back to the starting position."],"Category":"strength"},"1":{"Name":"Alternating Floor Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["chest"],"SecondaryMuscles":["abdominals","shoulders","triceps"],"Instructions":["Lie on the floor with two kettlebells next to your shoulders.","Position one in place on your chest and then the other, gripping the kettlebells on the handle with the palms facing forward.","Extend both arms, so that the kettlebells are being held above your chest. Lower one kettlebell, bringing it to your chest and turn the wrist in the direction of the locked out kettlebell.","Raise the kettlebell and repeat on the opposite side."],"Category":"strength"},"2":{"Name":"Alternating Hang Clean","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["biceps","calves","forearms","glutes","lower back","traps"],"Instructions":["Place two kettlebells between your feet. To get in the starting position, push your butt back and look straight ahead.","Clean one kettlebell to your shoulder and hold on to the other kettlebell in a hanging position. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulders. Rotate your wrist as you do so.","Lower the cleaned kettlebell to a hanging position and clean the alternate kettlebell. Repeat."],"Category":"strength"},"3":{"Name":"Alternating Kettlebell Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Clean two kettlebells to your shoulders. Clean the kettlebells to your shoulders by extending through the legs and hips as you pull the kettlebells towards your shoulders. Rotate your wrists as you do so.","Press one directly overhead by extending through the elbow, turning it so the palm faces forward while holding the other kettlebell stationary .","Lower the pressed kettlebell to the starting position and immediately press with your other arm."],"Category":"strength"},"4":{"Name":"Alternating Kettlebell Row","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"kettlebells","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Place two kettlebells in front of your feet. Bend your knees slightly and push your butt out as much as possible. As you bend over to get into the starting position grab both kettlebells by the handles.","Pull one kettlebell off of the floor while holding on to the other kettlebell. Retract the shoulder blade of the working side, as you flex the elbow, drawing the kettlebell towards your stomach or rib cage.","Lower the kettlebell in the working arm and repeat with your other arm."],"Category":"strength"},"5":{"Name":"Alternating Renegade Row","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["middle back"],"SecondaryMuscles":["abdominals","biceps","chest","lats","triceps"],"Instructions":["Place two kettlebells on the floor about shoulder width apart. Position yourself on your toes and your hands as though you were doing a pushup, with the body straight and extended. Use the handles of the kettlebells to support your upper body. You may need to position your feet wide for support.","Push one kettlebell into the floor and row the other kettlebell, retracting the shoulder blade of the working side as you flex the elbow, pulling it to your side.","Then lower the kettlebell to the floor and begin the kettlebell in the opposite hand. Repeat for several reps."],"Category":"strength"},"6":{"Name":"Bent Press","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["glutes","hamstrings","lower back","quadriceps","shoulders","triceps"],"Instructions":["Clean a kettlebell to your shoulder. Clean the kettlebell to your shoulders by extending through the legs and hips as you raise the kettlebell towards your shoulder. The wrist should rotate as you do so. This will be your starting position.","Begin my leaning to the side opposite the kettlebell, continuing until you are able to touch the ground with your free hand, keeping your eyes on the kettlebell. As you do so, press the weight vertically be extending through the elbow, keeping your arm perpendicular to the ground.","Return to an upright position, with the kettlebell above your head. Return the kettlebell to the shoulder and repeat for the desired number of repetitions."],"Category":"strength"},"7":{"Name":"Bottoms-Up Clean From The Hang Position","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["forearms"],"SecondaryMuscles":["biceps","shoulders"],"Instructions":["Initiate the exercise by standing upright with a kettlebell in one hand.","Swing the kettlebell back forcefully and then reverse the motion forcefully. Crush the kettlebell handle as hard as possible and raise the kettlebell to your shoulder."],"Category":"strength"},"8":{"Name":"Double Kettlebell Alternating Hang Clean","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["biceps","calves","forearms","glutes","lower back","quadriceps","traps"],"Instructions":["Place two kettlebells between your feet. To get in the starting position, push your butt back and look straight ahead.","Clean one kettlebell to your shoulder and hold on to the other kettlebell.","With a fluid motion, lower the top kettlebell while driving the bottom kettlebell up."],"Category":"strength"},"9":{"Name":"Double Kettlebell Jerk","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["calves","quadriceps","triceps"],"Instructions":["Hold a kettlebell by the handle in each hand.","Clean the kettlebells to your shoulders by extending through the legs and hips as you pull the kettlebells towards your shoulders. Rotate your wrists as you do so, so that the palms face forward. This will be your starting position.","Dip your body by bending the knees, keeping your torso upright.","Immediately reverse direction, driving through the heels, in essence jumping to create momentum.","As you do so, press the kettlebells overhead to lockout by extending the arms, using your body's momentum to move the weights.","Return your feet to the ground in a split fashion, with one foot forward and one foot back.","Keeping the weights overhead, return to a standing position, bringing your feet together. Lower the weights to perform the next repetition."],"Category":"strength"},"10":{"Name":"Double Kettlebell Push Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["calves","quadriceps","triceps"],"Instructions":["Clean two kettlebells to your shoulders.","Squat down a few inches and reverse the motion rapidly. Use the momentum from the legs to drive the kettlebells overhead.","Once the kettlebells are locked out, lower the kettlebells to your shoulders and repeat."],"Category":"strength"},"11":{"Name":"Double Kettlebell Snatch","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["glutes","hamstrings","quadriceps"],"Instructions":["Place two kettlebells behind your feet. Bend your knees and sit back to pick up the kettlebells.","Swing the kettlebells between your legs forcefully and reverse the direction.","Drive through with your hips and lock the ketttlebells overhead in one uninterrupted motion."],"Category":"strength"},"12":{"Name":"Double Kettlebell Windmill","Force":"pull","Level":"intermediate","Mechanic":null,"Equipment":"kettlebells","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["glutes","hamstrings","shoulders","triceps"],"Instructions":["Place a kettlebell in front of your front foot and clean and press a kettlebell overhead with your opposite arm. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulders. Rotate your wrist as you do so, so that the palm faces forward.","Keeping the kettlebell locked out at all times, push your butt out in the direction of the locked out kettlebell. Turn your feet out at a forty-five degree angle from the arm with the locked out kettlebell.","Bending at the hip to one side, sticking your butt out, slowly lean until you can retrieve the kettlebell from the floor. Keep your eyes on the kettlebell that you hold over your head at all times.","Pause for a second after retrieving the kettlebell from the ground and reverse the motion back to the starting position."],"Category":"strength"},"13":{"Name":"Extended Range One-Arm Kettlebell Floor Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Lie on the floor and position a kettlebell for one arm to press. The kettlebell should be held by the handle. The leg on the same side that you are pressing should be bent, with the knee crossing over the midline of the body.","Press the kettlebell by extending the elbow and adducting the arm, pressing it above your body. Return to the starting position."],"Category":"strength"},"14":{"Name":"Front Squats With Two Kettlebells","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes"],"Instructions":["Clean two kettlebells to your shoulders. Clean the kettlebells to your shoulders by extending through the legs and hips as you pull the kettlebells towards your shoulders. Rotate your wrists as you do so.","Looking straight ahead at all times, squat as low as you can and pause at the bottom. As you squat down, push your knees out. You should squat between your legs, keeping an upright torso, with your head and chest up.","Rise back up by driving through your heels and repeat."],"Category":"strength"},"15":{"Name":"Goblet Squat","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","shoulders"],"Instructions":["Stand holding a light kettlebell by the horns close to your chest. This will be your starting position.","Squat down between your legs until your hamstrings are on your calves. Keep your chest and head up and your back straight.","At the bottom position, pause and use your elbows to push your knees out. Return to the starting position, and repeat for 10-20 repetitions."],"Category":"strength"},"16":{"Name":"Kettlebell Arnold Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Clean a kettlebell to your shoulder. Clean the kettlebell to your shoulder by extending through the legs and hips as you raise the kettlebell towards your shoulder. The palm should be facing inward.","Looking straight ahead, press the kettlebell out and overhead, rotating your wrist so that your palm faces forward at the top of the motion.","Return the kettlebell to the starting position, with the palm facing in."],"Category":"strength"},"17":{"Name":"Kettlebell Dead Clean","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","glutes","lower back","quadriceps","traps"],"Instructions":["Place kettlebell between your feet. To get in the starting position, push your butt back and look straight ahead.","Clean the kettlebell to your shoulder. Clean the kettlebell to your shoulders by extending through the legs and hips as you raise the kettlebell towards your shoulder. The wrist should rotate as you do so.","Lower the kettlebell, keeping the hamstrings loaded by keeping your back straight and your butt out."],"Category":"strength"},"18":{"Name":"Kettlebell Figure 8","Force":"pull","Level":"intermediate","Mechanic":null,"Equipment":"kettlebells","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["hamstrings","shoulders"],"Instructions":["Place one kettlebell between your legs and take a wider than shoulder width stance. Bend over by pushing your butt out and keeping your back flat.","Pick up a kettlebell and pass it to your other hand between your legs. The receiving hand should reach from behind the legs. Go back and forth for several repetitions."],"Category":"strength"},"19":{"Name":"Kettlebell Hang Clean","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","glutes","lower back","shoulders","traps"],"Instructions":["Place kettlebell between your feet. To get in the starting position, push your butt back and look straight ahead.","Clean kettlebell to your shoulder. Clean the kettlebell to your shoulders by extending through the legs and hips as you raise the kettlebell towards your shoulder. The wrist should rotate as you do so.","Lower kettlebell to a hanging position between your legs while keeping the hamstrings loaded. Keep your head up at all times."],"Category":"strength"},"20":{"Name":"Kettlebell One-Legged Deadlift","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["glutes","lower back"],"Instructions":["Hold a kettlebell by the handle in one hand. Stand on one leg, on the same side that you hold the kettlebell.","Keeping that knee slightly bent, perform a stiff legged deadlift by bending at the hip, extending your free leg behind you for balance.","Continue lowering the kettlebell until you are parallel to the ground, and then return to the upright position."],"Category":"strength"},"21":{"Name":"Kettlebell Pass Between The Legs","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["glutes","hamstrings","shoulders"],"Instructions":["Place one kettlebell between your legs and take a comfortable stance. Bend over by pushing your butt out and keeping your back flat.","Pick up a kettlebell and pass it to your other hand between your legs, in the fashion of a \"W\". Go back and forth for several repetitions."],"Category":"strength"},"22":{"Name":"Kettlebell Pirate Ships","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["abdominals"],"Instructions":["With a wide stance, hold a kettlebell with both hands. Allow it to hang at waist level with your arms extended. This will be your starting position.","Initiate the movement by turning to one side, swinging the kettlebell to head height. Briefly pause at the top of the motion.","Allow the bell to drop as you rotate to the opposite side, again raising the kettlebell to head height.","Repeat for the desired amount of repetitions."],"Category":"strength"},"23":{"Name":"Kettlebell Pistol Squat","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","shoulders"],"Instructions":["Pick up a kettlebell with two hands and hold it by the horns. Hold one leg off of the floor and squat down on the other.","Squat down by flexing the knee and sitting back with the hips, holding the kettlebell up in front of you.","Hold the bottom position for a second and then reverse the motion, driving through the heel and keeping your head and chest up.","Lower yourself again and repeat."],"Category":"strength"},"24":{"Name":"Kettlebell Seated Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Sit on the floor and spread your legs out comfortably.","Clean one kettlebell to your shoulder.","Press the kettlebell up and out until it is locked out overhead. Return to the starting position."],"Category":"strength"},"25":{"Name":"Kettlebell Seesaw Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Clean two kettlebells two your shoulders.","Press one kettlebell.","Lower the kettlebell and immediately press the other kettlebell. Make sure to do the same amount of reps on both sides."],"Category":"strength"},"26":{"Name":"Kettlebell Sumo High Pull","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["traps"],"SecondaryMuscles":["adductors","glutes","hamstrings","quadriceps","shoulders"],"Instructions":["Place a kettlebell on the ground between your feet. Position your feet in a wide stance, and grasp the kettlebell with two hands. Set your hips back as far as possible, with your knees bent. Keep your chest and head up. This will be your starting position.","Begin by extending the hips and knees, simultaneously pulling the kettlebell to your shoulders, raising your elbows as you do so. Reverse the motion to return to the starting position."],"Category":"strength"},"27":{"Name":"Kettlebell Thruster","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["quadriceps","triceps"],"Instructions":["Clean two kettlebells to your shoulders. Clean the kettlebells to your shoulders by extending through the legs and hips as you pull the kettlebells towards your shoulders. Rotate your wrists as you do so. This will be your starting position.","Begin to squat by flexing your hips and knees, lowering your hips between your legs. Maintain an upright, straight back as you descend as low as you can.","At the bottom, reverse direction and squat by extending your knees and hips, driving through your heels. As you do so, press both kettlebells overhead by extending your arms straight up, using the momentum from the squat to help drive the weights upward.","As you begin the next repetition, return the weights to the shoulders."],"Category":"strength"},"28":{"Name":"Kettlebell Turkish Get-Up (Lunge style)","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["abdominals","hamstrings","quadriceps","triceps"],"Instructions":["Lie on your back on the floor and press a kettlebell to the top position by extending the elbow. Bend the knee on the same side as the kettlebell.","Keeping the kettlebell locked out at all times, pivot to the opposite side and use your non- working arm to assist you in driving forward to the lunge position. Using your free hand, push yourself to a seated position, then progressing to one knee.","While looking up at the kettlebell, slowly stand up. Reverse the motion back to the starting position and repeat."],"Category":"strength"},"29":{"Name":"Kettlebell Turkish Get-Up (Squat style)","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["abdominals","calves","hamstrings","quadriceps","triceps"],"Instructions":["Lie on your back on the floor and press a kettlebell to the top position by extending the elbow. Bend the knee on the same side as the kettlebell.","Keeping the kettlebell locked out at all times, pivot to the opposite side and use your non- working arm to assist you in driving forward to the lunge position.","Using your free hand, push yourself to a seated position, then progressing to your feet. While looking up at the kettlebell, slowly stand up. Reverse the motion back to the starting position and repeat."],"Category":"strength"},"30":{"Name":"Kettlebell Windmill","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["glutes","hamstrings","shoulders","triceps"],"Instructions":["Place a kettlebell in front of your lead foot and clean and press it overhead with your opposite arm. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulders. Rotate your wrist as you do so, so that the palm faces forward. Press it overhead by extending the elbow.","Keeping the kettlebell locked out at all times, push your butt out in the direction of the locked out kettlebell. Turn your feet out at a forty-five degree angle from the arm with the locked out kettlebell. Bending at the hip to one side, sticking your butt out, slowly lean until you can touch the floor with your free hand. Keep your eyes on the kettlebell that you hold over your head at all times.","Pause for a second after reaching the ground and reverse the motion back to the starting position."],"Category":"strength"},"31":{"Name":"Leg-Over Floor Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Lie on the floor with one kettlebell in place on your chest, holding it by the handle. Extend leg on working side over leg on non-working side.Your free arm can be extended out to your side for support.","Press the kettlebll into a locked out position.","Lower the weight until the elbow touches the ground, keeping the kettlebell above the elbow. Repeat for the desired number of repetitions."],"Category":"strength"},"32":{"Name":"Lunge Pass Through","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","glutes","quadriceps"],"Instructions":["Stand with your torso upright holding a kettlebell in your right hand. This will be your starting position.","Step forward with your left foot and lower your upper body down by flexing the hip and the knee, keeping the torso upright. Lower your back knee until it nearly touches the ground.","As you lunge, pass the kettlebell under your front leg to your opposite hand.","Pressing through the heel of your foot, return to the starting position.","Repeat the movement for the recommended amount of repetitions, alternating legs."],"Category":"strength"},"33":{"Name":"One-Arm Kettlebell Clean","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["glutes","lower back","shoulders","traps"],"Instructions":["Place a kettlebell between your feet. As you bend down to grab the kettlebell, push your butt back and keep your eyes looking forward.","Clean the kettlebell to your shoulders by extending through the legs and hips as you raise the kettlebell towards your shoulder. The wrist should rotate as you do so.","Return the weight to the starting position."],"Category":"strength"},"34":{"Name":"One-Arm Kettlebell Clean and Jerk","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["Hold a kettlebell by the handle.","Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulder. Rotate your wrist as you do so, so that the palm faces forward.","Dip your body by bending the knees, keeping your torso upright.","Immediately reverse direction, driving through the heels, in essence jumping to create momentum. As you do so, press the kettlebell overhead to lockout by extending the arms, using your body's momentum to move the weight.","Receive the weight overhead by returning to a squat position underneath the weight.","Keeping the weight overhead, return to a standing position. Lower the weight to the floor to perform the next repetition."],"Category":"strength"},"35":{"Name":"One-Arm Kettlebell Floor Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["chest"],"SecondaryMuscles":["triceps"],"Instructions":["Lie on the floor holding a kettlebell with one hand, with your upper arm supported by the floor. The palm should be facing in.","Press the kettlebell straight up toward the ceiling, rotating your wrist.","Lower the kettlebell back to the starting position and repeat."],"Category":"strength"},"36":{"Name":"One-Arm Kettlebell Jerk","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["calves","quadriceps","triceps"],"Instructions":["Hold a kettlebell by the handle. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulder. Rotate your wrist as you do so, so that the palm faces forward. This will be your starting position.","Dip your body by bending the knees, keeping your torso upright.","Immediately reverse direction, driving through the heels, in essence jumping to create momentum. As you do so, press the kettlebell overhead to lockout by extending the arms, using your body's momentum to move the weight. Receive the weight overhead by returning to a squat position underneath the weight. Keeping the weight overhead, return to a standing position.","Lower the weight to perform the next repetition."],"Category":"strength"},"37":{"Name":"One-Arm Kettlebell Military Press To The Side","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Clean a kettlebell to your shoulder. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulder. Rotate your wrist as you do so, so that the palm faces inward. This will be your starting position.","Look at the kettlebell and press it up and out until it is locked out overhead.","Lower the kettlebell back to your shoulder under control and repeat. Make sure to contract your lat, butt, and stomach forcefully for added stability and strength."],"Category":"strength"},"38":{"Name":"One-Arm Kettlebell Para Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Clean a kettlebell to your shoulder. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulder. Rotate your wrist as you do so, so that the palm faces forward. This will be your starting position.","Hold the kettlebell with the elbow out to the side, and press it up and out until it is locked out overhead.","Lower the kettlebell back to your shoulder under control and repeat. Make sure to contract your lat, butt, and stomach forcefully for added stability and strength."],"Category":"strength"},"39":{"Name":"One-Arm Kettlebell Push Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["calves","quadriceps","triceps"],"Instructions":["Hold a kettlebell by the handle. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulder. Rotate your wrist as you do so, so that the palm faces forward. This will be your starting position.","Dip your body by bending the knees, keeping your torso upright.","Immediately reverse direction, driving through the heels, in essence jumping to create momentum. As you do so, press the kettlebell overhead to lockout by extending the arms, using your body's momentum to move the weight. Lower the weight to perform the next repetition."],"Category":"strength"},"40":{"Name":"One-Arm Kettlebell Row","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Place a kettlebell in front of your feet. Bend your knees slightly and then push your butt out as much as possible as you bend over to get in the starting position. Grab the kettlebell and pull it to your stomach, retracting your shoulder blade and flexing the elbow. Keep your back straight. Lower and repeat."],"Category":"strength"},"41":{"Name":"One-Arm Kettlebell Snatch","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["calves","glutes","hamstrings","lower back","traps","triceps"],"Instructions":["Place a kettlebell between your feet. Bend your knees and push your butt back to get in the proper starting position.","Look straight ahead and swing the kettlebell back between your legs.","Immediately reverse the direction and drive through with your hips and knees, accelerating the kettlebell upward. As the kettlebell rises to your shoulder rotate your hand and punch straight up, using momentum to receive the weight locked out overhead."],"Category":"strength"},"42":{"Name":"One-Arm Kettlebell Split Jerk","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["glutes","hamstrings","quadriceps","triceps"],"Instructions":["Hold a kettlebell by the handle. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulder. Rotate your wrist as you do so, so that the palm faces forward. This will be your starting position.","Dip your body by bending the knees, keeping your torso upright.","Immediately reverse direction, driving through the heels, in essence jumping to create momentum. As you do so, press the kettlebell overhead to lockout by extending the arms, using your body's momentum to move the weight.","Receive the weight overhead by returning to a squat position underneath the weight, positioning one leg in front of you and one leg behind you.","Keeping the weight overhead, return to a standing position and bring your feet together. Lower the weight to perform the next repetition."],"Category":"strength"},"43":{"Name":"One-Arm Kettlebell Split Snatch","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["hamstrings","quadriceps"],"Instructions":["Hold a kettlebell in one hand by the handle.","Squat towards the floor, and then reverse the motion, extending the hips, knees, and finally the ankles, to raise the kettlebell overhead.","After fully extending the body, descend into a lunge position to receive the weights overhead, one leg forward and one leg back. Ensure you drive through with your hips and lock the ketttlebells overhead in one uninterrupted motion.","Return to a standing position, holding the weight overhead, and bring the feet together. Lower the weight to return to the starting position."],"Category":"strength"},"44":{"Name":"One-Arm Kettlebell Swings","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","glutes","lower back","shoulders"],"Instructions":[],"Category":"strength"},"45":{"Name":"One-Arm Open Palm Kettlebell Clean","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["forearms","glutes","lower back","quadriceps","shoulders"],"Instructions":["Place one kettlebell between your feet.","Grab the handle with one hand and raise the kettlebell rapidly, let it flip so that the ball of the kettlebell lands in the palm of your hand.","Throw the kettlebell out in front of you and catch the handle with one hand.","Take the kettlebell to the floor and repeat. Make sure to work both arms."],"Category":"strength"},"46":{"Name":"One-Arm Overhead Kettlebell Squats","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","shoulders"],"Instructions":["Clean and press a kettlebell with one arm. Clean the kettlebell to your shoulder by extending through the legs and hips as you pull the kettlebell towards your shoulder. Rotate your wrist as you do so. Press the weight overhead by extending through the elbow.This will be your starting position.","Looking straight ahead and keeping a kettlebell locked out above you, flex the knees and hips and lower your torso between your legs, keeping your head and chest up.","Pause at the bottom position for a second before rising back to the top, driving through the heels of your feet."],"Category":"strength"},"47":{"Name":"Open Palm Kettlebell Clean","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["glutes","lower back","quadriceps","shoulders"],"Instructions":["Place one kettlebell between your feet. Clean the kettlebell by extending through the legs and hips as you raise the kettlebell towards your shoulders.","Release the kettlebell as it comes up, and let it flip so that the ball of the kettlebell lands in the palms of your hands.","Release the kettlebell out in front of you and catch the handle with both hands. Lower the kettlebell to the starting position and repeat."],"Category":"strength"},"48":{"Name":"Plyo Kettlebell Pushups","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Place a kettlebell on the floor. Place yourself in a pushup position, on your toes with one hand on the ground and one hand holding the kettlebell, with your elbows extended. This will be your starting position.","Begin by lowering yourself as low as you can, keeping your back straight.","Quickly and forcefully reverse direction, pushing yourself up to the other side of the kettlebell, switching hands as you do so. Continue the movement by descending and repeating the movement back and forth."],"Category":"strength"},"49":{"Name":"Two-Arm Kettlebell Clean","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["calves","glutes","hamstrings","lower back","traps"],"Instructions":["Place two kettlebells between your feet. To get in the starting position, push your butt back and look straight ahead.","Clean the kettlebells to your shoulders by extending through the legs and hips as you raise the kettlebells towards your shoulders. Rotate your wrists as you do so.","Lower the kettlebells back to the starting position and repeat."],"Category":"strength"},"50":{"Name":"Two-Arm Kettlebell Jerk","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["calves","quadriceps","triceps"],"Instructions":["Clean two kettlebells to your shoulders. Clean the kettlebells to your shoulders by extending through the legs and hips as you swing the kettlebells towards your shoulders. Rotate your wrists as you do so, so that the palms face forward. Squat down a few inches and reverse the motion rapidly driving both kettlebells overhead. Immediately after the initial push, squat down again and get under the kettlebells. Once the kettlebells are locked out, stand upright to complete the exercise."],"Category":"strength"},"51":{"Name":"Two-Arm Kettlebell Military Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Clean two kettlebells to your shoulders. Clean the kettlebells to your shoulders by extending through the legs and hips as you swing the kettlebells towards your shoulders. Rotate your wrists as you do so, so that the palms face forward.","Press the kettlebells up and out. As the kettlebells pass your head, lean into the weights so that the kettlebells are racked behind your head. Make sure to contract your lats, butt, and stomach for added stability."],"Category":"strength"},"52":{"Name":"Two-Arm Kettlebell Row","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"kettlebells","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Place two kettlebells in front of your feet. Bend your knees slightly and then push your butt out as much as possible as you bend over to get in the starting position.","Grab both kettlebells and pull them to your stomach, retracting your shoulder blades and flexing the elbows. Keep your back straight. Lower and repeat."],"Category":"strength"}}