{"0":{"Name":"Ab Crunch Machine","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["abdominals"],"SecondaryMuscles":[],"Instructions":["Select a light resistance and sit down on the ab machine placing your feet under the pads provided and grabbing the top handles. Your arms should be bent at a 90 degree angle as you rest the triceps on the pads provided. This will be your starting position.","At the same time, begin to lift the legs up as you crunch your upper torso. Breathe out as you perform this movement. Tip: Be sure to use a slow and controlled motion. Concentrate on using your abs to move the weight while relaxing your legs and feet.","After a second pause, slowly return to the starting position as you breathe in.","Repeat the movement for the prescribed amount of repetitions."],"Category":"strength"},"1":{"Name":"Bicycling, Stationary","Force":null,"Level":"beginner","Mechanic":null,"Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["To begin, seat yourself on the bike and adjust the seat to your height.","Select the desired option from the menu. You may have to start pedaling to turn it on. You can use the manual setting, or you can select a program to use. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise. The level of resistance can be changed throughout the workout. The handles can be used to monitor your heart rate to help you stay at an appropriate intensity."],"Category":"cardio"},"2":{"Name":"Butterfly","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["chest"],"SecondaryMuscles":[],"Instructions":["Sit on the machine with your back flat on the pad.","Take hold of the handles. Tip: Your upper arms should be positioned parallel to the floor; adjust the machine accordingly. This will be your starting position.","Push the handles together slowly as you squeeze your chest in the middle. Breathe out during this part of the motion and hold the contraction for a second.","Return back to the starting position slowly as you inhale until your chest muscles are fully stretched.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"3":{"Name":"Calf-Machine Shoulder Shrug","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["traps"],"SecondaryMuscles":[],"Instructions":["Position yourself on the calf machine so that the shoulder pads are above your shoulders. Your torso should be straight with the arms extended normally by your side. This will be your starting position.","Raise your shoulders up towards your ears as you exhale and hold the contraction for a full second.","Slowly return to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"4":{"Name":"Calf Press","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["calves"],"SecondaryMuscles":[],"Instructions":["Adjust the seat so that your legs are only slightly bent in the start position. The balls of your feet should be firmly on the platform.","Select an appropriate weight, and grasp the handles. This will be your starting position.","Straighten the legs by extending the knees, just barely lifting the weight from the stack. Your ankle should be fully flexed, toes pointing up. Execute the movement by pressing downward through the balls of your feet as far as possible.","After a brief pause, reverse the motion and repeat."],"Category":"strength"},"5":{"Name":"Calf Press On The Leg Press Machine","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["calves"],"SecondaryMuscles":[],"Instructions":["Using a leg press machine, sit down on the machine and place your legs on the platform directly in front of you at a medium (shoulder width) foot stance.","Lower the safety bars holding the weighted platform in place and press the platform all the way up until your legs are fully extended in front of you without locking your knees. (Note: In some leg press units you can leave the safety bars on for increased safety. If your leg press unit allows for this, then this is the preferred method of performing the exercise.) Your torso and the legs should make perfect 90-degree angle. Now carefully place your toes and balls of your feet on the lower portion of the platform with the heels extending off. Toes should be facing forward, outwards or inwards as described at the beginning of the chapter. This will be your starting position.","Press on the platform by raising your heels as you breathe out by extending your ankles as high as possible and flexing your calf. Ensure that the knee is kept stationary at all times. There should be no bending at any time. Hold the contracted position by a second before you start to go back down.","Go back slowly to the starting position as you breathe in by lowering your heels as you bend the ankles until calves are stretched.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"6":{"Name":"Chair Squat","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["To begin, first set the bar to a position that best matches your height. Once the bar is loaded, step under it and position it across the back of your shoulders.","Take the bar with your hands facing forward, unlock it and lift it off the rack by extending your legs.","Move your feet forward about 18 inches in front of the bar. Position your legs using a shoulder width stance with the toes slightly pointed out. Look forward at all times and maintain a neutral or slightly arched spine. This will be your starting position.","Slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper and lower leg breaks 90 degrees.","Begin to raise the bar as you exhale by pushing the floor with the heels of your feet, extending the knees and returning to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"7":{"Name":"Decline Smith Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Place a decline bench underneath the Smith machine. Now place the barbell at a height that you can reach when lying down and your arms are almost fully extended. Using a pronated grip that is wider than shoulder width, unlock the bar from the rack and hold it straight over you with your arms extended. This will be your starting position.","As you inhale, lower the bar under control by allowing the elbows to flex, lightly contacting the torso.","After a brief pause, bring the bar back to the starting position by extending the elbows, exhaling as you do so.","Repeat the movement for the prescribed amount of repetitions.","When the set is complete, lock the bar back in the rack."],"Category":"strength"},"8":{"Name":"Dip Machine","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["Sit securely in a dip machine, select the weight and firmly grasp the handles.","Now keep your elbows in at your sides in order to place emphasis on the triceps. The elbows should be bent at a 90 degree angle.","As you contract the triceps, extend your arms downwards as you exhale. Tip: At the bottom of the movement, focus on keeping a little bend in your arms to keep tension on the triceps muscle.","Now slowly let your arms come back up to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"9":{"Name":"Elliptical Trainer","Force":null,"Level":"intermediate","Mechanic":null,"Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["To begin, step onto the elliptical and select the desired option from the menu. Most ellipticals have a manual setting, or you can select a program to run. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise. Elevation can be adjusted to change the intensity of the workout.","The handles can be used to monitor your heart rate to help you stay at an appropriate intensity."],"Category":"cardio"},"10":{"Name":"Glute Ham Raise","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","glutes"],"Instructions":["Begin by adjusting the equipment to fit your body. Place your feet against the footplate in between the rollers as you lie facedown. Your knees should be just behind the pad.","Start from the bottom of the movement. Keep your back arched as you begin the movement by flexing the knees. Drive your toes into the foot plate as you do so. Keep your upper body straight, and continue until your body is upright.","Return to the starting position, keeping your descent under control."],"Category":"powerlifting"},"11":{"Name":"Hack Squat","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Place the back of your torso against the back pad of the machine and hook your shoulders under the shoulder pads provided.","Position your legs in the platform using a shoulder width medium stance with the toes slightly pointed out. Tip: Keep your head up at all times and also maintain the back on the pad at all times.","Place your arms on the side handles of the machine and disengage the safety bars (which on most designs is done by moving the side handles from a facing front position to a diagonal position).","Now straighten your legs without locking the knees. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).","Begin to slowly lower the unit by bending the knees as you maintain a straight posture with the head up (back on the pad at all times). Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to raise the unit as you exhale by pushing the floor with mainly with the heel of your foot as you straighten the legs again and go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"12":{"Name":"Jogging, Treadmill","Force":null,"Level":"beginner","Mechanic":null,"Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["glutes","hamstrings"],"Instructions":["To begin, step onto the treadmill and select the desired option from the menu. Most treadmills have a manual setting, or you can select a program to run. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise. Elevation can be adjusted to change the intensity of the workout.","Treadmills offer convenience, cardiovascular benefits, and usually have less impact than jogging outside. A 150 lb person will burn almost 250 calories jogging for 30 minutes, compared to more than 450 calories running. Maintain proper posture as you jog, and only hold onto the handles when necessary, such as when dismounting or checking your heart rate."],"Category":"cardio"},"13":{"Name":"Leg Extensions","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":[],"Instructions":["For this exercise you will need to use a leg extension machine. First choose your weight and sit on the machine with your legs under the pad (feet pointed forward) and the hands holding the side bars. This will be your starting position. Tip: You will need to adjust the pad so that it falls on top of your lower leg (just above your feet). Also, make sure that your legs form a 90-degree angle between the lower and upper leg. If the angle is less than 90-degrees then that means the knee is over the toes which in turn creates undue stress at the knee joint. If the machine is designed that way, either look for another machine or just make sure that when you start executing the exercise you stop going down once you hit the 90-degree angle.","Using your quadriceps, extend your legs to the maximum as you exhale. Ensure that the rest of the body remains stationary on the seat. Pause a second on the contracted position.","Slowly lower the weight back to the original position as you inhale, ensuring that you do not go past the 90-degree angle limit.","Repeat for the recommended amount of times."],"Category":"strength"},"14":{"Name":"Leg Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Using a leg press machine, sit down on the machine and place your legs on the platform directly in front of you at a medium (shoulder width) foot stance. (Note: For the purposes of this discussion we will use the medium stance described above which targets overall development; however you can choose any of the three stances described in the foot positioning section).","Lower the safety bars holding the weighted platform in place and press the platform all the way up until your legs are fully extended in front of you. Tip: Make sure that you do not lock your knees. Your torso and the legs should make a perfect 90-degree angle. This will be your starting position.","As you inhale, slowly lower the platform until your upper and lower legs make a 90-degree angle.","Pushing mainly with the heels of your feet and using the quadriceps go back to the starting position as you exhale.","Repeat for the recommended amount of repetitions and ensure to lock the safety pins properly once you are done. You do not want that platform falling on you fully loaded."],"Category":"strength"},"15":{"Name":"Leverage Chest Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Load an appropriate weight onto the pins and adjust the seat for your height. The handles should be near the bottom or middle of the pectorals at the beginning of the motion.","Your chest and head should be up and your shoulder blades retracted. This will be your starting position.","Press the handles forward by extending through the elbow.","After a brief pause at the top, return the weight just above the start position, keeping tension on the muscles by not returning the weight to the stops until the set is complete."],"Category":"strength"},"16":{"Name":"Leverage Deadlift","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["glutes","hamstrings"],"Instructions":["Load the pins to an appropriate weight. Position yourself directly between the handles. Grasp the bottom handles with a comfortable grip, and then lower your hips as you take a breath. Look forward with your head and keep your chest up. This will be your starting position.","Return the weight to the starting position."],"Category":"strength"},"17":{"Name":"Leverage Decline Chest Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Load an appropriate weight onto the pins and adjust the seat for your height. The handles should be near the bottom of the pectorals at the beginning of the motion. Your chest and head should be up and your shoulder blades retracted. This will be your starting position.","Press the handles forward by extending through the elbow.","After a brief pause at the top, return the weight just above the start position, keeping tension on the muscles by not returning the weight to the stops until the set is complete."],"Category":"strength"},"18":{"Name":"Leverage High Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["middle back"],"SecondaryMuscles":["lats"],"Instructions":["Load an appropriate weight onto the pins and adjust the seat height so that you can just reach the handles above you. Adjust the knee pad to help keep you down. Grasp the handles with a pronated grip. This will be your starting position.","Pull the handles towards your torso, retracting your shoulder blades as you flex the elbow.","Pause at the bottom of the motion, and then slowly return the handles to the starting position.","For multiple repetitions, avoid completely returning the weight to the stops to keep tension on the muscles being worked."],"Category":"strength"},"19":{"Name":"Leverage Incline Chest Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Load an appropriate weight onto the pins and adjust the seat for your height. The handles should be near the top of the pectorals at the beginning of the motion. Your chest and head should be up and your shoulder blades retracted. This will be your starting position.","Press the handles forward by extending through the elbow.","After a brief pause at the top, return the weight just above the start position, keeping tension on the muscles by not returning the weight to the stops until the set is complete."],"Category":"strength"},"20":{"Name":"Leverage Iso Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["lats"],"SecondaryMuscles":["biceps","middle back"],"Instructions":["Load an appropriate weight onto the pins and adjust the seat height so that the handles are at chest level. Grasp the handles with either a neutral or pronated grip. This will be your starting position.","Pull the handles towards your torso, retracting your shoulder blades as you flex the elbow.","Pause at the bottom of the motion, and then slowly return the handles to the starting position. For multiple repetitions, avoid completely returning the weight to the stops to keep tension on the muscles being worked."],"Category":"strength"},"21":{"Name":"Leverage Shoulder Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Load an appropriate weight onto the pins and adjust the seat for your height. The handles should be near the top of the shoulders at the beginning of the motion. Your chest and head should be up and handles held with a pronated grip. This will be your starting position.","Press the handles upward by extending through the elbow.","After a brief pause at the top, return the weight to just above the start position, keeping tension on the muscles by not returning the weight to the stops until the set is complete."],"Category":"strength"},"22":{"Name":"Leverage Shrug","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["traps"],"SecondaryMuscles":["forearms"],"Instructions":["Load the pins to an appropriate weight. Position yourself directly between the handles.","Grasp the top handles with a comfortable grip, and then lower your hips as you take a breath. Look forward with your head and keep your chest up.","Drive through the floor with your heels, extending your hips and knees as you rise to a standing position. Keep your arms straight throughout the movement, finishing with your shoulders back. This will be your starting position.","Raise the weight by shrugging the shoulders towards your ears, moving straight up and down.","Pause at the top of the motion, and then return the weight to the starting position."],"Category":"strength"},"23":{"Name":"Lunge Sprint","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Adjust a bar in a Smith machine to an appropriate height. Position yourself under the bar, racking it across the back of your shoulders. Unrack the bar, and then split your feet, moving one foot forward and one foot back. This will be your starting position.","Lower your back knee nearly to the ground, flexing the knees and lowering your hips as you do so.","At the bottom of the descent, immediately reverse direction. Explosively drive through the heel of your front foot with light pressure from your back foot. Jump up and reverse the position of your legs.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"24":{"Name":"Lying Leg Curls","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":[],"Instructions":["Adjust the machine lever to fit your height and lie face down on the leg curl machine with the pad of the lever on the back of your legs (just a few inches under the calves). Tip: Preferably use a leg curl machine that is angled as opposed to flat since an angled position is more favorable for hamstrings recruitment.","Keeping the torso flat on the bench, ensure your legs are fully stretched and grab the side handles of the machine. Position your toes straight (or you can also use any of the other two stances described on the foot positioning section). This will be your starting position.","As you exhale, curl your legs up as far as possible without lifting the upper legs from the pad. Once you hit the fully contracted position, hold it for a second.","As you inhale, bring the legs back to the initial position. Repeat for the recommended amount of repetitions."],"Category":"strength"},"25":{"Name":"Lying Machine Squat","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Adjust the leg machine to a height that will allow you to get inside it with your knees bent and the thighs slightly below parallel.","Once you select the weight, position yourself inside the machine face up with the knees bent and thighs slightly below parallel to the platform. Make sure that the knees do not go past the toes. The angle created between the hamstrings and the calves should be one that is slightly less than 90 degrees (since your starting position requires you to start slightly below parallel). Your back and your head should be resting on the machine while your shoulders are pressed under the shoulder pads.","Place your hands by the handles and position your feet slightly pointing out at a shoulder width position. This will be your starting position.","While pressing with the balls of the feet as you breathe out, make your whole body erect as you squeeze the quads. Hold the contracted position for a second. Tip: Since you are starting below parallel, you can opt to use your hands to help you up by pressing on your thighs only on the first repetition.","Slowly squat down as you inhale but instead of going all the way down to the starting position, just stop once your thighs are parallel to the platform. The angle between your hamstrings and calves should be a 90-degree angle.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"26":{"Name":"Lying T-Bar Row","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Load up the T-bar Row Machine with the desired weight and adjust the leg height so that your upper chest is at the top of the pad. Tip: In some machines all you can do is stand on the appropriate step that allows you to be at a height that has the upper chest at the top of the pad.","Lay face down on the pad and grab the handles. You can either use a palms down, palms up, or palms in position depending on what part of your back you want to emphasize.","Lift the bar off the rack and extend your arms in front of you. This will be your starting position.","As you exhale slowly pull the weight up and squeeze your back at the top of the movement. Tip: Keep the upper arms as close to the torso as possible throughout the movement in order to better engage the back muscles. Also, do not lift your body off of the pad at any time and refrain from using the biceps to lift the weight.","After a second contraction at the top of the movement, as you inhale, slowly go back down to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"27":{"Name":"Machine Bench Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Sit down on the Chest Press Machine and select the weight.","Step on the lever provided by the machine since it will help you to bring the handles forward so that you can grab the handles and fully extend the arms.","Grab the handles with a palms-down grip and lift your elbows so that your upper arms are parallel to the floor to the sides of your torso. Tip: Your forearms will be pointing forward since you are grabbing the handles. Once you bring the handles forward and extend the arms you will be at the starting position.","Now bring the handles back towards you as you breathe in.","Push the handles away from you as you flex your pecs and you breathe out. Hold the contraction for a second before going back to the starting position.","Repeat for the recommended amount of reps.","When finished step on the lever again and slowly get the handles back to their original place."],"Category":"strength"},"28":{"Name":"Machine Bicep Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Adjust the seat to the appropriate height and make your weight selection. Place your upper arms against the pads and grasp the handles. This will be your starting position.","Perform the movement by flexing the elbow, pulling your lower arm towards your upper arm.","Pause at the top of the movement, and then slowly return the weight to the starting position.","Avoid returning the weight all the way to the stops until the set is complete to keep tension on the muscles being worked."],"Category":"strength"},"29":{"Name":"Machine Preacher Curls","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["biceps"],"SecondaryMuscles":[],"Instructions":["Sit down on the Preacher Curl Machine and select the weight.","Place the back of your upper arms (your triceps) on the preacher pad provided and grab the handles using an underhand grip (palms facing up). Tip: Make sure that when you place the arms on the pad you keep the elbows in. This will be your starting position.","Now lift the handles as you exhale and you contract the biceps. At the top of the position make sure that you hold the contraction for a second. Tip: Only the forearms should move. The upper arms should remain stationary and on the pad at all times.","Lower the handles slowly back to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"30":{"Name":"Machine Shoulder (Military) Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["Sit down on the Shoulder Press Machine and select the weight.","Grab the handles to your sides as you keep the elbows bent and in line with your torso. This will be your starting position.","Now lift the handles as you exhale and you extend the arms fully. At the top of the position make sure that you hold the contraction for a second.","Lower the handles slowly back to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"31":{"Name":"Machine Triceps Extension","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["triceps"],"SecondaryMuscles":[],"Instructions":["Adjust the seat to the appropriate height and make your weight selection. Place your upper arms against the pads and grasp the handles. This will be your starting position.","Perform the movement by extending the elbow, pulling your lower arm away from your upper arm.","Pause at the completion of the movement, and then slowly return the weight to the starting position.","Avoid returning the weight all the way to the stops until the set is complete to keep tension on the muscles being worked."],"Category":"strength"},"32":{"Name":"Narrow Stance Hack Squats","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Place the back of your torso against the back pad of the machine and hook your shoulders under the shoulder pads provided.","Position your legs in the platform using a less than shoulder width narrow stance with the toes slightly pointed out. Your feet should be around 3 inches or less apart. Tip: Keep your head up at all times and also maintain the back on the pad at all times.","Place your arms on the side handles of the machine and disengage the safety bars (which on most designs is done by moving the side handles from a facing front position to a diagonal position).","Now straighten your legs without locking the knees. This will be your starting position.","Begin to slowly lower the unit by bending the knees as you maintain a straight posture with the head up (back on the pad at all times). Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement.","Begin to raise the unit as you exhale by pushing the floor with mainly with the heels of your feet as you straighten the legs again and go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"33":{"Name":"Narrow Stance Leg Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Using a leg press machine, sit down on the machine and place your legs on the platform directly in front of you at a less-than-shoulder-width narrow stance with the toes slightly pointed out. Your feet should be around 3 inches or less apart. Tip: Keep your head up at all times and also maintain the back on the pad at all times.","Lower the safety bars holding the weighted platform in place and press the platform all the way up until your legs are fully extended in front of you. Tip: Make sure that you do not lock your knees. Your torso and the legs should make a perfect 90-degree angle. This will be your starting position.","As you inhale, slowly lower the platform until your upper and lower legs make a 90-degree angle.","Pushing mainly with the heels of your feet and using the quadriceps go back to the starting position as you exhale.","Repeat for the recommended amount of repetitions and ensure to lock the safety pins properly once you are done. You do not want that platform falling on you fully loaded."],"Category":"strength"},"34":{"Name":"Recumbent Bike","Force":null,"Level":"beginner","Mechanic":null,"Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["To begin, seat yourself on the bike and adjust the seat to your height.","Select the desired option from the menu. You may have to start pedaling to turn it on. You can use the manual setting, or you can select a program to use. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise. The level of resistance can be changed throughout the workout. The handles can be used to monitor your heart rate to help you stay at an appropriate intensity.","Recumbent bikes offer convenience, cardiovascular benefits, and have less impact than other activities. A 150 lb person will burn about 230 calories cycling at a moderate rate for 30 minutes, compared to 450 calories or more running."],"Category":"cardio"},"35":{"Name":"Reverse Hyperextension","Force":"pull","Level":"intermediate","Mechanic":null,"Equipment":"machine","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","glutes"],"Instructions":["Place your feet between the pads after loading an appropriate weight. Lay on the top pad, allowing your hips to hang off the back, while grasping the handles to hold your position.","To begin the movement, flex the hips, pulling the legs forward.","Reverse the motion by extending the hips, kicking the leg back. It is very important not to over-extend the hip on this movement, stopping short of your full range of motion.","Return by again flexing the hip, pulling the carriage forward as far as you can.","Repeat for the desired number of repetitions."],"Category":"strength"},"36":{"Name":"Reverse Machine Flyes","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["Adjust the handles so that they are fully to the rear. Make an appropriate weight selection and adjust the seat height so the handles are at shoulder level. Grasp the handles with your hands facing inwards. This will be your starting position.","In a semicircular motion, pull your hands out to your side and back, contracting your rear delts.","Keep your arms slightly bent throughout the movement, with all of the motion occurring at the shoulder joint.","Pause at the rear of the movement, and slowly return the weight to the starting position."],"Category":"strength"},"37":{"Name":"Rowing, Stationary","Force":null,"Level":"intermediate","Mechanic":null,"Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["biceps","calves","glutes","hamstrings","lower back","middle back"],"Instructions":["To begin, seat yourself on the rower. Make sure that your heels are resting comfortably against the base of the foot pedals and that the straps are secured. Select the program that you wish to use, if applicable. Sit up straight and bend forward at the hips.","There are three phases of movement when using a rower. The first phase is when you come forward on the rower. Your knees are bent and against your chest. Your upper body is leaning slightly forward while still maintaining good posture. Next, push against the foot pedals and extend your legs while bringing your hands to your upper abdominal area, squeezing your shoulders back as you do so. To avoid straining your back, use primarily your leg and hip muscles.","The recovery phase simply involves straightening your arms, bending the knees, and bringing your body forward again as you transition back into the first phase."],"Category":"cardio"},"38":{"Name":"Running, Treadmill","Force":null,"Level":"beginner","Mechanic":null,"Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["To begin, step onto the treadmill and select the desired option from the menu. Most treadmills have a manual setting, or you can select a program to run. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise. Elevation can be adjusted to change the intensity of the workout.","Treadmills offer convenience, cardiovascular benefits, and usually have less impact than running outside. A 150 lb person will burn over 450 calories running 8 miles per hour for 30 minutes. Maintain proper posture as you run, and only hold onto the handles when necessary, such as when dismounting or checking your heart rate."],"Category":"cardio"},"39":{"Name":"Seated Calf Raise","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["calves"],"SecondaryMuscles":[],"Instructions":["Sit on the machine and place your toes on the lower portion of the platform provided with the heels extending off. Choose the toe positioning of your choice (forward, in, or out) as per the beginning of this chapter.","Place your lower thighs under the lever pad, which will need to be adjusted according to the height of your thighs. Now place your hands on top of the lever pad in order to prevent it from slipping forward.","Lift the lever slightly by pushing your heels up and release the safety bar. This will be your starting position.","Slowly lower your heels by bending at the ankles until the calves are fully stretched. Inhale as you perform this movement.","Raise the heels by extending the ankles as high as possible as you contract the calves and breathe out. Hold the top contraction for a second.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"40":{"Name":"Seated Leg Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":[],"Instructions":["Adjust the machine lever to fit your height and sit on the machine with your back against the back support pad.","Place the back of lower leg on top of padded lever (just a few inches under the calves) and secure the lap pad against your thighs, just above the knees. Then grasp the side handles on the machine as you point your toes straight (or you can also use any of the other two stances) and ensure that the legs are fully straight right in front of you. This will be your starting position.","As you exhale, pull the machine lever as far as possible to the back of your thighs by flexing at the knees. Keep your torso stationary at all times. Hold the contracted position for a second.","Slowly return to the starting position as you breathe in.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"41":{"Name":"Single-Leg Leg Extension","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":[],"Instructions":["Seat yourself in the machine and adjust it so that you are positioned properly. The pad should be against the lower part of the shin but not in contact with the ankle. Adjust the seat so that the pivot point is in line with your knee. Select a weight appropriate for your abilities.","Maintaining good posture, fully extend one leg, pausing at the top of the motion.","Return to the starting position without letting the weight stop, keeping tension on the muscle.","Repeat for the desired number of repetitions."],"Category":"strength"},"42":{"Name":"Smith Machine Behind the Back Shrug","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["traps"],"SecondaryMuscles":["shoulders"],"Instructions":["With the bar at thigh level, load an appropriate weight.","Stand with the bar behind you, taking a shoulder-width, pronated grip on the bar and unhook the weight. You should be standing up straight with your head and chest up and your arms extended. This will be your starting position.","Initiate the movement by shrugging your shoulders straight up. Do not flex the arms or wrist during the movement.","After a brief pause return the weight to the starting position.","Repeat for the desired number of repetitions before engaging the hooks to rack the weight."],"Category":"strength"},"43":{"Name":"Smith Machine Bench Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Place a flat bench underneath the smith machine. Now place the barbell at a height that you can reach when lying down and your arms are almost fully extended. Once the weight you need is selected, lie down on the flat bench. Using a pronated grip that is wider than shoulder width, unlock the bar from the rack and hold it straight over you with your arms locked. This will be your starting position.","As you breathe in, come down slowly until you feel the bar on your middle chest.","After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up.","Repeat the movement for the prescribed amount of repetitions.","When you are done, lock the bar back in the rack."],"Category":"strength"},"44":{"Name":"Smith Machine Bent Over Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats","shoulders"],"Instructions":["Set the barbell attached to the smith machine to a height that is about 2 inches below your knees.","Bend your knees slightly and bring your torso forward, by bending at the waist, while keeping the back straight until it is almost parallel to the floor. Tip: Make sure that you keep the head up.","Now grasp the barbell using an overhand (pronated) grip and unlock it from the smith machine rack. Then let it hang directly in front of you as your arms hang extended perpendicular to the floor and your torso. This is your starting position.","While keeping the torso stationary, lift the barbell as you breathe out, keeping the elbows close to the body and not doing any force with the forearm other than holding the weights. On the top contracted position, squeeze the back muscles and hold for a second.","Slowly lower the weight again to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"45":{"Name":"Smith Machine Calf Raise","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["calves"],"SecondaryMuscles":[],"Instructions":["Place a block or weight plate below the bar on the Smith machine. Set the bar to a position that best matches your height. Once the correct height is chosen and the bar is loaded, step onto the plates with the balls of your feet and place the bar on the back of your shoulders.","Take the bar with both hands facing forward. Rotate the bar to unrack it. This will be your starting position.","Raise your heels as high as possible by pushing off of the balls of your feet, flexing your calf at the top of the contraction. Your knees should remain extended. Hold the contracted position for a second before you start to go back down.","Return slowly to the starting position as you breathe in while lowering your heels.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"46":{"Name":"Smith Machine Close-Grip Bench Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["Place a flat bench underneath the smith machine. Place the barbell at a height that you can reach when lying down and your arms are almost fully extended. Once the weight you need is selected, lie down on the flat bench. Using a close and pronated grip (palms facing forward) that is around shoulder width, unlock the bar from the rack and hold it straight over you with your arms locked. This will be your starting position.","As you breathe in, come down slowly until you feel the bar on your middle chest. Tip: Make sure that as opposed to a regular bench press, you keep the elbows close to the torso at all times in order to maximize triceps involvement.","After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your triceps muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up.","Repeat the movement for the prescribed amount of repetitions.","When you are done, lock the bar back in the rack."],"Category":"strength"},"47":{"Name":"Smith Machine Decline Press","Force":null,"Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Position a decline bench in the rack so that the bar will be above your chest. Load an appropriate weight and take your place on the bench.","Rotate the bar to unhook it from the rack and fully extend your arms. Your back should be slightly arched and your shoulder blades retracted. This will be your starting position.","Begin the movement by flexing your arms, lowering the bar to your chest.","Pause briefly, and then extend your arms to push the weight back to the starting position.","After completing the desired number of repetitions, rotate the bar to rack the weight."],"Category":"strength"},"48":{"Name":"Smith Machine Hang Power Clean","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["glutes","lower back","quadriceps","shoulders","traps"],"Instructions":["Position the bar at knee height and load it to an appropriate weight.","Take a pronated grip on the bar outside of shoulder width and unhook the bar from the machine. Your arms should be fully extended with your head and chest up. Your elbows should be pointed out with your shoulders back and down. Your hips should be back, loading the tension into the hamstrings. This will be your starting position.","Initate the movement by forcefully extending the hips and knees, accelerating into the bar. Ensure that you keep your arms straight during this part of the motion.","Upon full extension, rebend the hips and knees to lower your receiving position.","Allow the arms to flex at this point, rotating the elbows around the bar to receive it on your shoulders.","Extend through the hips and knees to come to a standing position with the bar racked on your shoulders to complete the movement."],"Category":"strength"},"49":{"Name":"Smith Machine Hip Raise","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["abdominals"],"SecondaryMuscles":[],"Instructions":["Position a bench in the rack and load the bar to an appropriate weight. Lie down on the bench, placing the bottom of your feet against the bar. Unlock the bar and extend your legs. You may need to use your hands to assist you. For added stability grasp the sides of the Smith Machine. This will be your starting position.","Initiate the movement by rotating your pelvis, flexing your spine to raise your hips off of the bench. Maintain a slight bend in the knees throughout the motion.","After a brief pause, return the hips to the bench.","Repeat for the desired number of repetitions."],"Category":"strength"},"50":{"Name":"Smith Machine Incline Bench Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Place an incline bench underneath the smith machine. Place the barbell at a height that you can reach when lying down and your arms are almost fully extended. Once the weight you need is selected, lie down on the incline bench and make sure your upper chest is aligned with the barbell. Using a pronated grip (palms facing forward) that is wider than shoulder width, unlock the bar from the rack and hold it straight over you with your arms locked. This will be your starting position.","As you breathe in, come down slowly until you feel the bar on your upper chest.","After a second pause, bring the bar back to the starting position as you breathe out and push the bar using your chest muscles. Lock your arms in the contracted position, hold for a second and then start coming down slowly again. Tip: It should take at least twice as long to go down than to come up.","Repeat the movement for the prescribed amount of repetitions.","When you are done, place the bar back in the rack."],"Category":"strength"},"51":{"Name":"Smith Machine Leg Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Position a Smith machine bar a couple feet off of the ground. Ensure that it is resting on the safeties. After loading the bar to an appropriate weight, lie underneath the bar. Place the middle of your feet on the bar, tucking your knees to your chest. This will be your starting position.","Begin the movement by driving through your feet to move the bar upward, extending the hips and knees. Do not lock out your knees.","At the top of the motion, pause briefly before returning to the starting position."],"Category":"strength"},"52":{"Name":"Smith Machine One-Arm Upright Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["biceps","traps"],"Instructions":["With the bar at thigh level, load an appropriate weight.","Take a wide grip on the bar and unhook the weight, removing your off hand from the bar. Your arm should be extended as you stand up straight with your head and chest up. This will be your starting position.","Begin the movement by flexing the elbow, raising the upper arm with the elbow pointed out. Continue until your upper arm is parallel to the floor.","After a brief pause, return the weight to the starting position.","Repeat for the desired number of repetitions before engaging the hooks to rack the weight."],"Category":"strength"},"53":{"Name":"Smith Machine Overhead Shoulder Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["triceps"],"Instructions":["To begin, place a flat bench (or preferably one with back support) underneath a smith machine. Position the barbell at a height so that when seated on the flat bench, the arms must be almost fully extended to reach the barbell.","Once you have the correct height, sit slightly in behind the barbell so that there is an imaginary straight line from the tip of your nose to the barbell. Your feet should be stationary. Grab the barbell with the palms facing forward, unlock it and lift it up so that your arms are fully extended. This is the starting position.","Slowly begin to lower the barbell until it is level with your chin while inhaling.","Then lift the barbell back to the starting position using your shoulders while exhaling.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"54":{"Name":"Smith Machine Pistol Squat","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["To begin, first set the bar to a position that best matches your height. Step under it and position the bar across the back of your shoulders.","Take the bar with your hands facing forward, unlock it and lift it off the rack by extending your legs. 3","Move one foot forward about 12 inches in front of the bar. Extend the other leg out in front of you, holding it off the ground. Look forward at all times and maintain a neutral or slightly arched spine. This will be your starting position.","Maintaining good posture, lower yourself by flexing the knee and hip, going down as far as flexibility allows.","Pause briefly at the bottom and then return to the starting position by driving through the heel of your foot, extending the knee and hip."],"Category":"strength"},"55":{"Name":"Smith Machine Reverse Calf Raises","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["calves"],"SecondaryMuscles":[],"Instructions":["Adjust the barbell on the smith machine to fit your height and align a raised platform right under the bar.","Stand on the platform with the heels of your feet secured on top of it with the balls of your feet extending off it. Position your toes facing forward with a shoulder width stance.","Now, place your shoulders under the barbell while maintaining the foot positioning described and push the barbell up by extending your hips and knees until your torso is standing erect. The knees should be kept with a slight bend; never locked. This will be your starting position. Tip: The barbell on your back is only for balance purposes.","Raise the balls of your feet as you breathe out by extending your toes as high as possible and flexing your calf. Ensure that the knee is kept stationary at all times. There should be no bending at any time. Hold the contracted position for a second before you start to go back down.","Slowly go back down to the starting position as you breathe in by lowering the balls of your feet and toes.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"56":{"Name":"Smith Machine Squat","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","lower back"],"Instructions":["To begin, first set the bar on the height that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.","Hold on to the bar using both arms at each side (palms facing forward), unlock it and lift it off the rack by first pushing with your legs and at the same time straightening your torso.","Position your legs using a shoulder width medium stance with the toes slightly pointed out. Keep your head up at all times and also maintain a straight back. This will be your starting position. (Note: For the purposes of this discussion we will use the medium stance which targets overall development; however you can choose any of the three stances discussed in the foot stances section).","Begin to slowly lower the bar by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that is perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to raise the bar as you exhale by pushing the floor with the heel of your foot as you straighten the legs again and go back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"57":{"Name":"Smith Machine Stiff-Legged Deadlift","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["glutes","lower back"],"Instructions":["To begin, set the bar on the smith machine to a height that is around the middle of your thighs. Once the correct height is chosen and the bar is loaded, grasp the bar using a pronated (palms forward) grip that is shoulder width apart. You may need some wrist wraps if using a significant amount of weight.","Lift the bar up by fully extending your arms while keeping your back straight. Stand with your torso straight and your legs spaced using a shoulder width or narrower stance. The knees should be slightly bent. This is your starting position.","Keeping the knees stationary, lower the barbell to over the top of your feet by bending at the waist while keeping your back straight. Keep moving forward as if you were going to pick something from the floor until you feel a stretch on the hamstrings. Exhale as you perform this movement","Start bringing your torso up straight again as soon as you feel the hamstrings stretch by extending your hips and waist until you are back at the starting position. Inhale as you perform this movement.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"58":{"Name":"Smith Machine Upright Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["traps"],"SecondaryMuscles":["biceps","middle back","shoulders"],"Instructions":["To begin, set the bar on the smith machine to a height that is around the middle of your thighs. Once the correct height is chosen and the bar is loaded, grasp the bar using a pronated (palms forward) grip that is shoulder width apart. You may need some wrist wraps if using a significant amount of weight.","Lift the barbell up and fully extend your arms with your back straight. There should be a slight bend at the elbows. This is the starting position.","Use your side shoulders to lift the bar as you exhale. The bar should be close to the body as you move it up. Continue to lift it until it nearly touches your chin. Tip: Your elbows should drive the motion. As you lift the bar, your elbows should always be higher than your forearms. Also, keep your torso stationary and pause for a second at the top of the movement.","Lower the bar back down slowly to the starting position. Inhale as you perform this portion of the movement.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"59":{"Name":"Smith Single-Leg Split Squat","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["To begin, place a flat bench 2-3 feet behind the smith machine. Then, set the bar on the height that best matches your height. Once the correct height is chosen and the bar is loaded, step under the bar and place the back of your shoulders (slightly below the neck) across it.","Hold on to the bar using both arms at each side (palms facing forward), unlock it and lift it off the rack by first pushing with your legs and at the same time straightening your torso.","Position your legs by placing one foot slightly forward under the bar and extending your other leg back and place the top of your foot on the bench. This will be your starting position","Begin to slowly lower the bar by bending the knee as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calf becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knee should make an imaginary straight line with the toes that is perpendicular to the front. If your knee is past that imaginary line (if it is past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to raise the bar as you exhale by pushing the floor with the heel of your foot mainly as you straighten your leg again and go back to the starting position.","Repeat for the recommended amount of repetitions.","Switch legs and repeat the movement."],"Category":"strength"},"60":{"Name":"Stairmaster","Force":null,"Level":"intermediate","Mechanic":null,"Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["To begin, step onto the stairmaster and select the desired option from the menu. You can choose a manual setting, or you can select a program to run. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise.","Pump your legs up and down in an established rhythm, driving the pedals down but not all the way to the floor. It is recommended that you maintain your grip on the handles so that you dont fall. The handles can be used to monitor your heart rate to help you stay at an appropriate intensity.","Stairmasters offer convenience, cardiovascular benefits, and usually have less impact than running outside. They are typically much harder than other cardio equipment. A 150 lb person will typically burn over 300 calories in 30 minutes, compared to about 175 calories walking."],"Category":"cardio"},"61":{"Name":"Standing Calf Raises","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["calves"],"SecondaryMuscles":[],"Instructions":["Adjust the padded lever of the calf raise machine to fit your height.","Place your shoulders under the pads provided and position your toes facing forward (or using any of the two other positions described at the beginning of the chapter). The balls of your feet should be secured on top of the calf block with the heels extending off it. Push the lever up by extending your hips and knees until your torso is standing erect. The knees should be kept with a slight bend; never locked. Toes should be facing forward, outwards or inwards as described at the beginning of the chapter. This will be your starting position.","Raise your heels as you breathe out by extending your ankles as high as possible and flexing your calf. Ensure that the knee is kept stationary at all times. There should be no bending at any time. Hold the contracted position by a second before you start to go back down.","Go back slowly to the starting position as you breathe in by lowering your heels as you bend the ankles until calves are stretched.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"62":{"Name":"Standing Leg Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":[],"Instructions":["Adjust the machine lever to fit your height and lie with your torso bent at the waist facing forward around 30-45 degrees (since an angled position is more favorable for hamstrings recruitment) with the pad of the lever on the back of your right leg (just a few inches under the calves) and the front of the right leg on top of the machine pad.","Keeping the torso bent forward, ensure your leg is fully stretched and grab the side handles of the machine. Position your toes straight. This will be your starting position.","As you exhale, curl your right leg up as far as possible without lifting the upper leg from the pad. Once you hit the fully contracted position, hold it for a second.","As you inhale, bring the legs back to the initial position. Repeat for the recommended amount of repetitions.","Perform the same exercise now for the left leg."],"Category":"strength"},"63":{"Name":"Step Mill","Force":null,"Level":"intermediate","Mechanic":null,"Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["To begin, step onto the stepmill and select the desired option from the menu. You can choose a manual setting, or you can select a program to run. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise. Use caution so that you dont trip as you climb the stairs. It is recommended that you maintain your grip on the handles so that you dont fall.","Stepmills offer convenience, cardiovascular benefits, and usually have less impact than running outside while offering a similar rate of calories burned. They are typically much harder than other cardio equipment. A 150 lb person will typically burn over 300 calories in 30 minutes, compared to about 175 calories walking."],"Category":"cardio"},"64":{"Name":"Thigh Abductor","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["abductors"],"SecondaryMuscles":["glutes"],"Instructions":["To begin, sit down on the abductor machine and select a weight you are comfortable with. When your legs are positioned properly, grip the handles on each side. Your entire upper body (from the waist up) should be stationary. This is the starting position.","Slowly press against the machine with your legs to move them away from each other while exhaling.","Feel the contraction for a second and begin to move your legs back to the starting position while breathing in. Note: Remember to keep your upper body stationary to prevent any injuries from occurring.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"65":{"Name":"Thigh Adductor","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"machine","PrimaryMuscles":["adductors"],"SecondaryMuscles":["glutes","hamstrings"],"Instructions":["To begin, sit down on the adductor machine and select a weight you are comfortable with. When your legs are positioned properly on the leg pads of the machine, grip the handles on each side. Your entire upper body (from the waist up) should be stationary. This is the starting position.","Slowly press against the machine with your legs to move them towards each other while exhaling.","Feel the contraction for a second and begin to move your legs back to the starting position while breathing in. Note: Remember to keep your upper body stationary and avoid fast jerking motions in order to prevent any injuries from occurring.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"66":{"Name":"Walking, Treadmill","Force":null,"Level":"beginner","Mechanic":null,"Equipment":"machine","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["To begin, step onto the treadmill and select the desired option from the menu. Most treadmills have a manual setting, or you can select a program to run. Typically, you can enter your age and weight to estimate the amount of calories burned during exercise. Elevation can be adjusted to change the intensity of the workout.","Treadmills offer convenience, cardiovascular benefits, and usually have less impact than walking outside. When walking, you should move at a moderate to fast pace, not a leisurely one. Being an activity of lower intensity, walking doesnt burn as many calories as some other activities, but still provides great benefit. A 150 lb person will burn about 175 calories walking 4 miles per hour for 30 minutes, compared to 450 calories running twice as fast. Maintain proper posture as you walk, and only hold onto the handles when necessary, such as when dismounting or checking your heart rate."],"Category":"cardio"}}