{"0":{"Name":"Backward Medicine Ball Throw","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["This exercise is best done with a partner. If you lack a partner, the ball can be thrown and retrieved or thrown against a wall.","Begin standing a few meters in front of your partner, both facing the same direction. Begin holding the ball between your legs.","Squat down and then forcefully reverse direction, coming to full extension and you toss the ball over your head to your partner.","Your partner can then roll the ball back to you. Repeat for the desired number of repetitions."],"Category":"plyometrics"},"1":{"Name":"Catch and Overhead Throw","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["lats"],"SecondaryMuscles":["abdominals","chest","shoulders"],"Instructions":["Begin standing while facing a wall or a partner.","Using both hands, position the ball behind your head, stretching as much as possible, and forcefully throw the ball forward.","Ensure that you follow your throw through, being prepared to receive your rebound from your throw. If you are throwing against the wall, make sure that you stand close enough to the wall to receive the rebound, and aim a little higher than you would with a partner."],"Category":"plyometrics"},"2":{"Name":"Chest Push (multiple response)","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["chest"],"SecondaryMuscles":["abdominals","shoulders","triceps"],"Instructions":["Begin in a kneeling position facing a wall or utilize a partner. Hold the ball with both hands tight into the chest.","Execute the pass by exploding forward and outward with the hips while pushing the ball as hard as possible.","Follow through by falling forward, catching yourself with your hands.","Immediately return to an upright position. Repeat for the desired number of repetitions."],"Category":"plyometrics"},"3":{"Name":"Chest Push (single response)","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["chest"],"SecondaryMuscles":["abdominals","shoulders","triceps"],"Instructions":["Begin in a kneeling position holding the medicine ball with both hands tightly into the chest.","Execute the pass by exploding forward and outward with the hips while pushing the ball as far as possible.","Follow through by falling forward, catching yourself with your hands."],"Category":"plyometrics"},"4":{"Name":"Chest Push from 3 point stance","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["chest"],"SecondaryMuscles":["abdominals","shoulders","triceps"],"Instructions":["Begin in a three point stance, squatted down with your back flat and one hand on the ground. Place the medicine ball directly in front of you.","To begin, take your first step as you pull the ball to your chest, positioning both hands to prepare for the throw.","As you execute the second step, explosively release the ball forward as hard as possible."],"Category":"plyometrics"},"5":{"Name":"Chest Push with Run Release","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["chest"],"SecondaryMuscles":["abdominals","shoulders","triceps"],"Instructions":["Begin in an athletic stance with the knees bent, hips back, and back flat. Hold the medicine ball near your legs. This will be your starting position.","While taking your first step draw the medicine ball into your chest.","As you take the second step, explosively push the ball forward, immediately sprinting for 10 yards after the release. If you are really fast, you can catch your own pass!"],"Category":"plyometrics"},"6":{"Name":"Medicine Ball Chest Pass","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["You will need a partner for this exercise. Lacking one, this movement can be performed against a wall.","Begin facing your partner holding the medicine ball at your torso with both hands.","Pull the ball to your chest, and reverse the motion by extending through the elbows. For sports applications, you can take a step as you throw.","Your partner should catch the ball, and throw it back to you.","Receive the throw with both hands at chest height."],"Category":"plyometrics"},"7":{"Name":"Medicine Ball Full Twist","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["shoulders"],"Instructions":["For this exercise you will need a medicine ball and a partner. Stand back to back with your partner, spaced 2-3 feet apart. This will be your starting position.","Hold the ball in front of the trunk. Open the hips and turn the shoulders at the same time as your partner.","For full rotation, you and your partner should twist in the same direction, i.e. counter-clockwise.","Pass the ball to your partner, and both of you can now twist in the opposite direction to repeat the procedure."],"Category":"plyometrics"},"8":{"Name":"Medicine Ball Scoop Throw","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["abdominals","hamstrings","quadriceps"],"Instructions":["Assume a semisquat stance with a medicine ball in your hands. Your arms should hang so the ball is near your feet.","Begin by thrusting the hips forward as you extend through the legs, jumping up.","As you do, swing your arms up and over your head, keeping them extended, releasing the ball at the peak of your movement. The goal is to throw the ball the greatest distance behind you."],"Category":"plyometrics"},"9":{"Name":"One-Arm Medicine Ball Slam","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["lats","shoulders"],"Instructions":["Start in a standing position with a staggered, athletic stance. Hold a medicine ball in one hand, on the same side as your back leg. This will be your starting position.","Begin by winding the arm, raising the medicine ball above your head. As you do so, extend through the hips, knees, and ankles to load up for the slam.","At peak extension, flex the shoulders, spine, and hips to throw the ball hard into the ground directly in front of you.","Catch the ball on the bounce and continue for the desired number of repetitions."],"Category":"strength"},"10":{"Name":"Overhead Slam","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["lats"],"SecondaryMuscles":[],"Instructions":["Hold a medine ball with both hands and stand with your feet at shoulder width. This will be your starting position.","Initiate the countermovement by raising the ball above your head and fully extending your body.","Reverse the motion, slamming the ball into the ground directly in front of you as hard as you can.","Receive the ball with both hands on the bounce and repeat the movement."],"Category":"plyometrics"},"11":{"Name":"Return Push from Stance","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["chest","triceps"],"Instructions":["You will need a partner for this drill.","Begin in an athletic 2 or 3 point stance.","At the signal, move into a position to receive the pass from your partner.","Catch the medicine ball with both hands and immediately throw it back to your partner.","You can modify this drill by running different routes."],"Category":"plyometrics"},"12":{"Name":"Standing Two-Arm Overhead Throw","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["chest","lats"],"Instructions":["Stand with your feet shoulder width apart holding a medicine ball in both hands. To begin, reach the medicine ball deep behind your head as you bend the knees slightly and lean back.","Violently throw the ball forward, flexing at the hip and using your whole body to complete the movement.","The medicine ball can be thrown to a partner or to a wall, receiving it as it bounces back."],"Category":"plyometrics"},"13":{"Name":"Supine Chest Throw","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["This drill is great for chest passes when you lack a partner or a wall of sufficient strength. Lay on the ground on your back with your knees bent.","Begin with the ball on your chest, held with both hands on the bottom.","Explode up, extending through the elbow to throw the ball directly above you as high as possible.","Catch the ball with both hands as it comes down."],"Category":"plyometrics"},"14":{"Name":"Supine One-Arm Overhead Throw","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["chest","lats","shoulders"],"Instructions":["Lay on the ground on your back with your knees bent. Hold the ball with one hand, extending the arm fully behind your head. This will be your starting position.","Initiate the movement at the shoulder, throwing the ball directly forward of you as you sit up, attempting to go for maximum distance.","The ball can be thrown to a partner or bounced off of a wall."],"Category":"plyometrics"},"15":{"Name":"Supine Two-Arm Overhead Throw","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["chest","lats","shoulders"],"Instructions":["Lay on the ground on your back with your knees bent.","Hold the ball with both hands, extending the arms fully behind your head. This will be your starting position.","Initiate the movement at the shoulder, throwing the ball directly forward of you as you sit up, attempting to go for maximum distance.","The ball can be thrown to a partner or bounced off of a wall."],"Category":"plyometrics"},"16":{"Name":"Weighted Crunches","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"medicine ball","PrimaryMuscles":["abdominals"],"SecondaryMuscles":[],"Instructions":["Lie flat on your back with your feet flat on the ground or resting on a bench with your knees bent at a 90 degree angle.","Hold a weight to your chest, or you may hold it extended above your torso. This will be your starting position.","Now, exhale and slowly begin to roll your shoulders off the floor. Your shoulders should come up off the floor about 4 inches while your lower back remains on the floor.","At the top of the movement, flex your abdominals and hold for a brief pause.","Then inhale and slowly lower yourself back down to the starting position."],"Category":"strength"}}