{"0":{"Name":"Ab Roller","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["shoulders"],"Instructions":["Hold the Ab Roller with both hands and kneel on the floor.","Now place the ab roller on the floor in front of you so that you are on all your hands and knees (as in a kneeling push up position). This will be your starting position.","Slowly roll the ab roller straight forward, stretching your body into a straight position. Tip: Go down as far as you can without touching the floor with your body. Breathe in during this portion of the movement.","After a pause at the stretched position, start pulling yourself back to the starting position as you breathe out. Tip: Go slowly and keep your abs tight at all times."],"Category":"strength"},"1":{"Name":"Anterior Tibialis-SMR","Force":"static","Level":"intermediate","Mechanic":null,"Equipment":"other","PrimaryMuscles":["calves"],"SecondaryMuscles":[],"Instructions":["Begin seated on the ground with your legs bent and your feet on the floor.","Using a Muscle Roller or a rolling pin, apply pressure to the muscles on the outside of your shins. Work from just below the knee to above the ankle, pausing at points of tension for 10-30 seconds. Repeat on the other leg."],"Category":"stretching"},"2":{"Name":"Atlas Stone Trainer","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["lower back"],"SecondaryMuscles":["biceps","forearms","glutes","hamstrings","quadriceps"],"Instructions":["This trainer is effective for developing Atlas Stone strength for those who don't have access to stones, and are typically made from bar ends or heavy pipe.","Begin by loading the desired weight onto the bar. Straddle the weight, wrapping your arms around the implement, bending at the hips.","Begin by pulling the weight up past the knees, extending through the hips. As the weight clears the knees, it can be lapped by resting it on your thighs and sitting back, hugging it tightly to your chest.","Finish the movement by extending through your hips and knees to raise the weight as high as possible. The weight can be returned to the lap or to the ground for successive repetitions."],"Category":"strongman"},"3":{"Name":"Atlas Stones","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["lower back"],"SecondaryMuscles":["abdominals","adductors","biceps","calves","forearms","glutes","hamstrings","middle back","quadriceps","traps"],"Instructions":["Begin with the atlas stone between your feet. Bend at the hips to wrap your arms vertically around the Atlas Stone, attempting to get your fingers underneath the stone. Many stones will have a small flat portion on the bottom, which will make the stone easier to hold.","Pulling the stone into your torso, drive through the back half of your feet to pull the stone from the ground.","As the stone passes the knees, lap it by sitting backward, pulling the stone on top of your thighs.","Sit low, getting the stone high onto your chest as you change your grip to reach over the stone. Stand, driving through with your hips. Close distance to the loading platform, and lean back, extending the hips to get the stone as high as possible."],"Category":"strongman"},"4":{"Name":"Axle Deadlift","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["lower back"],"SecondaryMuscles":["forearms","glutes","hamstrings","middle back","quadriceps","traps"],"Instructions":["Approach the bar so that it is centered over your feet. You feet should be about hip width apart. Bend at the hip to grip the bar at shoulder width, allowing your shoulder blades to protract. Typically, you would use an over/under grip.","With your feet and your grip set, take a big breath and then lower your hips and flex the knees until your shins contact the bar. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward.","After the bar passes the knees, aggressively pull the bar back, pulling your shoulder blades together as you drive your hips forward into the bar.","Lower the bar by bending at the hips and guiding it to the floor."],"Category":"strongman"},"5":{"Name":"Backward Drag","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","forearms","glutes","hamstrings","lower back"],"Instructions":["Load a sled with the desired weight, attaching a rope or straps to the sled that you can hold onto.","Begin the exercise by moving backwards for a given distance. Leaning back, extend through the legs for short steps to move as quickly as possible."],"Category":"strongman"},"6":{"Name":"Balance Board","Force":null,"Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["calves"],"SecondaryMuscles":["hamstrings","quadriceps"],"Instructions":["Place a balance board in front of you.","Stand up on it and try to balance yourself.","Hold the balance for as long as desired."],"Category":"strength"},"7":{"Name":"Band Assisted Pull-Up","Force":null,"Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["lats"],"SecondaryMuscles":["abdominals","forearms","middle back"],"Instructions":["Choke the band around the center of the pullup bar. You can use different bands to provide varying levels of assistance.","Pull the end of the band down, and place one bent knee into the loop, ensuring it won't slip out. Take a medium to wide grip on the bar. This will be your starting position.","Pull yourself upward by contracting the lats as you flex the elbow. The elbow should be driven to your side. Pull to the front, attempting to get your chin over the bar. Avoid swinging or jerking movements.","After a brief pause, return to the starting position."],"Category":"strength"},"8":{"Name":"Battling Ropes","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["chest","forearms"],"Instructions":["For this exercise you will need a heavy rope anchored at its center 15-20 feet away. Standing in front of the rope, take an end in each hand with your arms extended at your side. This will be your starting position.","Initiate the movement by rapidly raising one arm to shoulder level as quickly as you can.","As you let that arm drop to the starting position, raise the opposite side.","Continue alternating your left and right arms, whipping the ropes up and down as fast as you can."],"Category":"strength"},"9":{"Name":"Bear Crawl Sled Drags","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Wearing either a harness or a loose weight belt, attach the chain to the back so that you will be facing away from the sled. Bend down so that your hands are on the ground. Your back should be flat and knees bent. This is your starting position.","Begin by driving with legs, alternating left and right. Use your hands to maintain balance and to help pull. Try to keep your back flat as you move over a given distance."],"Category":"strongman"},"10":{"Name":"Behind Head Chest Stretch","Force":"static","Level":"expert","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders"],"Instructions":["Sit upright on the floor with your partner behind you.","Place your hands behind your hand, and push your elbows back as far as you can. Your partner should hold your elbows. This will be your starting position.","Gently attempt to pull your elbows forward with your hands still behind your head for 10 or more seconds. Your partner should prevent your elbows from moving.","Now, relax your muscles and have your partner gently pull the elbows back as far as it comfortable for you. Be sure to let your partner know when the stretch is adequate to prevent overstretching or injury."],"Category":"stretching"},"11":{"Name":"Bench Sprint","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Stand on the ground with one foot resting on a bench or box with your heel close to the edge.","Push off with your foot on top of the bench, extending through the hip and knee.","Land with the opposite foot on top of the box, returning your other foot back to the start position.","Continue alternating from one foot to another to complete the set."],"Category":"plyometrics"},"12":{"Name":"Bicycling","Force":null,"Level":"beginner","Mechanic":null,"Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["To begin, seat yourself on the bike and adjust the seat to your height."],"Category":"cardio"},"13":{"Name":"Bodyweight Mid Row","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Begin by taking a medium to wide grip on a pull-up apparatus with your palms facing away from you. From a hanging position, tuck your knees to your chest, leaning back and getting your legs over your side of the pull-up apparatus. This will be your starting position.","Beginning with your arms straight, flex the elbows and retract the shoulder blades to raise your body up until your legs contact the pull-up apparatus.","After a brief pause, return to the starting position."],"Category":"strength"},"14":{"Name":"Box Jump (Multiple Response)","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abductors","adductors","calves","glutes","quadriceps"],"Instructions":["Assume a relaxed stance facing the box or platform approximately an arm's length away. Arms should be down at the sides and legs slightly bent.","Using the arms to aid in the initial burst, jump upward and forward, landing with feet simultaneously on top of the box or platform.","Immediately drop or jump back down to the original starting place; then repeat the sequence."],"Category":"plyometrics"},"15":{"Name":"Box Skip","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abductors","adductors","calves","glutes","quadriceps"],"Instructions":["You will need several boxes lined up about 8 feet apart.","Begin facing the first box with one leg slightly behind the other.","Drive off the back leg, attempting to gain as much height with the hips as possible.","Immediately upon landing on the box, drive the other leg forward and upward to gain height and distance, leaping from the box. Land between the first two boxes with the same leg that landed on the first box.","Then, step to the next box and repeat."],"Category":"plyometrics"},"16":{"Name":"Car Deadlift","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["forearms","glutes","hamstrings","lower back","traps"],"Instructions":["This event apparatus typically has neutral grip handles, however some have a straight bar that you can approach like a normal deadlift. The apparatus can be loaded with a vehicle or other heavy objects such as tractor tires or kegs.","Center yourself between the handles if you are a strong squatter, or back a couple inches if you are a strong deadlifter. You feet should be about hip width apart. Bend at the hip to grip the handles. With your feet and your grip set, take a big breath and then lower your hips and flex the knees.","Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. As the weight comes up, pull your shoulder blades together as you drive your hips forward.","Lower the weight by bending at the hips and guiding it to the floor."],"Category":"strongman"},"17":{"Name":"Chain Handle Extension","Force":"push","Level":"intermediate","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["triceps"],"SecondaryMuscles":[],"Instructions":["You will need two cable handle attachments and a flat bench, as well as chains, for this exercise. Clip the middle of the chains to the handles, and position yourself on the flat bench. Your elbows should be pointing straight up.","Begin by extending through the elbow, keeping your upper arm still, with your wrists pronated.","Pause at the lockout, and reverse the motion to return to the starting position."],"Category":"powerlifting"},"18":{"Name":"Chain Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Begin by connecting the chains to the cable handle attachments. Position yourself on the flat bench in the same position as for a dumbbell press. Your wrists should be pronated and arms perpendicular to the floor. This will be your starting position.","Lower the chains by flexing the elbows, unloading some of the chain onto the floor.","Continue until your elbow forms a 90 degree angle, and then reverse the motion by extending through the elbow to lockout."],"Category":"powerlifting"},"19":{"Name":"Chair Leg Extended Stretch","Force":"static","Level":"beginner","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["adductors"],"Instructions":["Sit upright in a chair and grip the seat on the sides.","Raise one leg, extending the knee, flexing the ankle as you do so.","Slowly move that leg outward as far as you can, and then back to the center and down.","Repeat for your other leg."],"Category":"stretching"},"20":{"Name":"Chair Upper Body Stretch","Force":"static","Level":"beginner","Mechanic":null,"Equipment":"other","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["biceps","chest"],"Instructions":["Sit on the edge of a chair, gripping the back of it.","Straighten your arms, keeping your back straight, and pull your upper body forward so you feel a stretch. Hold for 20-30 seconds."],"Category":"stretching"},"21":{"Name":"Chest And Front Of Shoulder Stretch","Force":"static","Level":"beginner","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders"],"Instructions":["Start off by standing with your legs together, holding a bodybar or a broomstick.","Take a slightly wider than shoulder width grip on the pole and hold it in front of you with your palms facing down.","Carefully lift the pole up and behind your head."],"Category":"stretching"},"22":{"Name":"Circus Bell","Force":"push","Level":"expert","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["forearms","glutes","hamstrings","lower back","traps","triceps"],"Instructions":["The circus bell is an oversized dumbbell with a thick handle. Begin with the dumbbell between your feet, and grip the handle with both hands.","Clean the dumbbell by extending through your hips and knees to deliver the implement to the desired shoulder, letting go with the extra hand.","Ensure that you get one of the dumbbell heads behind the shoulder to keep from being thrown off balance. To raise it overhead, dip by flexing the knees, and the drive upwards as you extend the dumbbell overhead, leaning slightly away from it as you do so.","Carefully guide the bell back to the floor, keeping it under control as much as possible. It is best to perform this event on a thick rubber mat to prevent damage to the floor."],"Category":"strongman"},"23":{"Name":"Conan's Wheel","Force":null,"Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abdominals","biceps","calves","forearms","lower back","shoulders","traps"],"Instructions":["With the weight loaded, take a zurcher hold on the end of the implement. Place the bar in the crook of the elbow and hold onto your wrist. Try to keep the weight off of the forearms.","Begin by lifting the weight from the ground. Keep a tight, upright posture as you being to walk, taking short, fast steps. Look up and away as you turn in a circle. Do not hold your breath during the event. Continue walking until you complete one or more complete turns."],"Category":"strongman"},"24":{"Name":"Crucifix","Force":"static","Level":"beginner","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["forearms"],"Instructions":["In the crucifix, you statically hold weights out to the side for time. While the event can be practiced using dumbbells, it is best to practice with one of the various implements used, such as axes and hammers, as it feels different.","Begin standing, and raise your arms out to the side holding the implements. Your arms should be parallel to the ground. In competition, judges or sensors are used to let you know when you break parallel. Hold for as long as you can. Typically, the weights should be heavy enough that you fail in 30-60 seconds."],"Category":"strongman"},"25":{"Name":"Depth Jump Leap","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","glutes","hamstrings"],"Instructions":["For this drill you will need two boxes or benches, one 12 to 16 inches high and the other 22 to 26 inches high.","Stand on one of the two boxes with arms at the sides; feet should be together and slightly off the edge as in the depth jump. Place the other box approximately two or three feet in front of and facing the performer.","Begin by dropping off the initial box, landing and simultaneously taking off with both feet.","Rebound by driving upward and outward as intensely as possible, using the arms and full extension of the body to jump onto the higher box. Again, allow the legs to absorb the impact."],"Category":"plyometrics"},"26":{"Name":"Dips - Chest Version","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["For this exercise you will need access to parallel bars. To get yourself into the starting position, hold your body at arms length (arms locked) above the bars.","While breathing in, lower yourself slowly with your torso leaning forward around 30 degrees or so and your elbows flared out slightly until you feel a slight stretch in the chest.","Once you feel the stretch, use your chest to bring your body back to the starting position as you breathe out. Tip: Remember to squeeze the chest at the top of the movement for a second.","Repeat the movement for the prescribed amount of repetitions."],"Category":"strength"},"27":{"Name":"Donkey Calf Raises","Force":"push","Level":"intermediate","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["calves"],"SecondaryMuscles":[],"Instructions":["For this exercise you will need access to a donkey calf raise machine. Start by positioning your lower back and hips under the padded lever provided. The tailbone area should be the one making contact with the pad.","Place both of your arms on the side handles and place the balls of your feet on the calf block with the heels extending off. Align the toes forward, inward or outward, depending on the area you wish to target, and straighten the knees without locking them. This will be your starting position.","Raise your heels as you breathe out by extending your ankles as high as possible and flexing your calf. Ensure that the knee is kept stationary at all times. There should be no bending at any time. Hold the contracted position by a second before you start to go back down.","Go back slowly to the starting position as you breathe in by lowering your heels as you bend the ankles until calves are stretched.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"28":{"Name":"Drop Push","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Position low boxes or other platforms 2-3 feet apart.","Move to a pushup position between them, supporting yourself by placing your hands on the boxes.","With good posture, drop from the platforms by pressing up and moving your hands to shoulder width, cushioning your landing by absorbing the impact through the arm."],"Category":"plyometrics"},"29":{"Name":"Farmer's Walk","Force":null,"Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["forearms"],"SecondaryMuscles":["abdominals","glutes","hamstrings","lower back","quadriceps","traps"],"Instructions":["There are various implements that can be used for the farmers walk. These can also be performed with heavy dumbbells or short bars if these implements aren't available. Begin by standing between the implements.","After gripping the handles, lift them up by driving through your heels, keeping your back straight and your head up.","Walk taking short, quick steps, and don't forget to breathe. Move for a given distance, typically 50-100 feet, as fast as possible."],"Category":"strongman"},"30":{"Name":"Foot-SMR","Force":"static","Level":"intermediate","Mechanic":null,"Equipment":"other","PrimaryMuscles":["calves"],"SecondaryMuscles":[],"Instructions":["This exercise stretches the fascia of the muscles in the feet. Start off seated with your shoes removed. Using a foot roller or a similar object, such as a small section of pvc pipe, place your foot against the roller across the arch of your foot. This will be your starting position.","Press down firmly, rolling across the arch of your foot. Hold for 10-30 seconds, and then switch feet."],"Category":"stretching"},"31":{"Name":"Forward Drag with Press","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["chest"],"SecondaryMuscles":["calves","glutes","hamstrings","quadriceps","shoulders","triceps"],"Instructions":["Attach a dual handled chain or rope attachment to the sled. You should be facing away from the sled, holding a handle in each hand.","Begin the movement by moving forward for one step. Leaning forward, extend through the legs and hips to move, pausing with each step to extend through the elbows, pressing your hands forward. Step forward until you return to the start position prepared to press."],"Category":"strongman"},"32":{"Name":"Front Box Jump","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abductors","adductors","calves","glutes","quadriceps"],"Instructions":["Begin with a box of an appropriate height 1-2 feet in front of you. Stand with your feet should width apart. This will be your starting position.","Perform a short squat in preparation for jumping, swinging your arms behind you.","Rebound out of this position, extending through the hips, knees, and ankles to jump as high as possible. Swing your arms forward and up.","Land on the box with the knees bent, absorbing the impact through the legs. You can jump from the box back to the ground, or preferably step down one leg at a time."],"Category":"plyometrics"},"33":{"Name":"Front Cone Hops (or hurdle hops)","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","glutes","hamstrings"],"Instructions":["Set up a row of cones or other small barriers, placing them a few feet apart.","Stand in front of the first cone with your feet shoulder width apart. This will be your starting position.","Begin by jumping with both feet over the first cone, swinging both arms as you jump.","Absorb the impact of landing by bending the knees, rebounding out of the first leap by jumping over the next cone.","Continue until you have jumped over all of the cones."],"Category":"plyometrics"},"34":{"Name":"Front Plate Raise","Force":"push","Level":"intermediate","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["While standing straight, hold a barbell plate in both hands at the 3 and 9 o'clock positions. Your palms should be facing each other and your arms should be extended and locked with a slight bend at the elbows and the plate should be down near your waist in front of you as far as you can go. Tip: The arms will remain in this position throughout the exercise. This will be your starting position.","Slowly raise the plate as you exhale until it is a little above shoulder level. Hold the contraction for a second. Tip: make sure that you do not swing the weight or bend at the elbows. Your torso should remain stationary throughout the movement as well.","As you inhale, slowly lower the plate back down to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"35":{"Name":"Gironda Sternum Chins","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["lats"],"SecondaryMuscles":["biceps","middle back"],"Instructions":["Grasp the pull-up bar with a shoulder width underhand grip.","Now hang with your arms fully extended and stick your chest out and lean back. Tip: You will be leaning back throughout the entire movement. This will be your starting position.","Start pulling yourself towards the bar with your spine arched throughout the movement and your head leaning back as far away from the bar as possible. Exhale as you perform this portion of the movement. Tip: At the upper end of the movement, your hips and legs will be at about a 45-degree angle to the floor.","Keep pulling until your collarbone passes the bar and your lower chest or sternum area touches it. Hold that contraction for a second. Tip: By the time you've completed this portion of the movement; your head will be parallel to the floor.","Slowly start going back to the starting position as you inhale.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"36":{"Name":"Heavy Bag Thrust","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["chest"],"SecondaryMuscles":["abdominals","shoulders","triceps"],"Instructions":["Utilize a heavy bag for this exercise. Assume an upright stance next to the bag, with your feet staggered, fairly wide apart. Place your hand on the bag at about chest height. This will be your starting position.","Begin by twisting at the waist, pushing the bag forward as hard as possible. Perform this move quickly, pushing the bag away from your body.","Receive the bag as it swings back by reversing these steps."],"Category":"plyometrics"},"37":{"Name":"Hurdle Hops","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abductors","adductors","calves","glutes","hamstrings"],"Instructions":["Set up a row of hurdles or other small barriers, placing them a few feet apart.","Stand in front of the first hurdle with your feet shoulder width apart. This will be your starting position.","Begin by jumping with both feet over the first hurdle, swinging both arms as you jump.","Absorb the impact of landing by bending the knees, rebounding out of the first leap by jumping over the next hurdle. Continue until you have jumped over all of the hurdles."],"Category":"plyometrics"},"38":{"Name":"Hyperextensions (Back Extensions)","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["lower back"],"SecondaryMuscles":["glutes","hamstrings"],"Instructions":["Lie face down on a hyperextension bench, tucking your ankles securely under the footpads.","Adjust the upper pad if possible so your upper thighs lie flat across the wide pad, leaving enough room for you to bend at the waist without any restriction.","With your body straight, cross your arms in front of you (my preference) or behind your head. This will be your starting position. Tip: You can also hold a weight plate for extra resistance in front of you under your crossed arms.","Start bending forward slowly at the waist as far as you can while keeping your back flat. Inhale as you perform this movement. Keep moving forward until you feel a nice stretch on the hamstrings and you can no longer keep going without a rounding of the back. Tip: Never round the back as you perform this exercise. Also, some people can go farther than others. The key thing is that you go as far as your body allows you to without rounding the back.","Slowly raise your torso back to the initial position as you inhale. Tip: Avoid the temptation to arch your back past a straight line. Also, do not swing the torso at any time in order to protect the back from injury.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"39":{"Name":"IT Band and Glute Stretch","Force":"static","Level":"intermediate","Mechanic":null,"Equipment":"other","PrimaryMuscles":["abductors"],"SecondaryMuscles":[],"Instructions":["Loop a belt, rope, or band around one of your feet, and swing that leg across your body to the opposite side, keeping the leg extended as you lay on the ground. This will be your starting position.","Keeping your foot off of the floor, pull on the belt, using the tension to pull the toes up. Hold for 10-20 seconds, and repeat on the other side."],"Category":"stretching"},"40":{"Name":"Incline Push-Up Depth Jump","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["For this drill you will need a box about 12 inches high, and two thick mats or aerobics steps.","Place the steps just outside of your shoulders, and place your feet on top of the box so that you are in an incline pushup position, your hands just inside the steps. This will be your starting position.","Begin by bending at the elbows to lower your body, quickly reversing position to push your body off of the ground. As you leave the ground, move your hands onto the steps, bending your elbows to absorb the impact.","Repeat the motion to return to the starting position."],"Category":"plyometrics"},"41":{"Name":"Intermediate Groin Stretch","Force":"static","Level":"intermediate","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":[],"Instructions":["Lie on your back with your legs extended. Loop a belt, rope, or band around one of your feet, and swing that leg as far to the side as you can. This will be your starting position.","Pull gently on the belt to create tension in your groin and hamstring muscles. Hold for 10-20 seconds, and repeat on the other side."],"Category":"stretching"},"42":{"Name":"Intermediate Hip Flexor and Quad Stretch","Force":"static","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":[],"Instructions":["Lie face down on the floor, with a rope, belt, or band looped around one foot.","Flex the knee and extend the hip of the leg to be stretched, using both hands to pull on the belt. Your knee and your hip should come off of the floor, creating tension in the hip flexors and quadriceps. Hold the stretch for 10-20 seconds, and repeat on the other leg."],"Category":"stretching"},"43":{"Name":"Inverted Row with Straps","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Hang a rope or suspension straps from a rack or other stable object. Grasp the ends and position yourself in a supine position hanging from the ropes. Your body should be straight with your heels on the ground with your arms fully extended. This will be your starting position.","Begin by flexing the elbow, pulling your chest to your hands. Retract your shoulder blades as you perform the movement.","Pause at the top of the motion, and return yourself to the start position.","Repeat for the desired number of repetitions."],"Category":"strength"},"44":{"Name":"Keg Load","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["lower back"],"SecondaryMuscles":["abdominals","biceps","calves","forearms","glutes","hamstrings","middle back","quadriceps","shoulders","traps"],"Instructions":["To load kegs, place the desired number a distance from the loading platform, typically 30-50 feet.","Begin by grabbing the close handle of the first keg, tilting it onto its side to grab the opposite edge of the bottom of the keg. Lift the keg up to your chest.","The higher you can place the keg, the faster you should be able to move to the platform. Shouldering is usually not allowed. Be sure to keep a firm hold on the keg. Move as quickly as possible to the platform, and load it, extending through your hips, knees, and ankles to get it as high as possible.","Return to the starting position to retrieve the next keg, and repeat until the event is completed."],"Category":"strongman"},"45":{"Name":"Kipping Muscle Up","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["lats"],"SecondaryMuscles":["abdominals","biceps","forearms","middle back","shoulders","traps","triceps"],"Instructions":["Grip the rings using a false grip, with the base of your palms on top of the rings.","Begin with a movement swinging your legs backward slightly.","Counter that movement by swinging your legs forward and up, jerking your chin and chest back, pulling yourself up with both arms as you do so. As you reach the top position of the pull-up, pull the rings to your armpits as you roll your shoulders forward, allowing your elbows to move straight back behind you. This puts you into the proper position to continue into the dip portion of the movement.","Maintaining control and stability, extend through the elbow to complete the motion.","Use care when lowering yourself to the ground."],"Category":"strength"},"46":{"Name":"Knee/Hip Raise On Parallel Bars","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["abdominals"],"SecondaryMuscles":[],"Instructions":["Position your body on the vertical leg raise bench so that your forearms are resting on the pads next to the torso and holding on to the handles. Your arms will be bent at a 90 degree angle.","The torso should be straight with the lower back pressed against the pad of the machine and the legs extended pointing towards the floor. This will be your starting position.","Now as you breathe out, lift your legs up as you keep them extended. Continue this movement until your legs are roughly parallel to the floor and then hold the contraction for a second. Tip: Do not use any momentum or swinging as you perform this exercise.","Slowly go back to the starting position as you breathe in.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"47":{"Name":"Lateral Box Jump","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["adductors"],"SecondaryMuscles":["abductors","calves","glutes","hamstrings","quadriceps"],"Instructions":["Assume a comfortable standing position, with a short box positioned next to you. This will be your starting position.","Quickly dip into a quarter squat to initiate the stretch reflex, and immediately reverse direction to jump up and to the side.","Bring your knees high enough to ensure your feet have good clearance over the box.","Land on the center of the box, using your legs to absorb the impact.","Carefully jump down to the other side of the box, and continue going back and forth for several repetitions."],"Category":"plyometrics"},"48":{"Name":"Lateral Cone Hops","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["adductors"],"SecondaryMuscles":["abductors","calves","glutes","hamstrings","quadriceps"],"Instructions":["Position a number of cones in a row several feet apart.","Stand next to the end of the cones, facing 90 degrees to the direction of travel. This will be your starting position.","Begin the jump by dipping with the knees to initiate a stretch reflex, and immediately reverse direction to push off the ground, jumping up and sideways over the cone.","Use your legs to absorb impact upon landing, and rebound into the next jump, continuing down the row of cones."],"Category":"plyometrics"},"49":{"Name":"Linear Depth Jump","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["You will need two boxes or benches spaced a few feet away from each other. Begin by standing on one box facing towards the other platform.","To initiate the movement, gently drop down to the ground between your platforms, allowing the knees and hips to flex.","Reverse the motion by exploding, extending through the hips, knees, and ankles to jump onto the other platform.","Land softly, asborbing the impact through the legs."],"Category":"plyometrics"},"50":{"Name":"Log Lift","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["abdominals","chest","glutes","hamstrings","lower back","middle back","quadriceps","traps","triceps"],"Instructions":["Begin standing with the log in front of you. Grasp the handles, and begin to clean the log. As you are bent over to start the clean, attempt to get the log as high as possible, pulling it into your chest. Extend through the hips and knees to bring it up to complete the clean.","Push your head back and look up, creating a shelf on your chest to rest the log. Begin the press by dipping, flexing slightly through the knees and reversing the motion. This push press will generate momentum to start the log moving vertically. Continue by extending through the elbows to press the log above your head. There are no strict rules on form, so use whatever techniques you are most efficient with. As the log is pressed, ensure that you push your head through on each repetition, looking forward.","Repeat as many times as possible. Attempt to control the descent of the log as it is returned to the ground."],"Category":"strongman"},"51":{"Name":"London Bridges","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["lats"],"SecondaryMuscles":["biceps","forearms","middle back"],"Instructions":["Attach a climbing rope to a high beam or cross member. Below it, ensure that the smith machine bar is locked in place with the safeties and cannot move. Alternatively, a secure box could also be utilized.","Stand on the bar, using the rope to balance yourself. This will be your starting position.","Keeping your body straight, lean back and lower your body by slowly going hand over hand with the rope. Continue until you are perpendicular to the ground.","Keeping your body straight, reverse the motion, going hand over hand back to the starting position."],"Category":"strength"},"52":{"Name":"Lying Bent Leg Groin","Force":"static","Level":"expert","Mechanic":null,"Equipment":"other","PrimaryMuscles":["adductors"],"SecondaryMuscles":[],"Instructions":["Lie on your back with your knees bent and the soles of the feet pressed together. Have your partner hold your knees. This will be your starting position.","Attempt to squeeze your knees together, while your partner prevents any movement from occurring.","After 10-20 seconds, relax your muscles as your partner gently pushes your knees towards the floor. Be sure to inform your helper when the stretch is adequate to prevent injury or overstretching."],"Category":"stretching"},"53":{"Name":"Lying Face Down Plate Neck Resistance","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["neck"],"SecondaryMuscles":[],"Instructions":["Lie face down with your whole body straight on a flat bench while holding a weight plate behind your head. Tip: You will need to position yourself so that your shoulders are slightly above the end of a flat bench in order for the upper chest, neck and face to be off the bench. This will be your starting position.","While keeping the plate secure on the back of your head slowly lower your head (as in saying \"yes\") as you breathe in.","Raise your head back up to the starting position in a semi-circular motion as you breathe out. Hold the contraction for a second.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"54":{"Name":"Lying Face Up Plate Neck Resistance","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["neck"],"SecondaryMuscles":[],"Instructions":["Lie face up with your whole body straight on a flat bench while holding a weight plate on top of your forehead. Tip: You will need to position yourself so that your shoulders are slightly above the end of a flat bench in order for the traps, neck and head to be off the bench. This will be your starting position.","While keeping the plate secure on your forehead slowly lower your head back in a semi-circular motion as you breathe in.","Raise your head back up to the starting position in a semi-circular motion as you breathe out. Hold the contraction for a second.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"55":{"Name":"Lying Hamstring","Force":"static","Level":"expert","Mechanic":null,"Equipment":"other","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves"],"Instructions":["Lie on your back with your legs extended. Your partner should be kneeling beside you. Raise one leg up towards the ceiling and have your partner hold the ankle. Your partner can use their shoulder to brace your leg if necessary. This will be your starting position.","With your partner holding your leg in place, attempt to flex the knee, contracting the hamstrings for 10-20 seconds.","Then relax your leg, allowing your partner to gently push the leg towards your head. Be sure to inform your helper when the stretch is adequate to prevent injury or overstretching. Switch sides once complete."],"Category":"stretching"},"56":{"Name":"Mixed Grip Chin","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Using a spacing that is just about 1 inch wider than shoulder width, grab a pull-up bar with the palms of one hand facing forward and the palms of the other hand facing towards you. This will be your starting position.","Now start to pull yourself up as you exhale. Tip: With the arm that has the palms facing up concentrate on using the back muscles in order to perform the movement. The elbow of that arm should remain close to the torso. With the other arm that has the palms facing forward, the elbows will be away but in line with the torso. You will concentrate on using the lats to pull your body up.","After a second contraction at the top, start to slowly come down as you inhale.","Repeat for the recommended amount of repetitions.","On the following set, switch grips; so if you had the right hand with the palms facing you and the left one with the palms facing forward, on the next set you will have the palms facing forward for the right hand and facing you for the left."],"Category":"strength"},"57":{"Name":"Muscle Up","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["lats"],"SecondaryMuscles":["abdominals","biceps","forearms","middle back","shoulders","traps","triceps"],"Instructions":["Grip the rings using a false grip, with the base of your palms on top of the rings. Initiate a pull up by pulling the elbows down to your side, flexing the elbows.","As you reach the top position of the pull-up, pull the rings to your armpits as you roll your shoulders forward, allowing your elbows to move straight back behind you. This puts you into the proper position to continue into the dip portion of the movement.","Maintaining control and stability, extend through the elbow to complete the motion.","Use care when lowering yourself to the ground."],"Category":"strength"},"58":{"Name":"Neck-SMR","Force":"static","Level":"intermediate","Mechanic":null,"Equipment":"other","PrimaryMuscles":["neck"],"SecondaryMuscles":[],"Instructions":["Using a muscle roller or a rolling pin, place the roller behind your head and against your neck. Make sure that you do not place the roller directly against the spine, but turned slightly so that the roller is pressed against the muscles to either side of the spine. This will be your starting position.","Starting at the top of your neck, slowly roll down the muscles of your neck, pausing at points of tension for 10-30 seconds."],"Category":"stretching"},"59":{"Name":"On-Your-Back Quad Stretch","Force":"static","Level":"beginner","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":[],"Instructions":["Lie on a flat bench or step, and hang one leg and arm over the side.","Bend the knee and hold the top of the foot. As you do this, be careful not to arch your lower back.","Pull the belly button to the spine to stay in neutral. Press your foot down and into your hand. To add the hip stretch, lift the hip of the leg you're holding up toward the ceiling.","Switch sides."],"Category":"stretching"},"60":{"Name":"One Arm Chin-Up","Force":"pull","Level":"expert","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","forearms","lats"],"Instructions":["For this exercise, start out by placing a towel around a chin up bar.","Grab the chin-up bar with your palm facing you. One hand will be grabbing the chin-up bar and the other will be grabbing the towel.","Bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.v","Pull your torso up until the bar touches your upper chest by drawing the shoulders and the upper arms down and back. Exhale as you perform this portion of the movement. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary as it moves through space and only the arms should move. The forearms should do no other work other than hold the bar.","After a second on the contracted position, start to inhale and slowly lower your torso back to the starting position when your arms are fully extended and the lats are fully stretched.","Repeat this motion for the prescribed amount of repetitions.","Switch arms and repeat the movement."],"Category":"strength"},"61":{"Name":"One Handed Hang","Force":"static","Level":"beginner","Mechanic":null,"Equipment":"other","PrimaryMuscles":["lats"],"SecondaryMuscles":["biceps"],"Instructions":["Grab onto a chinup bar with one hand, using a pronated grip. Keep your feet on the floor or a step. Allow the majority of your weight to hang from that hand, while keeping your feet on the ground. Hold for 10-20 seconds and switch sides."],"Category":"stretching"},"62":{"Name":"Otis-Up","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["chest","shoulders","triceps"],"Instructions":["Secure your feet and lay back on the floor. Your knees should be bent. Hold a weight with both hands to your chest. This will be your starting position.","Initiate the movement by flexing the hips and spine to raise your torso up from the ground.","As you move up, press the weight up so that it is above your head at the top of the movement.","Return the weight to your chest as you reverse the sit-up motion, ensuring not to go all the way down to the floor."],"Category":"strength"},"63":{"Name":"Overhead Lat","Force":"static","Level":"expert","Mechanic":null,"Equipment":"other","PrimaryMuscles":["lats"],"SecondaryMuscles":["triceps"],"Instructions":["Sit upright on the floor with your partner behind you. Raise one arm straight up, and flex the elbow, attempting to touch your hand to your back. Your parner should hold your tricep and wrist. This will be your starting position.","Attempt to pull your upper arm to your side as your partner prevents you from doing actually doing so.","After 10-20 seconds, relax the arm and allow your partner to further stretch the lat by applying gentle pressure to the tricep. Hold for 10-20 seconds, and then switch sides."],"Category":"stretching"},"64":{"Name":"Parallel Bar Dip","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["Stand between a set of parallel bars. Place a hand on each bar, and then take a small jump to help you get into the starting position with your arms locked out.","Begin by flexing the elbow, lowering your body until your arms break 90 degrees. Avoid swinging, and maintain good posture throughout the descent.","Reverse the motion by extending the elbow, pushing yourself back up into the starting position.","Repeat for the desired number of repetitions."],"Category":"strength"},"65":{"Name":"Peroneals Stretch","Force":"static","Level":"intermediate","Mechanic":null,"Equipment":"other","PrimaryMuscles":["calves"],"SecondaryMuscles":[],"Instructions":["In a seated position, loop a belt, rope, or band around one foot. This will be your starting position.","With the leg extended and the heel off of the ground, pull on the belt so that the foot is inverted, with the inside of the foot being pulled towards you. Hold for 10-20 seconds, and then switch sides."],"Category":"stretching"},"66":{"Name":"Plate Pinch","Force":"static","Level":"intermediate","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["forearms"],"SecondaryMuscles":[],"Instructions":["Grab two wide-rimmed plates and put them together with the smooth sides facing outward","Use your fingers to grip the outside part of the plate and your thumb for the other side thus holding both plates together. This is the starting position.","Squeeze the plate with your fingers and thumb. Hold this position for as long as you can.","Repeat for the recommended amount of sets prescribed in your program.","Switch arms and repeat the movements."],"Category":"strength"},"67":{"Name":"Plate Twist","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["abdominals"],"SecondaryMuscles":[],"Instructions":["Lie down on the floor or an exercise mat with your legs fully extended and your upper body upright. Grab the plate by its sides with both hands out in front of your abdominals with your arms slightly bent.","Slowly cross your legs near your ankles and lift them up off the ground. Your knees should also be bent slightly. Note: Move your upper body back slightly to help keep you balanced turning this exercise. This is the starting position.","Move the plate to the left side and touch the floor with it. Breathe out as you perform that movement.","Come back to the starting position as you breathe in and then repeat the movement but this time to the right side of the body. Tip: Use a slow controlled movement at all times. Jerking motions can injure the back.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"68":{"Name":"Platform Hamstring Slides","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["glutes"],"Instructions":["For this movement a wooden floor or similar is needed. Lay on your back with your legs extended. Place a gym towel or a light weight underneath your heel. This will be your starting position.","Begin the movement by flexing the knee, keeping your other leg straight.","Continue bringing the heel closer to you, sliding it on the floor.","At full knee flexion, reverse the movement to return to the starting position."],"Category":"strength"},"69":{"Name":"Posterior Tibialis Stretch","Force":"static","Level":"intermediate","Mechanic":null,"Equipment":"other","PrimaryMuscles":["calves"],"SecondaryMuscles":[],"Instructions":["In a seated position, loop a belt, rope, or band around one foot. This will be your starting position.","With the leg extended and the heel off of the ground, pull on the belt so that the foot is everted, with the outside of the foot being pulled towards you. Hold for 10-20 seconds, and then switch sides."],"Category":"stretching"},"70":{"Name":"Power Stairs","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["adductors","calves","glutes","lower back","quadriceps","shoulders","traps"],"Instructions":["In the power stairs, implements are moved up a staircase. For training purposes, these can be performed with a tire or box.","Begin by taking the implement with both hands. Set your feet wide, with your head and chest up. Drive through the ground with your heels, extending your knees and hips to raise the weight from the ground.","As you lean back, attempt to swing the weight onto the stairs, which are usually around 16-18\" high. You can use your legs to help push the weight onto the stair.","Repeat for 3-5 repetitions, and continue with a heavier weight, moving as fast as possible."],"Category":"strongman"},"71":{"Name":"Prowler Sprint","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","chest","glutes","quadriceps","shoulders"],"Instructions":["Place your sled on an appropriate surface, loaded to a suitable weight. The sled should provide enough resistance to require effort, but not so heavy that you are significantly slowed down.","You may use the upright or the low handles for this exercise. Place your hands on the handles with your arms extended, leaning into the implement.","With good posture, drive through the ground with alternating, short steps. Move as fast as you can for a short distance."],"Category":"cardio"},"72":{"Name":"Quad Stretch","Force":"static","Level":"intermediate","Mechanic":null,"Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":[],"Instructions":["Lay on your side. Loop a belt, rope, or band around your top foot. Flex the knee and extend your hip, attempting to touch your glutes with your foot, and holding the belt with your hands. This will be your starting position.","With the belt being held over the shoulder or overhead, gently pull to increase the stretch in the quadriceps. Hold for 10-20 seconds, and then switch sides."],"Category":"stretching"},"73":{"Name":"Quick Leap","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","hamstrings"],"Instructions":["You will need a box for this exerise.","Begin facing the box standing 1-2 feet from its edge.","By utilizing your hips, hop onto the box, landing on both legs. Ensure that you land with your legs bent and your feet flat.","Immediately upon landing, fully extend through the entire body and swing your arms overhead to explode off of the box. Use your legs to absorb the impact of landing."],"Category":"plyometrics"},"74":{"Name":"Reverse Plate Curls","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["biceps"],"SecondaryMuscles":["forearms"],"Instructions":["Start by standing straight with a weighted plate held by both hands and arms fully extended. Use a pronated grip (palms facing down) and make sure your fingers grab the rough side of the plate while your thumb grabs the smooth side. Note: For the best results, grab the weighted plate at an 11:00 and 1:00 o'clock position.","Your feet should be shoulder width apart from each other and the weighted plate should be near the groin area. This is the starting position.","Slowly lift the plate up while keeping the elbows in and the upper arms stationary until your biceps and forearms touch while exhaling. The plate should be evenly aligned with your torso at this point.","Feel the contraction for a second and begin to lower the weight back down to the starting position while inhaling","Repeat for the recommended amount of repetitions."],"Category":"strength"},"75":{"Name":"Rickshaw Carry","Force":null,"Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["forearms"],"SecondaryMuscles":["abdominals","calves","glutes","hamstrings","lower back","quadriceps","traps"],"Instructions":["Position the frame at the starting point, and load with the appropriate weight. Standing in the center of the frame, begin by gripping the handles and driving through your heels to lift the frame. Ensure your chest and head are up and your back is straight.","Immediately begin walking briskly with quick, controlled steps. Keep your chest up and head forward, and make sure you continue breathing. Bring the frame to the ground after you have reached the end point."],"Category":"strongman"},"76":{"Name":"Rickshaw Deadlift","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["forearms","glutes","hamstrings","lower back","traps"],"Instructions":["Load the frame with the desired weight. Center yourself between the handles. You feet should be about hip width apart. Bend at the hips to grip the handles, allowing your shoulder blades to protract.","With your feet and your grip set, take a big breath and then lower your hips and flex the knees. Look forward with your head, keep your chest up and your back arched, and begin driving through the heels to move the weight upward. As the weight comes up, pull your shoulder blades together as you drive your hips forward.","Lower the weight by bending at the hips and guiding it to the ground."],"Category":"strongman"},"77":{"Name":"Ring Dips","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["Grip a ring in each hand, and then take a small jump to help you get into the starting position with your arms locked out.","Begin by flexing the elbow, lowering your body until your arms break 90 degrees. Avoid swinging, and maintain good posture throughout the descent.","Reverse the motion by extending the elbow, pushing yourself back up into the starting position.","Repeat for the desired number of repetitions."],"Category":"strength"},"78":{"Name":"Rocky Pull-Ups/Pulldowns","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["lats"],"SecondaryMuscles":["biceps","middle back","shoulders"],"Instructions":["Grab the pull-up bar with the palms facing forward using a wide grip.","As you have both arms extended in front of you holding the bar at the chosen grip width, bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.","Pull your torso up until the bar touches your upper chest by drawing the shoulders and the upper arms down and back. Exhale as you perform this portion of the movement. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary as it moves through space and only the arms should move. The forearms should do no other work other than hold the bar.","After a second on the contracted position, start to inhale and slowly lower your torso back to the starting position when your arms are fully extended and the lats are fully stretched.","Now repeat the same movements as described above except this time your torso will remain straight as you go up and the bar will touch the back of the neck instead of the upper chest. Tip: Use the head to lean forward slightly as it will help you properly execute this portion of the exercise.","Once you have lowered yourself back down to the starting position, repeat the exercise for the prescribed amount of repetitions in your program."],"Category":"strength"},"79":{"Name":"Rope Climb","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["lats"],"SecondaryMuscles":["biceps","forearms","middle back","shoulders"],"Instructions":["Grab the rope with both hands above your head. Pull down on the rope as you take a small jump.","Wrap the rope around one leg, using your feet to pinch the rope. Reach up as high as possible with your arms, gripping the rope tightly.","Release the rope from your feet as you pull yourself up with your arms, bringing your knees towards your chest.","Resecure your feet on the rope, and then stand up to take another high hold on the rope. Continue until you reach the top of the rope.","To lower yourself, loosen the grip of your feet on the rope as you slide down using a hand over hand motion."],"Category":"strength"},"80":{"Name":"Rope Jumping","Force":null,"Level":"intermediate","Mechanic":null,"Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","hamstrings"],"Instructions":["Hold an end of the rope in each hand. Position the rope behind you on the ground. Raise your arms up and turn the rope over your head bringing it down in front of you. When it reaches the ground, jump over it. Find a good turning pace that can be maintained. Different speeds and techniques can be used to introduce variation.","Rope jumping is exciting, challenges your coordination, and requires a lot of energy. A 150 lb person will burn about 350 calories jumping rope for 30 minutes, compared to over 450 calories running."],"Category":"cardio"},"81":{"Name":"Round The World Shoulder Stretch","Force":"static","Level":"beginner","Mechanic":null,"Equipment":"other","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["biceps","chest"],"Instructions":["Stand up straight with your legs together, holding a bodybar or broomstick.","Hold the pole behind your hips with a wider than shoulder width grip. Your palms should be down and your thumbs facing out.","Slowly lift your arms up behind your head. Don't force it if it gets hard to lift further."],"Category":"stretching"},"82":{"Name":"Sandbag Load","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abdominals","biceps","calves","forearms","glutes","hamstrings","lower back","middle back","shoulders","traps"],"Instructions":["To load sandbags or other objects, begin with the implements placed a distance from the loading platform, typically 50 feet.","Begin by lifting the sandbag. Sandbags are extremely awkward, and the manner of lifting them can vary depending on the particular sandbag used. Reach as far around it as possible, extending through the hips and knees to pull it up high. Shouldering is usually not allowed.","Move as quickly as possible to the platform, and load it, extending through your hips, knees, and ankles to get it as high as possible. Place it onto the platform, ensuring it doesn't fall off.","Return to the starting position to retrieve the next sandbag, and repeat until the event is completed."],"Category":"strongman"},"83":{"Name":"Seated Band Hamstring Curl","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":[],"Instructions":["Secure a band close to the ground and place a bench a couple feet away from it.","Seat yourself on the bench and secure the band behind your ankles, beginning with your legs straight. This will be your starting position.","Flex the knees, bringing your feet towards the bench. You may need to lean back slightly to keep your feet from striking the floor.","Pause at the completion of the movement, and then slowly return to the starting position."],"Category":"strength"},"84":{"Name":"Seated Hamstring and Calf Stretch","Force":"static","Level":"intermediate","Mechanic":null,"Equipment":"other","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves"],"Instructions":["Loop a belt, rope, or band around one foot. Sit down with both legs extended . This will be your starting position.","Leaning forward slightly, pull on the belt to draw the toes of your foot back. Hold this position for 10-20 seconds and then repeat with the other leg."],"Category":"stretching"},"85":{"Name":"Seated Head Harness Neck Resistance","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["neck"],"SecondaryMuscles":[],"Instructions":["Place a neck strap on the floor at the end of a flat bench. Once you have selected the weights, sit at the end of the flat bench with your feet wider than shoulder width apart from each other. Your toes should be pointed out.","Slowly move your torso forward until it is almost parallel with the floor. Using both hands, securely position the neck strap around your head. Tip: Make sure the weights are still lying on the floor to prevent any strain on the neck. Now grab the weight with both hands while elevating your torso back until it is almost perpendicular to the floor. Note: Your head and torso needs to be slightly tilted forward to perform this exercise.","Now place both hands on top of your knees. This is the starting position.","Slowly lower your neck down until your chin touches the upper part of your chest while breathing in.","While exhaling, bring your neck back to the starting position.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"86":{"Name":"Side Hop-Sprint","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","hamstrings"],"Instructions":["Stand to the side of a cone or hurdle.","Begin this drill by hopping sideways over the obstacle, rebounding out of your landing to hop back to where you started.","Hop for a prescribed number or repetitions as quickly as possible, and finish this drill by sprinting a short distance upon landing the last hop."],"Category":"plyometrics"},"87":{"Name":"Side To Side Chins","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["lats"],"SecondaryMuscles":["biceps","forearms","middle back","shoulders"],"Instructions":["Grab the pull-up bar with the palms facing forward using a wide grip.","As you have both arms extended in front of you holding the bar at a wide grip, bring your torso back around 30 degrees or so while creating a curvature on your lower back and sticking your chest out. This is your starting position.","Pull your torso up while leaning to the left hand side until the bar almost touches your upper chest by drawing the shoulders and the upper arms down and back. Exhale as you perform this portion of the movement. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary as it moves through space (no swinging) and only the arms should move. The forearms should do no other work other than hold the bar.","After a second of contraction, inhale as you go back to the starting position.","Now, pull your torso up while leaning to the right hand side until the bar almost touches your upper chest by drawing the shoulders and the upper arms down and back. Exhale as you perform this portion of the movement. Tip: Concentrate on squeezing the back muscles once you reach the full contracted position. The upper torso should remain stationary as it moves through space and only the arms should move. The forearms should do no other work other than hold the bar.","After a second of contraction, inhale as you go back to the starting position.","Repeat steps 3-6 until you have performed the prescribed amount of repetitions for each side."],"Category":"strength"},"88":{"Name":"Side to Side Box Shuffle","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","hamstrings"],"Instructions":["Stand to one side of the box with your left foot resting on the middle of it.","To begin, jump up and over to the other side of the box, landing with your right foot on top of the box and your left foot on the floor. Swing your arms to aid your movement.","Continue shuffling back and forth across the box."],"Category":"plyometrics"},"89":{"Name":"Single-Cone Sprint Drill","Force":"push","Level":"beginner","Mechanic":null,"Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["This drill teaches quick foot action. You need a single cone. Begin standing next to the cone with one arm back and one arm forward.","Chop the feet as quickly as possible, blocking with the arms. Circle the cone, keep your knees up, with violent foot action.","Rest after three trips around the cone."],"Category":"plyometrics"},"90":{"Name":"Single-Leg High Box Squat","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["glutes","hamstrings"],"Instructions":["Position a box in a rack. Secure a band or rope in place above the box.","Standing in front of it, step onto the box to a full standing position, letting your other leg remain unsupported. Hold onto the band for balance",". Continue stepping up and down on the same leg before switching to the opposite side."],"Category":"strength"},"91":{"Name":"Single-Leg Hop Progression","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","hamstrings"],"Instructions":["Arrange a line of cones in front of you. Assume a relaxed standing position, balanced on one leg. Raise the knee of your opposite leg. This will be your starting position.","Hop forward, jumping and landing with the same leg over the cone.","Use a countermovement jump to hop from cone to cone.","At the end, turn around and go back on the other leg."],"Category":"plyometrics"},"92":{"Name":"Single-Leg Lateral Hop","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","hamstrings"],"Instructions":["Stand to the side of a cone or hurdle. To get into the start position, stand on one leg with your knee slightly bent.","To begin, execute a counterjump to hop sideways over the cone.","Land on your jumping leg, and immediately rebound out of it by jumping back to the start position.","Continue hopping back and forth."],"Category":"plyometrics"},"93":{"Name":"Single-Leg Stride Jump","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","hamstrings"],"Instructions":["Stand to the side of a box with your inside foot on top of it, close to the edge.","Begin by swinging the arms upward as you push through the top leg, jumping upward as high as possible. Attempt to drive the opposite knee upward.","Land in the same position that you started, using your inside leg to decelerate the impact."],"Category":"plyometrics"},"94":{"Name":"Single Leg Push-off","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","hamstrings"],"Instructions":["Stand on the ground with one foot resting on the box, heel close to the edge.","Push off with your foot on top of the box, trying to gain as much height as possible by extending through the hip and knee.","Land with the same foot on top of the box, returning your other foot back to the start position."],"Category":"plyometrics"},"95":{"Name":"Skating","Force":null,"Level":"intermediate","Mechanic":null,"Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","glutes","hamstrings"],"Instructions":["Roller skating is a fun activity which can be effective in improving cardiorespiratory fitness and muscular endurance. It requires relatively good balance and coordination. It is necessary to learn the basics of skating including turning and stopping and to wear protective gear to avoid possible injury.","You can skate at a comfortable pace for 30 minutes straight. If you want a cardio challenge, do interval skating  speed skate two minutes of every five minutes, using the remaining three minutes to recover. A 150 lb person will typically burn about 175 calories in 30 minutes skating at a comfortable pace, similar to brisk walking."],"Category":"cardio"},"96":{"Name":"Sled Drag - Harness","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["To begin, load the sled with the desired weight and attach the pulling strap. You can pull with handles, use a harness, or attach the pulling strap to a weight belt.","Whether pulling forwards or backwards, lean in the direction of travel and progress by extending through the hips and knees."],"Category":"strongman"},"97":{"Name":"Sled Overhead Backward Walk","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["calves","middle back","quadriceps"],"Instructions":["Attach dual handles to a sled connected by a rope or chain. Load the sled to a light weight.","Face the sled, backing up until there is some tension in the line. Hold your hands directly above your head with your elbows extended. This will be your starting position.","Walk backwards, keeping your arms raised above your head. Avoid jerky movements."],"Category":"strength"},"98":{"Name":"Sled Overhead Triceps Extension","Force":"push","Level":"beginner","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["triceps"],"SecondaryMuscles":[],"Instructions":["Attach dual handles to a sled using a chain or rope. Load the sled to an appropriate load.","Facing away from the sled, step away until there is tension in the line. Raise your hands above your head, keeping them together, palms facing each other. Your elbows should be pointed upward with the elbows flexed. This will be your starting position.","Extend through the elbow to straighten the arm. Ensure that your upper arm stays in position to isolate the triceps.","Upon full extension, step forward to take the slack out of the line. You may keep your feet staggered for more stability."],"Category":"strength"},"99":{"Name":"Sled Push","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","chest","glutes","hamstrings","triceps"],"Instructions":["Load your pushing sled with the desired weight.","Take an athletic posture, leaning into the sled with your arms fully extended, grasping the handles. Push the sled as fast as possible, focusing on extending your hips and knees to strengthen your posterior chain."],"Category":"strongman"},"100":{"Name":"Sled Reverse Flye","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["Attach dual handles to a sled connected by a rope or chain. Load the sled to a light weight.","Face the sled, backing up until there is some tension in the line. Take both handles at arms length at about waist level. Bend the knees slightly and keep your chest and head up. This will be your starting position.","Without flexing the elbow, pull the handles upward and apart, performing a reverse fly with some external rotation. Your palms should be facing forward as you do this.","Return to the starting position, taking a couple steps back to take the slack out of the line."],"Category":"strength"},"101":{"Name":"Sled Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Attach dual handles to a sled connected by a rope or chain. Load the sled to an appropriate weight. Face the sled, backing up until there is some tension in the line.","With a handle in each hand, bend the knees slightly, keep your head and chest up, and begin with your arms extended.","To initiate the movement, flex the elbow as you retract your shoulder blades, pulling the sled towards you.","Take a step or two back to get tension in the line and repeat."],"Category":"strength"},"102":{"Name":"Sledgehammer Swings","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["calves","forearms","lats","middle back","shoulders"],"Instructions":["You will need a tire and a sledgehammer for this exercise. Stand in front of the tire about two feet away from it with a staggered stance. Grip the sledgehammer.","If you are right handed, your left hand should be at the bottom of the handle, and your right hand should be choking up closer to the head.","As you bring the sledge up, your right hand slides toward the head; as you swing down, your right hand will slide down to join your left hand. Slam it down as hard as you can against the tire. Control the bounce of the hammer off of the tire.","Repeat on the other side."],"Category":"plyometrics"},"103":{"Name":"Standing Biceps Stretch","Force":"static","Level":"beginner","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["biceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["Clasp your hands behind your back with your palms together, straighten arms and then rotate them so your palms face downward.","Raise your arms up and hold until you feel a stretch in your biceps."],"Category":"stretching"},"104":{"Name":"Standing Elevated Quad Stretch","Force":"static","Level":"beginner","Mechanic":null,"Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":[],"Instructions":["Start by standing with your back about two to three feet away from a bench or step.","Lift one leg behind you and rest your foot on the step,either on your instep or the ball of your foot, whichever you find most comfortable.","Keep your supporting knee slightly bent and avoid letting that knee extend out beyond your toes. Switch sides."],"Category":"stretching"},"105":{"Name":"Standing Hamstring and Calf Stretch","Force":"static","Level":"beginner","Mechanic":null,"Equipment":"other","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":[],"Instructions":["Being by looping a belt, band, or rope around one foot. While standing, place that foot forward.","Bend your back leg, while keeping the front one straight. Now raise the toes of your front foot off of the ground and lean forward.","Using the belt, pull on the top of the foot to increase the stretch in the calf. Hold for 10-20 seconds and repeat with the other foot."],"Category":"stretching"},"106":{"Name":"Standing Olympic Plate Hand Squeeze","Force":"static","Level":"beginner","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["forearms"],"SecondaryMuscles":["biceps"],"Instructions":["To begin, stand straight while holding a weight plate by the ridge at arm's length in each hand using a neutral grip (palms facing in). You feet should be shoulder width apart from each other. This will be your starting position.","Lower the plates until the fingers are nearly extended but can still hold weights. Inhale as you lower the plates.","Now raise the plates back to the starting position as you exhale by closing your hands.","Repeat for the recommended amount of repetitions prescribed in your program."],"Category":"strength"},"107":{"Name":"Stride Jump Crossover","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","hamstrings"],"Instructions":["Stand to the side of a box with your inside foot on top of it, close to the edge.","Begin by swinging the arms upward as you push through the top leg, jumping upward as high as possible. Attempt to drive the opposite knee upward.","Land in the opposite position that you started, on the opposite side of the box. The foot that was initially on the box will now be on the ground, with the opposite foot now on the box.","Repeat the movement, crossing back over to the other side."],"Category":"plyometrics"},"108":{"Name":"Suspended Fallout","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["chest","lower back","shoulders"],"Instructions":["Adjust the straps so the handles are at an appropriate height, below waist level.","Begin standing and grasping the handles. Lean into the straps, moving to an incline push-up position. This will be your starting position.","Keeping your arms straight, lean further into the suspension straps, bringing your body closer to the ground, allowing your shoulders to extend, raising your arms up and over your head.","Maintain a neutral spine and keep the rest of your body straight, your shoulders being the only joints allowed to move.","Pause during the peak contraction, and then return to the starting position."],"Category":"strength"},"109":{"Name":"Suspended Push-Up","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Anchor your suspension straps securely to the top of a rack or other object.","Leaning into the straps, take a handle in each hand and move into a push-up plank position. You should be as close to parallel to the ground as you can manage with your arms fully extended, maintaining good posture.","Maintaining a straight, rigid torso, descend slowly by allowing the elbows to flex.","Continue until your elbows break 90 degrees, pausing before you extend to return to the starting position."],"Category":"strength"},"110":{"Name":"Suspended Reverse Crunch","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["abdominals"],"SecondaryMuscles":[],"Instructions":["Secure a set of suspension straps with the handles hanging about a foot off of the ground. Move yourself into a pushup plank position facing away from the rack.","Place your feet into the handles. You should maintain a straight posture, not allowing the hips to sag. This will be your starting position.","Begin the movement by flexing the knees and hips, drawing the knees to your torso. As you do so, anteriorly tilt your pelvis, allowing your spine to flex.","At the top of the controlled motion, return to the starting position."],"Category":"strength"},"111":{"Name":"Suspended Row","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["middle back"],"SecondaryMuscles":["biceps","lats"],"Instructions":["Suspend your straps at around chest height. Take a handle in each hand and lean back. Keep your body erect and your head and chest up. Your arms should be fully extended. This will be your starting position.","Begin by flexing the elbow to initiate the movement. Protract your shoulder blades as you do so.","At the completion of the motion pause, and then return to the starting position."],"Category":"strength"},"112":{"Name":"Suspended Split Squat","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","glutes","hamstrings"],"Instructions":["Suspend your straps so the handles are 18-30 inches from the floor.","Facing away from the setup, place your rear foot into the handle behind you. Keep your head looking forward and your chest up, with your knee slightly bent. This will be your starting position.","Descend by flexing the knee and hips, lowering yourself to the ground. Keep your weight on the heel of your foot and maintain your posture throughout the exercise.","At the bottom of the movement, reverse the motion, extending through the hip and knee to return to the starting position."],"Category":"strength"},"113":{"Name":"Svend Press","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["chest"],"SecondaryMuscles":["forearms","shoulders","triceps"],"Instructions":["Begin in a standing position.","Press two lightweight plates together with your hands. Hold the plates together close to your chest to create an isometric contraction in your chest muscles. Your fingers should be pointed forward. This is your starting position.","Squeeze the plates between your palms and extend your arms directly out in front of you in a controlled motion.","Pause at the top of the motion, and then slowly return to the starting position."],"Category":"strength"},"114":{"Name":"Tire Flip","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","chest","forearms","glutes","hamstrings","lower back","shoulders","traps","triceps"],"Instructions":["Begin by gripping the bottom of the tire on the tread, and position your feet back a bit. Your chest should be driving into the tire.","To lift the tire, extend through the hips, knees, and ankles, driving into the tire and up.","As the tire reaches a 45 degree angle, step forward and drive a knee into the tire. As you do so adjust your grip to the upper portion of the tire and push it forward as hard as possible to complete the turn. Repeat as necessary."],"Category":"strongman"},"115":{"Name":"Trap Bar Deadlift","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["glutes","hamstrings"],"Instructions":["For this exercise load a trap bar, also known as a hex bar, to an appropriate weight resting on the ground. Stand in the center of the apparatus and grasp both handles.","Lower your hips, look forward with your head and keep your chest up.","Begin the movement by driving through the heels and extend your hips and knees. Avoid rounding your back at all times.","At the completion of the movement, lower the weight back to the ground under control."],"Category":"strength"},"116":{"Name":"Weighted Bench Dip","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["For this exercise you will need to place a bench behind your back and another one in front of you. With the benches perpendicular to your body, hold on to one bench on its edge with the hands close to your body, separated at shoulder width. Your arms should be fully extended.","The legs will be extended forward on top of the other bench. Your legs should be parallel to the floor while your torso is to be perpendicular to the floor. Have your partner place the dumbbell on your lap. Note: This exercise is best performed with a partner as placing the weight on your lap can be challenging and cause injury without assistance. This will be your starting position.","Slowly lower your body as you inhale by bending at the elbows until you lower yourself far enough to where there is an angle slightly smaller than 90 degrees between the upper arm and the forearm. Tip: Keep the elbows as close as possible throughout the movement. Forearms should always be pointing down.","Using your triceps to bring your torso up again, lift yourself back to the starting position while exhaling.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"117":{"Name":"Weighted Pull Ups","Force":"pull","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["lats"],"SecondaryMuscles":["biceps","middle back"],"Instructions":["Attach a weight to a dip belt and secure it around your waist. Grab the pull-up bar with the palms of your hands facing forward. For a medium grip, your hands should be spaced at shoulder width. Both arms should be extended in front of you holding the bar at the chosen grip.","Youll want to bring your torso back about 30 degrees while creating a curvature in your lower back and sticking your chest out. This will be your starting position.","Now, exhale and pull your torso up until your head is above your hands. Concentrate on squeezing yourshoulder blades back and down as you reach the top contracted position.","After a brief moment at the top contracted position, inhale and slowly lower your torso back to the starting position with your arms extended and your lats fully stretched."],"Category":"strength"},"118":{"Name":"Weighted Sit-Ups - With Bands","Force":"pull","Level":"intermediate","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["abdominals"],"SecondaryMuscles":[],"Instructions":["Start out by strapping the bands around the base of the decline bench. Place the handles towards the inside of the decline bench so that when lying down, you can reach for both of them.","Position your legs through the decline machine until they are secured. Now reach for the exercise bands with both hands. Use a pronated (palms forward) grip to grasp the handles. Position them near your collar bone and rotate your wrist to a neutral grip (palms facing the torso). Note: Your arms should remain stationary throughout the exercise. This is the starting position.","Move your torso upward until your upper body is perpendicular to the floor while exhaling. Hold the contraction for a second and lower your upper body back down to the starting position while inhaling.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"119":{"Name":"Weighted Squat","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Start by positioning two flat benches shoulder width apart from each other. Stand on top of them and wrap the weighted belt around your waist with the amount of weight you feel comfortable with. Make sure your toes are facing out.","Once you are standing straight up with the weight hanging in between your legs, position your arms so that they are fully extended to the side of your body. This is the starting position.","Begin by bending the knees as you maintain a straight posture with the head up. Continue down until the angle between the upper leg and the calves becomes slightly less than 90-degrees (which is the point in which the upper legs are below parallel to the floor). Inhale as you perform this portion of the movement. Tip: If you performed the exercise correctly, the front of the knees should make an imaginary straight line with the toes that are perpendicular to the front. If your knees are past that imaginary line (if they are past your toes) then you are placing undue stress on the knee and the exercise has been performed incorrectly.","Begin to move the body back up by pushing the floor of the flat bench with the ball of your foot mainly as you straighten the legs again and go back to the starting position. Exhale as you perform this portion of the exercise.","Repeat for the recommended amount of repetitions."],"Category":"strength"},"120":{"Name":"Wrist Roller","Force":"pull","Level":"beginner","Mechanic":"isolation","Equipment":"other","PrimaryMuscles":["forearms"],"SecondaryMuscles":["shoulders"],"Instructions":["To begin, stand straight up grabbing a wrist roller using a pronated grip (palms facing down). Your feet should be shoulder width apart.","Slowly lift both arms until they are fully extended and parallel to the floor in front of you. Note: Make sure the rope is not wrapped around the roller. Your entire body should be stationary except for the forearms. This is the starting position.","Rotate one wrist at a time in an upward motion to bring the weight up to the bar by rolling the rope around the roller.","Once the weight has reached the bar, slowly begin to lower the weight back down by rotating the wrist in a downward motion until the weight reaches the starting position.","Repeat for the prescribed amount of repetitions in your program."],"Category":"strength"},"121":{"Name":"Yoke Walk","Force":null,"Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abdominals","abductors","adductors","calves","glutes","hamstrings","lower back"],"Instructions":["The yoke is usually done with a yoke apparatus, but is sometimes seen with refrigerators or other heavy objects.","Begin by racking the apparatus across the back of the shoulders. With your head looking forward and back arched, lift the yoke by driving through the heels.","Begin walking as quickly as possible using short, quick steps. You may hold the side posts of the yoke to help steady it and hold it in position. Continue for the given distance as fast as possible, usually 75-100 feet."],"Category":"strongman"}}