{"0":{"Name":"Alternate Leg Diagonal Bound","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":null,"PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","glutes","hamstrings"],"Instructions":["Assume a comfortable stance with one foot slightly in front of the other.","Begin by pushing off with the front leg, driving the opposite knee forward and as high as possible before landing. Attempt to cover as much distance to each side with each bound.","It may help to use a line on the ground to guage distance from side to side.","Repeat the sequence with the other leg."],"Category":"plyometrics"},"1":{"Name":"Backward Medicine Ball Throw","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["shoulders"],"SecondaryMuscles":[],"Instructions":["This exercise is best done with a partner. If you lack a partner, the ball can be thrown and retrieved or thrown against a wall.","Begin standing a few meters in front of your partner, both facing the same direction. Begin holding the ball between your legs.","Squat down and then forcefully reverse direction, coming to full extension and you toss the ball over your head to your partner.","Your partner can then roll the ball back to you. Repeat for the desired number of repetitions."],"Category":"plyometrics"},"2":{"Name":"Bench Jump","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"body only","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Begin with a box or bench 1-2 feet in front of you. Stand with your feet shoulder width apart. This will be your starting position.","Perform a short squat in preparation for the jump; swing your arms behind you.","Rebound out of this position, extending through the hips, knees, and ankles to jump as high as possible. Swing your arms forward and up.","Jump over the bench, landing with the knees bent, absorbing the impact through the legs.","Turn around and face the opposite direction, then jump back over the bench."],"Category":"plyometrics"},"3":{"Name":"Bench Sprint","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Stand on the ground with one foot resting on a bench or box with your heel close to the edge.","Push off with your foot on top of the bench, extending through the hip and knee.","Land with the opposite foot on top of the box, returning your other foot back to the start position.","Continue alternating from one foot to another to complete the set."],"Category":"plyometrics"},"4":{"Name":"Box Jump (Multiple Response)","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abductors","adductors","calves","glutes","quadriceps"],"Instructions":["Assume a relaxed stance facing the box or platform approximately an arm's length away. Arms should be down at the sides and legs slightly bent.","Using the arms to aid in the initial burst, jump upward and forward, landing with feet simultaneously on top of the box or platform.","Immediately drop or jump back down to the original starting place; then repeat the sequence."],"Category":"plyometrics"},"5":{"Name":"Box Skip","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abductors","adductors","calves","glutes","quadriceps"],"Instructions":["You will need several boxes lined up about 8 feet apart.","Begin facing the first box with one leg slightly behind the other.","Drive off the back leg, attempting to gain as much height with the hips as possible.","Immediately upon landing on the box, drive the other leg forward and upward to gain height and distance, leaping from the box. Land between the first two boxes with the same leg that landed on the first box.","Then, step to the next box and repeat."],"Category":"plyometrics"},"6":{"Name":"Carioca Quick Step","Force":null,"Level":"beginner","Mechanic":null,"Equipment":null,"PrimaryMuscles":["adductors"],"SecondaryMuscles":["abdominals","abductors","calves","glutes","hamstrings","quadriceps"],"Instructions":["Begin with your feet a few inches apart and your left arm up in a relaxed, athletic position.","With your right foot, quick step behind and pull the knee up.","Fire your arms back up when you pull the right knee, being sure that your knee goes straight up and down. Avoid turning your feet as you move and continue to look forward as you move to the side."],"Category":"plyometrics"},"7":{"Name":"Catch and Overhead Throw","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["lats"],"SecondaryMuscles":["abdominals","chest","shoulders"],"Instructions":["Begin standing while facing a wall or a partner.","Using both hands, position the ball behind your head, stretching as much as possible, and forcefully throw the ball forward.","Ensure that you follow your throw through, being prepared to receive your rebound from your throw. If you are throwing against the wall, make sure that you stand close enough to the wall to receive the rebound, and aim a little higher than you would with a partner."],"Category":"plyometrics"},"8":{"Name":"Chest Push (multiple response)","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["chest"],"SecondaryMuscles":["abdominals","shoulders","triceps"],"Instructions":["Begin in a kneeling position facing a wall or utilize a partner. Hold the ball with both hands tight into the chest.","Execute the pass by exploding forward and outward with the hips while pushing the ball as hard as possible.","Follow through by falling forward, catching yourself with your hands.","Immediately return to an upright position. Repeat for the desired number of repetitions."],"Category":"plyometrics"},"9":{"Name":"Chest Push (single response)","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["chest"],"SecondaryMuscles":["abdominals","shoulders","triceps"],"Instructions":["Begin in a kneeling position holding the medicine ball with both hands tightly into the chest.","Execute the pass by exploding forward and outward with the hips while pushing the ball as far as possible.","Follow through by falling forward, catching yourself with your hands."],"Category":"plyometrics"},"10":{"Name":"Chest Push from 3 point stance","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["chest"],"SecondaryMuscles":["abdominals","shoulders","triceps"],"Instructions":["Begin in a three point stance, squatted down with your back flat and one hand on the ground. Place the medicine ball directly in front of you.","To begin, take your first step as you pull the ball to your chest, positioning both hands to prepare for the throw.","As you execute the second step, explosively release the ball forward as hard as possible."],"Category":"plyometrics"},"11":{"Name":"Chest Push with Run Release","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["chest"],"SecondaryMuscles":["abdominals","shoulders","triceps"],"Instructions":["Begin in an athletic stance with the knees bent, hips back, and back flat. Hold the medicine ball near your legs. This will be your starting position.","While taking your first step draw the medicine ball into your chest.","As you take the second step, explosively push the ball forward, immediately sprinting for 10 yards after the release. If you are really fast, you can catch your own pass!"],"Category":"plyometrics"},"12":{"Name":"Depth Jump Leap","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","glutes","hamstrings"],"Instructions":["For this drill you will need two boxes or benches, one 12 to 16 inches high and the other 22 to 26 inches high.","Stand on one of the two boxes with arms at the sides; feet should be together and slightly off the edge as in the depth jump. Place the other box approximately two or three feet in front of and facing the performer.","Begin by dropping off the initial box, landing and simultaneously taking off with both feet.","Rebound by driving upward and outward as intensely as possible, using the arms and full extension of the body to jump onto the higher box. Again, allow the legs to absorb the impact."],"Category":"plyometrics"},"13":{"Name":"Double Leg Butt Kick","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"body only","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","glutes","hamstrings"],"Instructions":["Begin standing with your knees slightly bent.","Quickly squat a short distance, flexing the hips and knees, and immediately extend to jump for maximum vertical height.","As you go up, tuck your heels by flexing the knees, attempting to touch the buttocks.","Finish the motion by landing with the knees only partially bent, using your legs to absorb the impact."],"Category":"plyometrics"},"14":{"Name":"Drop Push","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Position low boxes or other platforms 2-3 feet apart.","Move to a pushup position between them, supporting yourself by placing your hands on the boxes.","With good posture, drop from the platforms by pressing up and moving your hands to shoulder width, cushioning your landing by absorbing the impact through the arm."],"Category":"plyometrics"},"15":{"Name":"Dumbbell Seated Box Jump","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Position a box a couple feet to the side of a bench. Hold a dumbbell to your chest with both hands and seat yourself on the bench facing the box. This will be your starting position.","Plant your feet firmly on the ground as you lean forward, extending through the hips and knees to jump up and forward.","Land on the box with both feet, absorbing the impact by allowing the hips and knees to bend.","Step down and return to the starting position."],"Category":"plyometrics"},"16":{"Name":"Fast Skipping","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"body only","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","glutes","hamstrings"],"Instructions":["Start in a relaxed position with one leg slightly forward. This will be your starting position.","Skip by executing a step-hop pattern of right-right-step to left-left-step, and so on, alternating back and forth.","Perform fast skips by maintaining close contact with the ground and reduce air time, moving as quickly as possible."],"Category":"plyometrics"},"17":{"Name":"Front Box Jump","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abductors","adductors","calves","glutes","quadriceps"],"Instructions":["Begin with a box of an appropriate height 1-2 feet in front of you. Stand with your feet should width apart. This will be your starting position.","Perform a short squat in preparation for jumping, swinging your arms behind you.","Rebound out of this position, extending through the hips, knees, and ankles to jump as high as possible. Swing your arms forward and up.","Land on the box with the knees bent, absorbing the impact through the legs. You can jump from the box back to the ground, or preferably step down one leg at a time."],"Category":"plyometrics"},"18":{"Name":"Front Cone Hops (or hurdle hops)","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","glutes","hamstrings"],"Instructions":["Set up a row of cones or other small barriers, placing them a few feet apart.","Stand in front of the first cone with your feet shoulder width apart. This will be your starting position.","Begin by jumping with both feet over the first cone, swinging both arms as you jump.","Absorb the impact of landing by bending the knees, rebounding out of the first leap by jumping over the next cone.","Continue until you have jumped over all of the cones."],"Category":"plyometrics"},"19":{"Name":"Heavy Bag Thrust","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["chest"],"SecondaryMuscles":["abdominals","shoulders","triceps"],"Instructions":["Utilize a heavy bag for this exercise. Assume an upright stance next to the bag, with your feet staggered, fairly wide apart. Place your hand on the bag at about chest height. This will be your starting position.","Begin by twisting at the waist, pushing the bag forward as hard as possible. Perform this move quickly, pushing the bag away from your body.","Receive the bag as it swings back by reversing these steps."],"Category":"plyometrics"},"20":{"Name":"Hurdle Hops","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abductors","adductors","calves","glutes","hamstrings"],"Instructions":["Set up a row of hurdles or other small barriers, placing them a few feet apart.","Stand in front of the first hurdle with your feet shoulder width apart. This will be your starting position.","Begin by jumping with both feet over the first hurdle, swinging both arms as you jump.","Absorb the impact of landing by bending the knees, rebounding out of the first leap by jumping over the next hurdle. Continue until you have jumped over all of the hurdles."],"Category":"plyometrics"},"21":{"Name":"Incline Push-Up Depth Jump","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["For this drill you will need a box about 12 inches high, and two thick mats or aerobics steps.","Place the steps just outside of your shoulders, and place your feet on top of the box so that you are in an incline pushup position, your hands just inside the steps. This will be your starting position.","Begin by bending at the elbows to lower your body, quickly reversing position to push your body off of the ground. As you leave the ground, move your hands onto the steps, bending your elbows to absorb the impact.","Repeat the motion to return to the starting position."],"Category":"plyometrics"},"22":{"Name":"Isometric Chest Squeezes","Force":"static","Level":"beginner","Mechanic":"compound","Equipment":"body only","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["While either seating or standing, bend your arms at a 90-degree angle and place the palms of your hands together in front of your chest. Tip: Your hands should be open with the palms together and fingers facing forward (perpendicular to your torso).","Push both hands against each other as you contract your chest. Start with slow tension and increase slowly. Keep breathing normally as you execute this contraction.","Hold for the recommended number of seconds.","Now release the tension slowly.","Rest for the recommended amount of time and repeat."],"Category":"plyometrics"},"23":{"Name":"Knee Tuck Jump","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"body only","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["abductors","adductors","calves","glutes","quadriceps"],"Instructions":["Begin in a comfortable standing position with your knees slightly bent. Hold your hands in front of you, palms down with your fingertips together at chest height. This will be your starting position.","Rapidly dip down into a quarter squat and immediately explode upward. Drive the knees towards the chest, attempting to touch them to the palms of the hands.","Jump as high as you can, raising your knees up, and then ensure a good land be re-extending your legs, absorbing impact through be allowing the knees to rebend."],"Category":"plyometrics"},"24":{"Name":"Kneeling Arm Drill","Force":"pull","Level":"beginner","Mechanic":null,"Equipment":null,"PrimaryMuscles":["shoulders"],"SecondaryMuscles":["abdominals"],"Instructions":["This drill helps increase arm efficiency during the run. Begin kneeling, left foot in front, right knee down. Apply pressure through the front heel to keep your glutes and hamstrings activated.","Begin by blocking the arms in long, pendulum like swings. Close the arm angle, blocking with the arms as you would when jogging, progressing to a run and finally a sprint.","As soon as your hands pass the hip, accelerate them forward during the sprinting motion to move them as quickly as possible.","Switch knees and repeat."],"Category":"plyometrics"},"25":{"Name":"Lateral Bound","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"body only","PrimaryMuscles":["adductors"],"SecondaryMuscles":["abductors","calves","glutes","hamstrings","quadriceps"],"Instructions":["Assume a half squat position facing 90 degrees from your direction of travel. This will be your starting position.","Allow your lead leg to do a countermovement inward as you shift your weight to the outside leg.","Immediately push off and extend, attempting to bound to the side as far as possible.","Upon landing, immediately push off in the opposite direction, returning to your original start position.","Continue back and forth for several repetitions."],"Category":"plyometrics"},"26":{"Name":"Lateral Box Jump","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["adductors"],"SecondaryMuscles":["abductors","calves","glutes","hamstrings","quadriceps"],"Instructions":["Assume a comfortable standing position, with a short box positioned next to you. This will be your starting position.","Quickly dip into a quarter squat to initiate the stretch reflex, and immediately reverse direction to jump up and to the side.","Bring your knees high enough to ensure your feet have good clearance over the box.","Land on the center of the box, using your legs to absorb the impact.","Carefully jump down to the other side of the box, and continue going back and forth for several repetitions."],"Category":"plyometrics"},"27":{"Name":"Lateral Cone Hops","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["adductors"],"SecondaryMuscles":["abductors","calves","glutes","hamstrings","quadriceps"],"Instructions":["Position a number of cones in a row several feet apart.","Stand next to the end of the cones, facing 90 degrees to the direction of travel. This will be your starting position.","Begin the jump by dipping with the knees to initiate a stretch reflex, and immediately reverse direction to push off the ground, jumping up and sideways over the cone.","Use your legs to absorb impact upon landing, and rebound into the next jump, continuing down the row of cones."],"Category":"plyometrics"},"28":{"Name":"Linear 3-Part Start Technique","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":null,"PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","quadriceps"],"Instructions":["This drill helps you accelerate as quickly as possible into a sprint from a dead stop. It helps to use a line to start from. Begin with two feet on the line. Place your left foot with the toe next to your right ankle. Place your right foot 4-6 inches behind the left.","Place your right hand onto the line, and thing bring your nose close to your left knee.","Squat down as you lean foward, your head being lower than your hips and your weight loaded onto the left leg. This will be your starting position.","Take your left hand up so that it is parallel to the ground, pointing behind you, and explode out when ready."],"Category":"plyometrics"},"29":{"Name":"Linear Acceleration Wall Drill","Force":null,"Level":"beginner","Mechanic":"compound","Equipment":null,"PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","glutes","quadriceps"],"Instructions":["Lean at around 45 degrees against a wall. Your feet should be together, glutes contracted.","Begin by lifting your right knee quickly, pausing, and then driving it straight down into the ground.","Switch legs, raising the opposite knee, and then attacking the ground straight down.","Repeat once more with your right leg, and as soon as the right foot strikes the ground hammer them out rapidly, alternating left and right as fast as you can."],"Category":"plyometrics"},"30":{"Name":"Linear Depth Jump","Force":"push","Level":"intermediate","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["You will need two boxes or benches spaced a few feet away from each other. Begin by standing on one box facing towards the other platform.","To initiate the movement, gently drop down to the ground between your platforms, allowing the knees and hips to flex.","Reverse the motion by exploding, extending through the hips, knees, and ankles to jump onto the other platform.","Land softly, asborbing the impact through the legs."],"Category":"plyometrics"},"31":{"Name":"Medicine Ball Chest Pass","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["You will need a partner for this exercise. Lacking one, this movement can be performed against a wall.","Begin facing your partner holding the medicine ball at your torso with both hands.","Pull the ball to your chest, and reverse the motion by extending through the elbows. For sports applications, you can take a step as you throw.","Your partner should catch the ball, and throw it back to you.","Receive the throw with both hands at chest height."],"Category":"plyometrics"},"32":{"Name":"Medicine Ball Full Twist","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["shoulders"],"Instructions":["For this exercise you will need a medicine ball and a partner. Stand back to back with your partner, spaced 2-3 feet apart. This will be your starting position.","Hold the ball in front of the trunk. Open the hips and turn the shoulders at the same time as your partner.","For full rotation, you and your partner should twist in the same direction, i.e. counter-clockwise.","Pass the ball to your partner, and both of you can now twist in the opposite direction to repeat the procedure."],"Category":"plyometrics"},"33":{"Name":"Medicine Ball Scoop Throw","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["abdominals","hamstrings","quadriceps"],"Instructions":["Assume a semisquat stance with a medicine ball in your hands. Your arms should hang so the ball is near your feet.","Begin by thrusting the hips forward as you extend through the legs, jumping up.","As you do, swing your arms up and over your head, keeping them extended, releasing the ball at the peak of your movement. The goal is to throw the ball the greatest distance behind you."],"Category":"plyometrics"},"34":{"Name":"Mountain Climbers","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":null,"PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["chest","hamstrings","shoulders"],"Instructions":["Begin in a pushup position, with your weight supported by your hands and toes. Flexing the knee and hip, bring one leg until the knee is approximately under the hip. This will be your starting position.","Explosively reverse the positions of your legs, extending the bent leg until the leg is straight and supported by the toe, and bringing the other foot up with the hip and knee flexed. Repeat in an alternating fashion for 20-30 seconds."],"Category":"plyometrics"},"35":{"Name":"Moving Claw Series","Force":null,"Level":"beginner","Mechanic":"compound","Equipment":null,"PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["calves","quadriceps"],"Instructions":["This move helps prepare your running form to help you excel at sprinting. As you run, be sure to flex the knee, aiming to kick your glutes as the hip extends.","Reload the quad as the leg moves back forward, attacking the ground on the next step.","Ensure that as you run, you block with the arms, punching through in a rapid 1-2 motion."],"Category":"plyometrics"},"36":{"Name":"Overhead Slam","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["lats"],"SecondaryMuscles":[],"Instructions":["Hold a medine ball with both hands and stand with your feet at shoulder width. This will be your starting position.","Initiate the countermovement by raising the ball above your head and fully extending your body.","Reverse the motion, slamming the ball into the ground directly in front of you as hard as you can.","Receive the ball with both hands on the bounce and repeat the movement."],"Category":"plyometrics"},"37":{"Name":"Plyo Push-up","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"body only","PrimaryMuscles":["chest"],"SecondaryMuscles":["shoulders","triceps"],"Instructions":["Move into a prone position on the floor, supporting your weight on your hands and toes.","Your arms should be fully extended with the hands around shoulder width. Keep your body straight throughout the movement. This will be your starting position.","Descend by flexing at the elbow, lowering your chest towards the ground.","At the bottom, reverse the motion by pushing yourself up through elbow extension as quickly as possible. Attempt to push your upper body up until your hands leave the ground.","Return to the starting position and repeat the exercise.","For added difficulty, add claps into the movement while you are air borne."],"Category":"plyometrics"},"38":{"Name":"Quick Leap","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","hamstrings"],"Instructions":["You will need a box for this exerise.","Begin facing the box standing 1-2 feet from its edge.","By utilizing your hips, hop onto the box, landing on both legs. Ensure that you land with your legs bent and your feet flat.","Immediately upon landing, fully extend through the entire body and swing your arms overhead to explode off of the box. Use your legs to absorb the impact of landing."],"Category":"plyometrics"},"39":{"Name":"Return Push from Stance","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["chest","triceps"],"Instructions":["You will need a partner for this drill.","Begin in an athletic 2 or 3 point stance.","At the signal, move into a position to receive the pass from your partner.","Catch the medicine ball with both hands and immediately throw it back to your partner.","You can modify this drill by running different routes."],"Category":"plyometrics"},"40":{"Name":"Rocket Jump","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"body only","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","hamstrings"],"Instructions":["Begin in a relaxed stance with your feet shoulder width apart and hold your arms close to the body.","To initiate the move, squat down halfway and explode back up as high as possible.","Fully extend your entire body, reaching overhead as far as possible. As you land, absorb your impact through the legs."],"Category":"plyometrics"},"41":{"Name":"Scissors Jump","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"body only","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["glutes","hamstrings"],"Instructions":["Assume a lunge stance position with one foot forward with the knee bent, and the rear knee nearly touching the ground.","Ensure that the front knee is over the midline of the foot. Extending through both legs, jump as high as possible, swinging your arms to gain lift.","As you jump as high as you can, switch the position of your legs, moving your front leg to the back and the rear leg to the front.","As you land, absorb the impact through the legs by adopting the lunge position, and repeat."],"Category":"plyometrics"},"42":{"Name":"Side Hop-Sprint","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","hamstrings"],"Instructions":["Stand to the side of a cone or hurdle.","Begin this drill by hopping sideways over the obstacle, rebounding out of your landing to hop back to where you started.","Hop for a prescribed number or repetitions as quickly as possible, and finish this drill by sprinting a short distance upon landing the last hop."],"Category":"plyometrics"},"43":{"Name":"Side Standing Long Jump","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":null,"PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Begin standing with your feet hip width apart in an athletic stance. Your head and chest should be up, knees and hips slightly bent. This will be your starting position.","Leaning to your right, extend through your hips, knees, and ankles to jump into the air. Block with the arms to lead the movement, jumping as far to your right as you can.","Land facing the same direction with your feet hip width apart, absorbing the impact through your lower body."],"Category":"plyometrics"},"44":{"Name":"Side to Side Box Shuffle","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","hamstrings"],"Instructions":["Stand to one side of the box with your left foot resting on the middle of it.","To begin, jump up and over to the other side of the box, landing with your right foot on top of the box and your left foot on the floor. Swing your arms to aid your movement.","Continue shuffling back and forth across the box."],"Category":"plyometrics"},"45":{"Name":"Single-Cone Sprint Drill","Force":"push","Level":"beginner","Mechanic":null,"Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["This drill teaches quick foot action. You need a single cone. Begin standing next to the cone with one arm back and one arm forward.","Chop the feet as quickly as possible, blocking with the arms. Circle the cone, keep your knees up, with violent foot action.","Rest after three trips around the cone."],"Category":"plyometrics"},"46":{"Name":"Single-Leg Hop Progression","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","hamstrings"],"Instructions":["Arrange a line of cones in front of you. Assume a relaxed standing position, balanced on one leg. Raise the knee of your opposite leg. This will be your starting position.","Hop forward, jumping and landing with the same leg over the cone.","Use a countermovement jump to hop from cone to cone.","At the end, turn around and go back on the other leg."],"Category":"plyometrics"},"47":{"Name":"Single-Leg Lateral Hop","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","hamstrings"],"Instructions":["Stand to the side of a cone or hurdle. To get into the start position, stand on one leg with your knee slightly bent.","To begin, execute a counterjump to hop sideways over the cone.","Land on your jumping leg, and immediately rebound out of it by jumping back to the start position.","Continue hopping back and forth."],"Category":"plyometrics"},"48":{"Name":"Single-Leg Stride Jump","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","hamstrings"],"Instructions":["Stand to the side of a box with your inside foot on top of it, close to the edge.","Begin by swinging the arms upward as you push through the top leg, jumping upward as high as possible. Attempt to drive the opposite knee upward.","Land in the same position that you started, using your inside leg to decelerate the impact."],"Category":"plyometrics"},"49":{"Name":"Single Leg Butt Kick","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"body only","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","hamstrings"],"Instructions":["Begin by standing on one leg, with the bent knee raised. This will be your start position.","Using a countermovement jump, take off upward by extending the hip, knee, and ankle of the grounded leg.","Immediately flex the knee and attempt to touch your butt with the heel of your jumping leg.","Return the leg to a partially bent position underneath the hips and land. Your opposite leg should stay in relatively the same position throughout the drill."],"Category":"plyometrics"},"50":{"Name":"Single Leg Push-off","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","hamstrings"],"Instructions":["Stand on the ground with one foot resting on the box, heel close to the edge.","Push off with your foot on top of the box, trying to gain as much height as possible by extending through the hip and knee.","Land with the same foot on top of the box, returning your other foot back to the start position."],"Category":"plyometrics"},"51":{"Name":"Sledgehammer Swings","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["calves","forearms","lats","middle back","shoulders"],"Instructions":["You will need a tire and a sledgehammer for this exercise. Stand in front of the tire about two feet away from it with a staggered stance. Grip the sledgehammer.","If you are right handed, your left hand should be at the bottom of the handle, and your right hand should be choking up closer to the head.","As you bring the sledge up, your right hand slides toward the head; as you swing down, your right hand will slide down to join your left hand. Slam it down as hard as you can against the tire. Control the bounce of the hammer off of the tire.","Repeat on the other side."],"Category":"plyometrics"},"52":{"Name":"Split Jump","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"body only","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["Assume a lunge stance position with one foot forward with the knee bent, and the rear knee nearly touching the ground.","Ensure that the front knee is over the midline of the foot.","Extending through both legs, jump as high as possible, swinging your arms to gain lift.","As you jump, bring your feet together, and move them back to their initial positions as you land.","Absorb the impact by reverting back to the starting position."],"Category":"plyometrics"},"53":{"Name":"Standing Long Jump","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"body only","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings"],"Instructions":["This drill is best done in sand or other soft landing surface. Ensure that you are able to measure distance. Stand in a partial squat stance with feet shoulder width apart.","Utilizing a big arm swing and a countermovement of the legs, jump forward as far as you can.","Attempt to land with your feet out in front you, reaching as far as possible with your legs.","Measure the distance from your landing point to the starting point and track results."],"Category":"plyometrics"},"54":{"Name":"Standing Two-Arm Overhead Throw","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["shoulders"],"SecondaryMuscles":["chest","lats"],"Instructions":["Stand with your feet shoulder width apart holding a medicine ball in both hands. To begin, reach the medicine ball deep behind your head as you bend the knees slightly and lean back.","Violently throw the ball forward, flexing at the hip and using your whole body to complete the movement.","The medicine ball can be thrown to a partner or to a wall, receiving it as it bounces back."],"Category":"plyometrics"},"55":{"Name":"Star Jump","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"body only","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["calves","glutes","hamstrings","shoulders"],"Instructions":["Begin in a relaxed stance with your feet shoulder width apart and hold your arms close to the body.","To initiate the move, squat down halfway and explode back up as high as possible. Fully extend your entire body, spreading your legs and arms away from the body.","As you land, bring your limbs back in and absorb your impact through the legs."],"Category":"plyometrics"},"56":{"Name":"Stride Jump Crossover","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"other","PrimaryMuscles":["quadriceps"],"SecondaryMuscles":["abductors","adductors","calves","hamstrings"],"Instructions":["Stand to the side of a box with your inside foot on top of it, close to the edge.","Begin by swinging the arms upward as you push through the top leg, jumping upward as high as possible. Attempt to drive the opposite knee upward.","Land in the opposite position that you started, on the opposite side of the box. The foot that was initially on the box will now be on the ground, with the opposite foot now on the box.","Repeat the movement, crossing back over to the other side."],"Category":"plyometrics"},"57":{"Name":"Supine Chest Throw","Force":"push","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["triceps"],"SecondaryMuscles":["chest","shoulders"],"Instructions":["This drill is great for chest passes when you lack a partner or a wall of sufficient strength. Lay on the ground on your back with your knees bent.","Begin with the ball on your chest, held with both hands on the bottom.","Explode up, extending through the elbow to throw the ball directly above you as high as possible.","Catch the ball with both hands as it comes down."],"Category":"plyometrics"},"58":{"Name":"Supine One-Arm Overhead Throw","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["chest","lats","shoulders"],"Instructions":["Lay on the ground on your back with your knees bent. Hold the ball with one hand, extending the arm fully behind your head. This will be your starting position.","Initiate the movement at the shoulder, throwing the ball directly forward of you as you sit up, attempting to go for maximum distance.","The ball can be thrown to a partner or bounced off of a wall."],"Category":"plyometrics"},"59":{"Name":"Supine Two-Arm Overhead Throw","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"medicine ball","PrimaryMuscles":["abdominals"],"SecondaryMuscles":["chest","lats","shoulders"],"Instructions":["Lay on the ground on your back with your knees bent.","Hold the ball with both hands, extending the arms fully behind your head. This will be your starting position.","Initiate the movement at the shoulder, throwing the ball directly forward of you as you sit up, attempting to go for maximum distance.","The ball can be thrown to a partner or bounced off of a wall."],"Category":"plyometrics"},"60":{"Name":"Vertical Swing","Force":"pull","Level":"beginner","Mechanic":"compound","Equipment":"dumbbell","PrimaryMuscles":["hamstrings"],"SecondaryMuscles":["glutes","quadriceps","shoulders"],"Instructions":["Allow the dumbbell to hang at arms length between your legs, holding it with both hands. Keep your back straight and your head up.","Swing the dumbbell between your legs, flexing at the hips and bending the knees slightly.","Powerfully reverse the motion by extending at the hips, knees, and ankles to propel yourself upward, swinging the dumbell over your head.","As you land, absorb the impact through your legs and draw the dumbbell to your torso before the next repetition."],"Category":"plyometrics"}}